{
  "area": "language",
  "area_name": "Language",
  "total_works": 43,
  "last_updated": "2026-02-01",
  "works": [
    {
      "work_id": "la_enrichment_vocabulary",
      "name": "Vocabulary Enrichment",
      "name_chinese": "蒙特梭利词汇丰富",
      "slug": "enrichment-vocabulary",
      "area": "language",
      "category": "Oral Language",
      "sequence": 1,
      "age_range": "2.5-6 years",
      "quick_guide": "• Daily exposure to new words through formal Three Period Lessons\n• Use real objects, pictures, and classified cards to teach vocabulary\n• Introduce scientific names and descriptive words from the environment\n• Practice vocabulary through games, songs, and storytelling\n• Create opportunities for repetition and practice in authentic contexts",
      "presentation_steps": [
        {
          "step": 1,
          "title": "Prepare Vocabulary Lessons",
          "description": "Select vocabulary to teach based on classroom environment, sensorial activities, and child interests. Gather real objects or high-quality picture cards. Plan Three Period Lessons (introduction, recognition, recall) for systematic teaching.",
          "tip": "Montessori teachers should maintain a personal repertoire of vocabulary topics organized by category (colors, textures, qualities, actions, scientific names)."
        },
        {
          "step": 2,
          "title": "Present Real Objects First",
          "description": "Show children actual objects in the environment. Name each object clearly and have children repeat. Allow children to handle, examine, and experience the object through multiple senses.",
          "tip": "Start with concrete, familiar items before introducing abstract concepts or specialized vocabulary."
        },
        {
          "step": 3,
          "title": "Introduce Associated Qualities",
          "description": "Expand vocabulary by teaching adjectives that describe the objects. Use sensorial materials (rough/smooth, hard/soft) to teach descriptive words through direct experience.",
          "tip": "Connect quality words to sensorial activities children have already completed for deeper understanding."
        },
        {
          "step": 4,
          "title": "Use Classification Games",
          "description": "Play vocabulary association games where children group objects by category, function, or quality. Examples: vegetables vs. fruits, rough vs. smooth items.",
          "tip": "Make games playful and engaging; children learn vocabulary through active participation and movement."
        },
        {
          "step": 5,
          "title": "Practice Through Expression",
          "description": "Create contexts where children use new vocabulary repeatedly: conversations, storytelling, songs, and descriptive activities. Encourage them to use new words in their daily communication.",
          "tip": "Vocabulary becomes internalized through use and slight adjustments children make each time they speak the word."
        }
      ],
      "direct_aims": [
        "Expand spoken vocabulary",
        "Learn precise scientific and descriptive names",
        "Develop ability to categorize and classify objects",
        "Build foundation for reading and writing"
      ],
      "indirect_aims": [
        "Develop listening skills",
        "Foster curiosity about the environment",
        "Build confidence in oral expression",
        "Prepare for grammatical analysis",
        "Support cognitive organization and logical thinking"
      ],
      "materials": [
        "Real objects",
        "Pictures",
        "Books"
      ],
      "control_of_error": "Teacher observation of correct pronunciation and application; peer feedback during games; child's ability to identify and name objects independently",
      "prerequisites": [],
      "points_of_interest": [
        "Multisensory approach to word learning",
        "Connection between words and concrete experiences",
        "Vocabulary organized by category and function",
        "Daily opportunities for repetition and practice",
        "Child-directed vocabulary expansion"
      ],
      "variations": [
        "Vocabulary enrichment through nature walks and outdoor exploration",
        "Thematic vocabulary units organized by topics (animals, plants, weather)",
        "Vocabulary cards with images and words combined",
        "Small group vocabulary discussions during snack time",
        "Vocabulary journals where children draw and label items"
      ],
      "common_challenges": [
        "Children may not retain new vocabulary without repeated use",
        "Difficulty connecting abstract words to concrete experiences",
        "Shyness preventing oral expression of new words",
        "Over-complexity of scientific terminology",
        "Inconsistency in vocabulary presentation across activities"
      ],
      "video_search_term": "montessori vocabulary enrichment objects",
      "data_status": "needs_guide",
      "materials_needed": [
        "Real objects from classroom environment",
        "Picture cards and classified card sets",
        "Sensorial materials",
        "Books and poetry",
        "Props for songs and storytelling"
      ],
      "extensions": [
        "Connection to writing through labeling activities",
        "Three-part cards for vocabulary review and self-checking",
        "Vocabulary games with increasing difficulty",
        "Introduction to synonyms and related words",
        "Scientific nomenclature and taxonomic vocabulary"
      ],
      "vocabulary": [
        "Enrichment",
        "Nomenclature",
        "Vocabulary",
        "Classification",
        "Descriptor",
        "Adjective",
        "Scientific name"
      ],
      "parent_description": "Vocabulary Enrichment is the foundation of Montessori language development. Through daily exposure to new words in meaningful contexts, children learn the names of objects in their environment, the qualities that describe them, and the actions they perform. This work happens naturally throughout the classroom as the teacher introduces materials, during snack conversations, and through games and storytelling. By learning both everyday and scientific vocabulary, children develop a rich, precise way of expressing their thoughts and observations.",
      "why_it_matters": "Rich vocabulary is the cornerstone of literacy development. Children with extensive vocabulary find reading easier and develop stronger comprehension skills. Vocabulary enrichment also supports cognitive development by helping children organize their understanding of the world into clear categories. This work directly prepares children for reading, writing, and all future academic learning."
    },
    {
      "work_id": "la_classified_cards",
      "name": "Classified Cards (Nomenclature Cards)",
      "name_chinese": "蒙特梭利分类卡片",
      "slug": "classified-cards",
      "area": "language",
      "category": "Oral Language",
      "sequence": 2,
      "age_range": "2.5-6 years",
      "quick_guide": "• Three-part card format: picture labeled, picture unlabeled, label only\n• Introduce using Three Period Lesson across multiple days\n• Begin with very familiar objects and categories\n• Progress from concrete to abstract presentations\n• Create opportunities for independent practice and extension",
      "presentation_steps": [
        {
          "step": 1,
          "title": "Prepare Materials",
          "description": "Gather a set of classified cards (3-6 related items). Ensure pictures are clear, realistic, and appropriately sized. Keep cards organized in categories: animals, vehicles, kitchen items, clothing, etc.",
          "tip": "For toddlers, use actual objects paired with pictures; for older children, pictures alone suffice. Quality images support accurate learning."
        },
        {
          "step": 2,
          "title": "First Period: Introduction",
          "description": "Place the labeled picture cards on the table. Point to each card and say: 'This is a cat.' Have the child repeat: 'Cat.' Continue with 2-3 cards. Keep lesson brief (3-5 minutes).",
          "tip": "Focus on clear pronunciation and natural cadence. The child's repetition solidifies the auditory-visual connection."
        },
        {
          "step": 3,
          "title": "Second Period: Recognition and Handling",
          "description": "On subsequent days, present unlabeled pictures and labels separately. Say: 'Show me the cat.' Have the child point. Then: 'Where does this label go?' Child matches label to picture. Repeat with different cards over several days.",
          "tip": "Second period is longer and deeper. Allow children to handle cards, turn them over, examine details. This repetition builds memory and recognition."
        },
        {
          "step": 4,
          "title": "Third Period: Recall",
          "description": "Present unlabeled pictures. Ask: 'What is this?' Child responds with the name. Or show labels and ask: 'Which picture matches this word?' Child selects correct card.",
          "tip": "If child hesitates, return to second period activities. Don't rush to third period until recall is secure."
        },
        {
          "step": 5,
          "title": "Independent Practice",
          "description": "Child works independently matching pictures to labels, organizing cards by category, or creating sequences. Provide a control card showing correct answers for self-correction.",
          "tip": "Store materials accessibly so children can return to favorites and deepen their learning."
        }
      ],
      "direct_aims": [
        "Learn names of objects in categories",
        "Develop visual discrimination",
        "Build vocabulary systematically",
        "Prepare for reading through sight recognition"
      ],
      "indirect_aims": [
        "Develop logical thinking and classification skills",
        "Build independence and concentration",
        "Strengthen fine motor control through handling cards",
        "Create personal investment in learning",
        "Support phonetic awareness as labels are read"
      ],
      "materials": [
        "Classified card sets (animals, plants, vehicles, etc.)"
      ],
      "control_of_error": "Control card with correct answers; teacher observation; child's ability to match and name independently; visual self-checking",
      "prerequisites": [],
      "points_of_interest": [
        "The three-part format: picture with label, picture alone, label alone",
        "Movement of matching and organizing cards",
        "Visual discrimination of subtle differences",
        "Building personal vocabulary collection",
        "Sensorial quality of the beautiful cards"
      ],
      "variations": [
        "Object to picture matching before introducing labels",
        "Picture to picture matching activities",
        "Categorization by function, color, or habitat",
        "Combining multiple sets for extended classification activities",
        "Creating personal nomenclature cards from magazine cutouts"
      ],
      "common_challenges": [
        "Children memorize position of cards rather than truly learning",
        "Difficulty with very similar-looking items (differentiating birds)",
        "Loss of interest if material is presented too long",
        "Mixed-age groups may have vastly different readiness",
        "Damage to cards from heavy handling"
      ],
      "video_search_term": "montessori classified cards single category",
      "data_status": "needs_guide",
      "materials_needed": [
        "Sets of 3-part nomenclature cards (picture labeled, picture unlabeled, label)",
        "Organized containers or boxes for storage",
        "Control cards showing correct answers",
        "Real objects to supplement card work (optional)",
        "Baskets for independent organization"
      ],
      "extensions": [
        "Moving from categories to subcategories (animals → mammals → carnivores)",
        "Associating multiple attributes with objects (color, size, texture, function)",
        "Creating personal word banks or journals with illustrated vocabulary",
        "Introduction to phonetics through reading labels",
        "Development of writing skills through copying labels"
      ],
      "vocabulary": [
        "Nomenclature",
        "Classification",
        "Category",
        "Label",
        "Picture",
        "Match",
        "Organize"
      ],
      "parent_description": "Classified Cards, also called nomenclature cards or 3-part cards, are a beloved Montessori language tool. Children learn the names of objects through beautiful illustrated cards presented in three stages: first seeing the picture with its label, then recognizing the picture without the label, and finally recalling the name when shown the picture alone. This systematic approach builds vocabulary with precision and allows children to work independently at their own pace. The cards cover diverse topics from basic household items to scientific categories like insects and plants.",
      "why_it_matters": "Nomenclature cards bridge the gap between oral language and reading. By systematically learning to match pictures to names, children develop visual discrimination skills essential for reading. The structured three-part lesson format respects children's learning pace and builds confidence. This work is particularly valuable because it's self-correcting and allows children to practice independently, supporting the Montessori principle of self-directed learning."
    },
    {
      "work_id": "la_object_picture_matching",
      "name": "Object to Picture Matching",
      "name_chinese": "蒙特梭利实物图片配对",
      "slug": "object-picture-matching",
      "area": "language",
      "category": "Oral Language",
      "sequence": 3,
      "age_range": "18 months-4 years",
      "quick_guide": "• Start with real objects and realistic photographs\n• Match 3-D objects to 2-D pictures\n• Begin with very familiar items\n• Gradually introduce less obvious or smaller objects\n• Use clear, uncluttered images to focus attention",
      "presentation_steps": [
        {
          "step": 1,
          "title": "Select Materials",
          "description": "Choose real objects or high-quality figurines (Schleich animals, small replicas) and corresponding photographs or picture cards. Start with very familiar items: common animals, fruit, household objects.",
          "tip": "Ensure the objects and pictures look obviously similar. For toddlers, background should be removed from photos so the object stands out clearly."
        },
        {
          "step": 2,
          "title": "Introduction Activity",
          "description": "Place 2-3 real objects on the left and corresponding picture cards on the right. Model the activity: pick up an object, examine it, find the matching picture, place it beside the picture. Invite child to try.",
          "tip": "Use language: 'This is a banana. Where is the banana in the pictures? Yes, here is the banana!' Clear naming helps child make the connection."
        },
        {
          "step": 3,
          "title": "Provide Independent Work",
          "description": "Create a work basket with 4-6 objects or figurines and matching picture cards. Place pictures in a line or scattered for the child to find matches independently.",
          "tip": "Organization matters. A tray or basket helps contain materials and signal that this is a complete work."
        },
        {
          "step": 4,
          "title": "Expand Complexity",
          "description": "As child masters simple matches, introduce more items, objects that are less familiar, or pictures with more detail or background. Add language extension: 'What color is the apple? Where else do we see apples?'",
          "tip": "Move at child's pace. Some children need many repetitions with the same materials before expanding."
        },
        {
          "step": 5,
          "title": "Observation and Extension",
          "description": "Observe which materials the child gravitates toward. Extend with questions: 'Find all the animals,' 'Where would we find this?' Support vocabulary expansion as child works.",
          "tip": "This work naturally leads to conversation and language enrichment—use it as an opportunity for vocabulary development."
        }
      ],
      "direct_aims": [
        "Connect real objects to their pictorial representations",
        "Develop visual discrimination",
        "Expand vocabulary through naming",
        "Build abstract thinking skills"
      ],
      "indirect_aims": [
        "Develop logical thinking and classification",
        "Support pre-reading skills (symbols represent objects)",
        "Build fine motor control through handling objects",
        "Foster independence and concentration",
        "Develop memory skills"
      ],
      "materials": [
        "Miniature objects",
        "Matching picture cards"
      ],
      "control_of_error": "Visual comparison—object and picture should obviously match; teacher provides a control card showing correct pairings; child can self-check by placing matched pair together",
      "prerequisites": [
        "la_classified_cards"
      ],
      "points_of_interest": [
        "The concrete-to-abstract connection (real to picture)",
        "Sensorial exploration of real objects",
        "Visual discrimination and matching",
        "Delight in recognition ('That's me!')",
        "Movement and organization of materials"
      ],
      "variations": [
        "Object-to-object matching (before introducing pictures)",
        "Picture-to-picture matching (most abstract)",
        "Matching objects grouped by category",
        "Adding texture cards (rough/smooth) matched to objects",
        "Creating personal photo albums of family objects"
      ],
      "common_challenges": [
        "Child wants to play with objects rather than match them",
        "Difficulty with items that don't look exactly like pictures",
        "Loss of interest if material becomes too easy too quickly",
        "Objects or pictures get damaged from heavy use",
        "Child memorizes position rather than truly matching"
      ],
      "video_search_term": "montessori object picture matching",
      "data_status": "needs_guide",
      "materials_needed": [
        "Real small objects or high-quality figurines (animals, vehicles, fruit, etc.)",
        "Clear photographs or picture cards of matching objects",
        "Trays or baskets for organizing materials",
        "Control card showing correct matches (optional)",
        "Storage containers for keeping sets organized"
      ],
      "extensions": [
        "Introduction to written labels on picture cards",
        "Categorization activities (group by habitat, function, color)",
        "Three-part card format progression (object, unlabeled picture, labeled picture)",
        "Sorting by attributes (size, color, number of legs)",
        "Building comprehension through questions: 'Where do we find this?'"
      ],
      "vocabulary": [
        "Match",
        "Picture",
        "Object",
        "Same",
        "Different",
        "Find",
        "Compare"
      ],
      "parent_description": "Object to Picture Matching is one of the first Montessori language works. Children learn to recognize that a real object and its photograph represent the same thing—a crucial pre-reading skill. Starting with very familiar items, children pick up a real object, examine it, and find its matching picture. This work develops visual discrimination and vocabulary while teaching the abstract concept that a 2-D image can represent a 3-D object. It's a natural precursor to reading, where letters and words are symbols that represent sounds and meanings.",
      "why_it_matters": "This work is foundational for literacy development. Reading requires understanding that symbols (letters and words) represent real things and ideas. Object to picture matching teaches this abstract concept concretely. It also supports visual discrimination skills needed for letter recognition, builds vocabulary through direct experience, and develops classification and logical thinking skills essential for all learning."
    },
    {
      "work_id": "la_sound_games",
      "name": "Sound Games (I Spy)",
      "name_chinese": "蒙特梭利声音游戏",
      "slug": "sound-games",
      "area": "language",
      "category": "Oral Language Development",
      "sequence": 4,
      "age_range": "primary_year1",
      "quick_guide": "• Oral language game using 'I Spy' format to develop phonemic awareness\n• Isolates beginning, ending, and middle sounds in words\n• Essential pre-reading activity connecting spoken sounds to future letter learning\n• Progresses from beginning sounds to ending sounds to middle sounds\n• Uses real objects initially, then moves to pictures and abstract thinking",
      "presentation_steps": [
        {
          "step": 1,
          "title": "Object Collection",
          "description": "Gather 3-5 small objects with distinct beginning sounds (e.g., ball, car, dog figurine).",
          "tip": "Start with objects whose names the child knows well."
        },
        {
          "step": 2,
          "title": "Introduction",
          "description": "'I'm going to play a game with sounds. Listen carefully to the first sound.'",
          "tip": "Create playful, game-like atmosphere."
        },
        {
          "step": 3,
          "title": "Beginning Sound",
          "description": "'I spy with my little eye something that begins with /b/.' Emphasize the sound.",
          "tip": "Use phonetic sound, not letter name."
        },
        {
          "step": 4,
          "title": "Child Identifies",
          "description": "Child finds object. Confirm: 'Yes! Ball begins with /b/.'",
          "tip": "Exaggerate the beginning sound."
        },
        {
          "step": 5,
          "title": "Extend Practice",
          "description": "Continue with other objects. Let child give clues too.",
          "tip": "Switch roles to reinforce learning."
        },
        {
          "step": 6,
          "title": "Ending Sounds",
          "description": "Once beginning sounds are mastered, progress to 'ends with /l/' format.",
          "tip": "Ending sounds are harder - wait for readiness."
        }
      ],
      "direct_aims": [
        "Phonemic awareness",
        "Sound isolation",
        "Auditory discrimination",
        "Sound blending",
        "Sound segmenting"
      ],
      "indirect_aims": [
        "Preparation for reading and writing"
      ],
      "materials": [
        "Objects with distinct sounds",
        "Sound baskets",
        "Elkonin boxes",
        "Counters/chips"
      ],
      "control_of_error": "Incorrect sound identification",
      "prerequisites": [],
      "points_of_interest": [
        "Game format creates engagement",
        "Discovery of sound patterns",
        "Preparation for reading"
      ],
      "variations": [
        "I Spy in the environment",
        "Sound sorting games",
        "Rhyming variations"
      ],
      "common_challenges": [
        "Confusing sound with letter name",
        "Difficulty isolating sounds",
        "Limited vocabulary for objects"
      ],
      "video_search_term": "montessori I spy initial sounds",
      "data_status": "complete",
      "materials_needed": [
        "Objects with distinct sounds",
        "Sound baskets",
        "Elkonin boxes",
        "Counters/chips"
      ],
      "parent_description": "Your child is playing listening games to discover the individual sounds hidden in words. Using objects around the classroom, the teacher asks 'I spy something that starts with /s/' and your child listens carefully to isolate that beginning sound. This playful auditory work awakens your child's awareness of phonemic sounds—the building blocks of both reading and writing.",
      "why_it_matters": "Phonemic awareness is the foundation for literacy. Learning to hear and isolate individual sounds helps children crack the code of how spoken language maps to written letters, making later reading instruction far more meaningful."
    },
    {
      "work_id": "la_rhyming",
      "name": "Rhyming Activities",
      "name_chinese": "蒙特梭利押韵活动",
      "slug": "rhyming",
      "area": "language",
      "category": "Oral Language",
      "sequence": 5,
      "age_range": "2.5-6 years",
      "quick_guide": "• Gather objects or picture cards that rhyme together\n• Emphasize final sounds in words through listening activities\n• Use songs, poems, and rhyming books\n• Incorporate movement with rhyming words\n• Create rhyming baskets with themed object groups",
      "presentation_steps": [
        {
          "step": 1,
          "title": "Introduce Rhyming Through Familiar Poems",
          "description": "Recite or read familiar nursery rhymes and poems with strong rhyming patterns. Emphasize the rhyming words by slightly elongating them. Examples: 'Twinkle, Twinkle, Little Star' or 'Jack and Jill.' Ask child if they notice words that sound alike.",
          "tip": "Choose poems with clear rhymes and repetition. Hear the rhythm and rhyme aloud; reading silently misses the joy of sound patterns."
        },
        {
          "step": 2,
          "title": "Present Rhyming Objects",
          "description": "Create a basket with small objects that rhyme: cat, hat, bat, rat. Hold up one object (cat) and say: 'This is a cat. Can you find something that rhymes with cat?' Guide child to find the rhyming objects.",
          "tip": "Begin with objects that rhyme perfectly. Start with just 2-3 rhyming pairs before expanding to larger sets."
        },
        {
          "step": 3,
          "title": "Sing Rhyming Songs",
          "description": "Teach songs with strong rhyme patterns and repetition. Songs combine auditory learning with music, which enhances memory. Examples: 'Twinkle, Twinkle,' 'Baa, Baa, Black Sheep,' action songs.",
          "tip": "Pair songs with movements or gestures to create a multisensory experience. Music and movement deepen learning and retention."
        },
        {
          "step": 4,
          "title": "Create Rhyming Games",
          "description": "Play classification games: 'Let's find all the words that rhyme with cat!' Or 'I spy something that rhymes with...' Play rhyming memory games or match rhyming picture cards.",
          "tip": "Keep games playful and pressure-free. If child doesn't find rhymes, gently suggest them and continue the game."
        },
        {
          "step": 5,
          "title": "Introduce Rhyming Books",
          "description": "Read books with strong rhyming patterns during story time. Let children predict rhyming words: 'The cat sat on the...' Pause and let child provide 'mat.' Celebrate correct guesses with enthusiasm.",
          "tip": "Predictable rhyming books support early reading development and engage children in story participation."
        }
      ],
      "direct_aims": [
        "Develop phonemic awareness of ending sounds",
        "Recognize sound patterns and rhymes",
        "Build vocabulary",
        "Prepare for phonetic reading and spelling"
      ],
      "indirect_aims": [
        "Develop listening and auditory discrimination skills",
        "Build memory through rhythm and repetition",
        "Foster love of language and literature",
        "Support language development and fluency",
        "Prepare for phonemic awareness and literacy"
      ],
      "materials": [
        "Rhyming card sets",
        "Rhyming objects"
      ],
      "control_of_error": "Adult confirmation of rhymes; peer feedback in group games; obvious match of rhyming objects; children's enjoyment and repeated engagement with activity",
      "prerequisites": [
        "la_sound_games"
      ],
      "points_of_interest": [
        "The sound patterns and rhythm of rhyming words",
        "Delight in predicting rhyming words",
        "Movement synchronized with rhyming songs",
        "Pattern recognition in language",
        "Playfulness and humor of rhymes"
      ],
      "variations": [
        "Rhyming baskets organized by family (cat family: cat, hat, bat, rat, mat)",
        "Rhyming games with movement (hop when you hear rhyming words)",
        "Finger plays and action songs with rhyming text",
        "Creating new rhyming words with nonsense sounds",
        "Rhyming in different languages for multilingual classrooms"
      ],
      "common_challenges": [
        "Children confuse rhyming with similar meanings ('cat' and 'kitten')",
        "Difficulty isolating the final sound",
        "Shyness or reluctance to participate verbally",
        "Objects or pictures that rhyme only with adult accent",
        "Over-reliance on visual similarity rather than sound"
      ],
      "video_search_term": "montessori rhyming recognition",
      "data_status": "needs_guide",
      "materials_needed": [
        "Small objects that rhyme (cat, bat, hat, mat; duck, truck, muck, stuck)",
        "Rhyming picture cards",
        "Poetry and rhyming books",
        "Baskets or containers for rhyming object sets",
        "Optional: instruments or props for singing"
      ],
      "extensions": [
        "Transition to introduction of rhyming word families and phonograms",
        "Writing rhyming words after establishing the concept orally",
        "Creating personal rhyming books or illustrated rhymes",
        "Exploring words that don't rhyme to contrast concept",
        "Connection to poetry and creative writing"
      ],
      "vocabulary": [
        "Rhyme",
        "Sound alike",
        "Ending sound",
        "Phoneme",
        "Rhyming family",
        "Pattern",
        "Rhythm"
      ],
      "parent_description": "Rhyming Activities are a joyful introduction to the sound patterns of language. Children listen to familiar nursery rhymes and poems, play with rhyming objects, and sing songs where words rhyme. Through these playful activities, children develop sensitivity to the final sounds of words—a critical skill for learning to read phonetically. Rhyming is both delightful and educational; the musicality and predictability of rhyming text makes language memorable and builds the phonemic awareness necessary for reading.",
      "why_it_matters": "Rhyming is one of the most important precursors to reading success. Children who develop strong rhyming skills and phonemic awareness learn to read more easily and with better comprehension. Rhyming teaches children to break words into sound components and recognize patterns—foundational skills for decoding words, spelling, and understanding how language works. The playful, multisensory nature of rhyming activities makes learning effortless for children."
    },
    {
      "work_id": "la_storytelling",
      "name": "Storytelling and Sequencing",
      "name_chinese": "蒙特梭利讲故事",
      "slug": "storytelling",
      "area": "language",
      "category": "Oral Language",
      "sequence": 6,
      "age_range": "3-6 years",
      "quick_guide": "• Use sequencing cards showing beginning, middle, and end of stories\n• Introduce story structure through familiar tales\n• Have children retell stories in correct order\n• Create original stories based on picture sequences\n• Develop oral narrative skills and comprehension",
      "presentation_steps": [
        {
          "step": 1,
          "title": "Introduce Story Structure",
          "description": "Tell a very simple familiar story with clear beginning, middle, and end (e.g., making a sandwich: get bread, add filling, eat it). Use clear language: 'First... Then... Last...' Emphasize the sequence of events.",
          "tip": "Start with stories children know well (fairy tales, daily routines). Familiarity helps them focus on sequence rather than content."
        },
        {
          "step": 2,
          "title": "Present Sequencing Cards",
          "description": "Show 3-4 picture cards in sequence telling a simple story. Lay them out in order. Point to each and narrate: 'First, the boy wakes up. Then, he eats breakfast. Last, he goes to school.' Have child repeat sequence.",
          "tip": "Begin with 3-card sequences. As skill develops, expand to 4-6 cards. Clear, realistic illustrations support understanding."
        },
        {
          "step": 3,
          "title": "Mix and Re-sequence Cards",
          "description": "Shuffle the picture cards. Ask child to put them in the correct order. Say: 'What happens first? What comes next? What happens last?' Child arranges cards and can narrate the story.",
          "tip": "Allow child to move and handle cards. Physical manipulation supports learning and memory."
        },
        {
          "step": 4,
          "title": "Develop Oral Narration",
          "description": "As child sequences cards, encourage storytelling: 'Tell me the story using these pictures.' Support with prompts: 'What's happening here? Why do you think...? What comes next?' Build confidence in oral expression.",
          "tip": "Accept child's language as is; don't correct grammar or add words. Focus on encouraging narrative expression."
        },
        {
          "step": 5,
          "title": "Create New Stories",
          "description": "Once child understands sequencing, create original stories: 'What if we put this card here instead?' Create silly sequences and imaginative narratives based on cards.",
          "tip": "Creativity and play are essential. Child learns sequencing logic through playful experimentation."
        }
      ],
      "direct_aims": [
        "Understand chronological order and sequence",
        "Develop comprehension of story structure",
        "Build oral narrative and storytelling skills",
        "Expand vocabulary and expression"
      ],
      "indirect_aims": [
        "Develop logical thinking and planning skills",
        "Support executive functioning and organization",
        "Build confidence in oral expression",
        "Prepare for reading comprehension",
        "Foster creativity and imagination"
      ],
      "materials": [
        "Sequence cards",
        "Story props",
        "Felt board"
      ],
      "control_of_error": "Logical sequence of events; adult or peer confirmation; children's ability to narrate consistent story; control card showing correct sequence",
      "prerequisites": [
        "la_enrichment_vocabulary"
      ],
      "points_of_interest": [
        "Visual narrative progression from picture to picture",
        "Understanding cause and effect relationships",
        "Predicting what happens next",
        "The satisfaction of correct sequencing",
        "Creation of original stories"
      ],
      "variations": [
        "Acting out sequences with puppets or props",
        "Using actual objects or baskets of items to show sequence",
        "Sequencing child's own daily routines or school activities",
        "Sequencing nature processes (plant growth, water cycle)",
        "Combining sequences to create longer, more complex stories"
      ],
      "common_challenges": [
        "Children may focus on details rather than overall sequence",
        "Difficulty with abstract or unfamiliar story concepts",
        "Some children create illogical sequences and resist correction",
        "Picture quality or clarity affecting understanding",
        "Shyness preventing verbal narration"
      ],
      "video_search_term": "montessori story sequencing",
      "data_status": "needs_guide",
      "materials_needed": [
        "Story sequence card sets (3-6 cards per set)",
        "Variety of topics: daily routines, familiar stories, nature processes",
        "Picture cards showing clear narrative progression",
        "Control cards showing correct answers",
        "Props or puppets for acting out stories (optional)"
      ],
      "extensions": [
        "Transition to written sequencing words (first, then, last, next)",
        "Creating illustrated stories or storybooks",
        "Recording oral stories for playback and self-reflection",
        "Introducing narrative grammar and story elements",
        "Connection to writing through dictation of sequenced stories"
      ],
      "vocabulary": [
        "Sequence",
        "First",
        "Next",
        "Then",
        "Last",
        "After",
        "Before",
        "Story",
        "Beginning",
        "Middle",
        "End"
      ],
      "parent_description": "Storytelling and Sequencing helps children understand that stories have structure: a beginning, middle, and end. Using picture cards showing the steps of a simple story, children learn to recognize the order of events and develop the ability to retell stories with expression. This work develops both comprehension and narrative skills—children learn to think about how events connect logically and to tell stories with clarity. As children become skilled, they create original stories, supporting imagination and creative thinking.",
      "why_it_matters": "Strong narrative skills are essential for reading comprehension and academic success. Understanding story sequence and structure helps children follow complex texts, make predictions, and understand cause-and-effect relationships. Storytelling builds vocabulary, develops verbal fluency, and supports executive functioning as children learn to organize events logically. This work also fosters imagination and creativity while building the language skills children need for all future learning."
    },
    {
      "work_id": "la_poems_songs",
      "name": "Poems, Songs, and Fingerplays",
      "name_chinese": "蒙特梭利诗歌歌曲",
      "slug": "poems-songs",
      "area": "language",
      "category": "Oral Language",
      "sequence": 7,
      "age_range": "2.5-6 years",
      "quick_guide": "• Build a personal repertoire of age-appropriate poems, songs, and fingerplays\n• Use poetry and songs during circle time and transitions\n• Teach fingerplays that coordinate movement with language\n• Repeat the same poems/songs regularly for memorization\n• Emphasize the joy, rhythm, and musicality of language",
      "presentation_steps": [
        {
          "step": 1,
          "title": "Build Your Repertoire",
          "description": "Collect and memorize a personal collection of poems, songs, and fingerplays suitable for children's developmental stages. Organize by theme (seasons, holidays, animals, emotions) and by type (nursery rhymes, action songs, lullabies).",
          "tip": "Montessori teachers should maintain a memorized repertoire for recitation. This allows spontaneous sharing and full engagement without distracting from eye contact."
        },
        {
          "step": 2,
          "title": "Share During Circle Time",
          "description": "Present poems and songs during group gathering time. Say: 'Listen to this poem,' and recite with natural expression and rhythm. Repeat the same poems multiple times over weeks so children learn them.",
          "tip": "Poetry and songs become meaningful through repeated exposure. Children benefit from hearing the same poem 5-10 times."
        },
        {
          "step": 3,
          "title": "Teach Fingerplays",
          "description": "Choose a fingerplay with simple movements coordinating with words. Model the movements slowly while reciting. Invite children to join gradually. Keep movements deliberate and clear.",
          "tip": "Fingerplays unite language, movement, and music. This multisensory approach supports memory and engagement."
        },
        {
          "step": 4,
          "title": "Use Poems for Transitions",
          "description": "Use short poems or songs during transitions: cleanup, moving to lunch, preparation for naptime. Examples: 'Clean up, clean up, everybody everywhere' or transition songs specific to the classroom.",
          "tip": "Poetry makes transitions smooth and enjoyable. Children anticipate and participate willingly when transitions are set to song."
        },
        {
          "step": 5,
          "title": "Invite Participation",
          "description": "As children become familiar with poems and songs, pause for them to complete lines or repeat refrains. Some children may enjoy reciting solos or small groups. Celebrate participation with genuine enthusiasm.",
          "tip": "Never force participation. Some children participate by listening and enjoying before choosing to speak aloud."
        }
      ],
      "direct_aims": [
        "Build vocabulary through literary exposure",
        "Develop phonemic awareness and sound discrimination",
        "Memorize and recite poetry",
        "Build fluency and natural language patterns"
      ],
      "indirect_aims": [
        "Foster love of language and literature",
        "Build memory and concentration",
        "Develop musicality and rhythm sense",
        "Support emotional expression",
        "Prepare foundation for reading and writing"
      ],
      "materials": [
        "Song charts",
        "Poetry cards"
      ],
      "control_of_error": "Accuracy of words as poems are memorized; appropriateness of rhythm and pace; children's engagement and enjoyment; ability to join in at expected moments",
      "prerequisites": [],
      "points_of_interest": [
        "The rhythm and musicality of language",
        "Coordination of movement with words",
        "Predictability and repetition supporting memory",
        "Emotional expression through poetry",
        "The playfulness and humor in nursery rhymes"
      ],
      "variations": [
        "Themed poetry collections (seasons, animals, emotions)",
        "Songs from different cultures and languages",
        "Poetry with exaggerated movements for kinesthetic learners",
        "Creating class poetry books with illustrated poems",
        "Pairing fingerplays with sensory or Practical Life activities"
      ],
      "common_challenges": [
        "Teacher not having memorized poems available",
        "Selecting poetry with content or language above children's level",
        "Children's shyness about singing or moving",
        "Difficulty sustaining attention if poetry becomes too long",
        "Over-use of recorded music rather than live human voice"
      ],
      "video_search_term": "montessori classroom songs",
      "data_status": "needs_guide",
      "materials_needed": [
        "Collection of poetry and songs (memorized or in books for reference)",
        "Picture books with poems and illustrated stories",
        "Musical instruments or props for songs (optional)",
        "Small objects or puppets for acting out fingerplays",
        "Recordings of children's songs (optional enhancement)"
      ],
      "extensions": [
        "Introducing concept of rhyme and rhythm in poetry",
        "Creating original poems or verses",
        "Illustrating favorite poems or songs",
        "Reading poetry aloud with expression and feeling",
        "Connection to writing through dictation of original poems"
      ],
      "vocabulary": [
        "Poem",
        "Song",
        "Fingerplay",
        "Rhythm",
        "Rhyme",
        "Verse",
        "Chorus",
        "Stanza",
        "Melody"
      ],
      "parent_description": "Poems, Songs, and Fingerplays are woven throughout the Montessori day. Children hear poetry and songs recited by teachers during circle time, transitions, and quiet moments. These literary experiences expose children to the beauty and musicality of language while teaching new vocabulary and sound patterns. Fingerplays coordinate movement with language, creating a multisensory experience that supports memory and engagement. Through repetition, children memorize poems and songs, building confidence in their ability to express themselves. Poetry fosters a lifelong love of language and literature.",
      "why_it_matters": "Poetry and music accelerate brain development, particularly in areas responsible for language, sound processing, and reading. Rhyming, rhythm, and repetition in poems and songs build phonemic awareness—the foundation of reading. Memorizing poetry strengthens memory and concentration. The emotional resonance of poetry and music supports social-emotional development. Perhaps most importantly, sharing poems and songs creates a joyful association with language, fostering the love of reading and learning that lasts a lifetime."
    },
    {
      "work_id": "la_conversation",
      "name": "Conversation and Discussion",
      "name_chinese": "蒙特梭利对话练习",
      "slug": "conversation",
      "area": "language",
      "category": "Oral Language",
      "sequence": 8,
      "age_range": "2.5-6 years",
      "quick_guide": "• Create daily opportunities for meaningful conversation\n• Welcome children's ideas and questions during circle time\n• Practice Grace and Courtesy for respectful discussion\n• Use snack time for guided conversations\n• Model clear, respectful communication patterns",
      "presentation_steps": [
        {
          "step": 1,
          "title": "Morning Greetings and Conversation",
          "description": "Greet each child individually in the morning with genuine interest. Ask open-ended questions: 'What did you do this weekend?' 'How are you feeling today?' Listen actively and respond with interest.",
          "tip": "This morning ritual sets a welcoming tone and establishes conversation as valued in your classroom."
        },
        {
          "step": 2,
          "title": "Circle Time Discussions",
          "description": "During group gatherings, invite children to share thoughts on various topics: recent activities, observations, questions. Examples: 'Who did something interesting this week?' 'What do you notice about the weather?' Guide discussion with open-ended questions.",
          "tip": "Use visual aids or props to support discussion and give children something to reference."
        },
        {
          "step": 3,
          "title": "Snack Time Conversations",
          "description": "Join children at snack table for relaxed conversation. Ask about their work, interests, or observations. Introduce new vocabulary naturally: 'This broccoli is very green. The texture is bumpy.' Share your own thoughts to model conversation.",
          "tip": "Snack time is intimate and allows for deeper individual conversations. Use this time to know each child."
        },
        {
          "step": 4,
          "title": "Teach Discussion Rules",
          "description": "Explicitly teach Grace and Courtesy lessons around listening, taking turns, and respectful disagreement. Practice: raising hand before speaking, listening when others speak, using kind words, asking clarifying questions.",
          "tip": "These social skills require direct teaching and repeated practice. Model them constantly."
        },
        {
          "step": 5,
          "title": "Respond to Questions",
          "description": "When children ask questions, respond thoughtfully rather than dismissively. Use it as a teaching moment: 'That's a great question. Let's think about...' or 'I'm not sure. Shall we find out together?'",
          "tip": "Your response to questions signals whether curiosity and discussion are valued in your classroom."
        }
      ],
      "direct_aims": [
        "Develop oral expression and communication skills",
        "Build vocabulary through authentic use",
        "Learn to listen and respond respectfully",
        "Develop confidence in speaking"
      ],
      "indirect_aims": [
        "Build social-emotional skills",
        "Foster sense of community and belonging",
        "Support emotional regulation and expression",
        "Develop critical thinking through discussion",
        "Prepare for group work and collaboration"
      ],
      "materials": [
        "Discussion prompts",
        "Conversation starters"
      ],
      "control_of_error": "Teacher observation of participation and respectfulness; peer feedback and modeling; child's ability to speak in appropriate turn-taking situations; quality of listening demonstrated",
      "prerequisites": [],
      "points_of_interest": [
        "Being truly heard and valued by adults",
        "Sharing personal experiences and ideas",
        "Discovering connections with peers",
        "Asking and exploring questions",
        "Using new vocabulary in meaningful contexts"
      ],
      "variations": [
        "Small group discussions about specific topics or interests",
        "Partner conversations between children",
        "Show-and-tell or sharing circles",
        "Problem-solving discussions about classroom issues",
        "Virtual conversations with family members or other classrooms"
      ],
      "common_challenges": [
        "Some children dominate discussion; others remain silent",
        "Difficulty transitioning from social chat to focused discussion",
        "Children interrupting or not taking turns",
        "Pressure or shyness preventing authentic participation",
        "Teacher dominating conversation rather than facilitating"
      ],
      "video_search_term": "montessori circle time sharing",
      "data_status": "needs_guide",
      "materials_needed": [
        "Props or visual aids for conversation starters (pictures, objects, books)",
        "Comfortable seating arrangements for group discussions",
        "Grace and Courtesy lesson materials",
        "Snack materials for informal conversations",
        "Chart paper for recording ideas or learning from discussions"
      ],
      "extensions": [
        "Transition to formal presentations or sharing with larger groups",
        "Recording conversations for reflection",
        "Connecting discussions to writing or drawing",
        "Introduction to debate or friendly disagreement",
        "Service projects inspired by group discussions"
      ],
      "vocabulary": [
        "Conversation",
        "Discussion",
        "Listen",
        "Respectful",
        "Turn-taking",
        "Question",
        "Share",
        "Agree",
        "Disagree"
      ],
      "parent_description": "Conversation and Discussion are central to Montessori language development. Every day, children engage in meaningful conversations with teachers and peers—during morning greetings, snack time, circle discussions, and spontaneous moments. Teachers model respectful listening and clear communication, while children learn to share ideas, ask questions, and respond to others with kindness. Grace and Courtesy lessons explicitly teach social skills like turn-taking and respectful disagreement. Through these authentic daily conversations, children develop confidence, expand vocabulary, and build the communication skills essential for academic and social success.",
      "why_it_matters": "Conversation is the most natural and powerful teacher of language. Children who engage in rich, frequent conversations with responsive adults develop larger vocabularies, stronger comprehension, and greater reading success. Discussion develops critical thinking, builds community, and supports social-emotional development. Feeling heard and valued during conversations boosts confidence and motivation. These daily interactions create a foundation for lifelong communication skills and a sense of belonging."
    },
    {
      "work_id": "la_metal_insets",
      "name": "Metal Insets",
      "name_chinese": "蒙特梭利金属嵌板",
      "slug": "metal-insets",
      "area": "language",
      "category": "Writing Preparation",
      "sequence": 1,
      "age_range": "primary_year1",
      "quick_guide": "• Ten geometric metal frames and insets for tracing and design\n• Develops pencil control and hand strength for writing preparation\n• Creates beautiful artwork while building fine motor skills\n• Progression from frame tracing to inset tracing to complex designs\n• Indirect preparation for letter formation curves and lines",
      "presentation_steps": [
        {
          "step": 1,
          "title": "Preparation",
          "description": "Place paper on felt-lined tray. Select one inset and frame.",
          "tip": "Start with square or triangle for straight lines."
        },
        {
          "step": 2,
          "title": "Frame Tracing",
          "description": "Hold frame firmly with non-dominant hand. Trace inside edge with colored pencil.",
          "tip": "Demonstrate steady, continuous motion."
        },
        {
          "step": 3,
          "title": "Inset Tracing",
          "description": "Center inset inside frame tracing. Trace around outside edge.",
          "tip": "Use different color for each layer."
        },
        {
          "step": 4,
          "title": "Filling",
          "description": "Fill shape with parallel lines from left to right.",
          "tip": "Lines should be close together and even."
        },
        {
          "step": 5,
          "title": "Design Creation",
          "description": "Overlay multiple shapes to create designs.",
          "tip": "Use different colors for visual interest."
        },
        {
          "step": 6,
          "title": "Child Practice",
          "description": "Child works independently, developing pencil control.",
          "tip": "Focus on process, not perfect product."
        }
      ],
      "direct_aims": [
        "Pencil grip",
        "Pencil control",
        "Lightness of touch",
        "Hand-eye coordination"
      ],
      "indirect_aims": [
        "Preparation for letter formation",
        "Artistic expression"
      ],
      "materials": [
        "Metal Insets (10 shapes)",
        "Colored pencils",
        "Inset paper",
        "Pencil holder"
      ],
      "control_of_error": "Lines go outside shape",
      "prerequisites": [],
      "points_of_interest": [
        "Beautiful designs emerge",
        "Visible improvement in control",
        "Calming, meditative quality"
      ],
      "variations": [
        "Two insets overlaid",
        "Filling with curves or patterns",
        "Color gradation effects"
      ],
      "common_challenges": [
        "Frame slipping",
        "Pressing too hard",
        "Rushing the filling process"
      ],
      "video_search_term": "montessori metal insets tracing frame",
      "data_status": "complete",
      "materials_needed": [
        "Metal Insets (10 shapes)",
        "Colored pencils",
        "Inset paper",
        "Pencil holder"
      ],
      "parent_description": "Your child is strengthening their hand through beautiful geometric tracing and drawing work. By carefully outlining metal frame shapes with colored pencils and creating intricate designs, they're building the fine motor control, hand strength, and pencil grip needed for fluent writing. The precise movements required teach the exact pencil strokes that form letters.",
      "why_it_matters": "The Metal Insets are the direct preparation for handwriting. This work develops not just the muscles needed for writing, but also hand-eye coordination and the ability to stay within lines—all essential skills for confident, controlled written expression."
    },
    {
      "work_id": "la_sandpaper_letters",
      "name": "Sandpaper Letters",
      "name_chinese": "蒙特梭利砂纸字母",
      "slug": "sandpaper-letters",
      "area": "language",
      "category": "Writing Preparation",
      "sequence": 2,
      "age_range": "3-5 years",
      "quick_guide": "• Tactile, sensorial introduction to letter formation and sounds\n• Use Three Period Lesson for systematic presentation\n• Vowels on blue, consonants on pink (standard Montessori convention)\n• Child traces letter while hearing the sound\n• Practice independent tracing to build muscle memory",
      "presentation_steps": [
        {
          "step": 1,
          "title": "Prepare Child Readiness",
          "description": "Before introducing sandpaper letters, ensure child has completed Practical Life activities (pouring, polishing, transferring) to strengthen fine motor control. Hand strength and pincer grip must be developing.",
          "tip": "If child has difficulty controlling pencil or tracing, delay sandpaper letters and do more preparatory activities."
        },
        {
          "step": 2,
          "title": "First Period: Introduction",
          "description": "Sit beside child. Hold a consonant letter (pink card). Say clearly: 'This is 'ssss.'' Have child repeat the sound. Guide child's finger to trace letter while saying the sound together. Use proper tracing direction (top to bottom, left to right). Repeat with 2-3 more letters.",
          "tip": "Begin with easily distinguished letters (m, s, a). Skip confusing pairs (b/d, p/q) initially. Focus on sound, not letter name."
        },
        {
          "step": 3,
          "title": "Second Period: Recognition",
          "description": "Over several days, present the same letters. Mix in a new letter. Ask child: 'Trace the 's.' or 'Find the letter that makes the 'mmm' sound.' Child traces while saying the sound. Repeat many times—second period is longer and deeper than first.",
          "tip": "Some children master a letter in one session; others need a week or more. Follow the child's pace."
        },
        {
          "step": 4,
          "title": "Third Period: Recall",
          "description": "Present letters without naming them. Ask: 'What sound does this make?' Child traces and provides the sound. Or give the sound: 'Find the letter for 'ttt.'' Child selects correct letter.",
          "tip": "Only move to third period when second period is mastered. Don't rush. Premature third period lessons create frustration."
        },
        {
          "step": 5,
          "title": "Transition to Writing",
          "description": "Once child has internalized letter formation through sandpaper tracing, introduce chalkboard or paper writing. Child traces in sand tray first, then transfers to chalkboard (which allows erasure), then to paper.",
          "tip": "Handwriting follows the progression: sandpaper (tactile) → sand tray → chalkboard (impermanent) → paper (permanent)."
        }
      ],
      "direct_aims": [
        "Learn letter shapes and sounds",
        "Develop muscle memory for letter formation",
        "Establish sound-symbol connection",
        "Prepare for writing through fine motor development"
      ],
      "indirect_aims": [
        "Build confidence in approaching literacy",
        "Develop concentration and focus",
        "Support kinesthetic learning style",
        "Prepare for phonetic reading",
        "Coordinate sensory input (visual, tactile, auditory)"
      ],
      "materials": [
        "Sandpaper Letters (lowercase)",
        "Sand tray (optional)"
      ],
      "control_of_error": "Tactile feedback from sandpaper (proper tracing direction feels right); teacher observation of correct formation; child's ability to recall sound independently; transition to writing shows mastery",
      "prerequisites": [
        "la_sound_games"
      ],
      "points_of_interest": [
        "The tactile sensation of rough sandpaper against smooth background",
        "Muscle memory developing through repeated tracing",
        "Sound-symbol connection becoming internalized",
        "The sensory appeal of beautiful colored cards",
        "Success in recognizing and naming letters"
      ],
      "variations": [
        "Capital and lowercase letters (cursive is traditional Montessori)",
        "Sandpaper numerals alongside letter introduction",
        "Themed letter introduction (animal letters, action letters)",
        "Creating personal sandpaper letter sets",
        "Multi-sensory letter tracing (sand, salt, flour)"
      ],
      "common_challenges": [
        "Child traces wrong direction; sandpaper doesn't provide enough feedback",
        "Difficulty coordinating hand position with tracing",
        "Distraction or unwillingness to sit for focused lesson",
        "Reversal of letters (b/d confusion) that's developmentally normal",
        "Over-reliance on teacher support rather than developing independence"
      ],
      "video_search_term": "montessori sandpaper letters first group",
      "data_status": "needs_guide",
      "materials_needed": [
        "Complete sandpaper letter set (40 phonograms)",
        "Blue backing for vowels (a, e, i, o, u)",
        "Pink backing for consonants and consonant blends",
        "Green backing for two-letter phonograms",
        "Comfortable seating at child height",
        "Optional: sand tray for additional sensory practice"
      ],
      "extensions": [
        "Transition to sand tray letter tracing",
        "Introduction of chalkboard writing after sandpaper mastery",
        "Beginning to write letters on paper",
        "Combining letters into words using movable alphabet",
        "Phonetic reading preparation through sound sequencing"
      ],
      "vocabulary": [
        "Letter",
        "Sound",
        "Trace",
        "Vowel",
        "Consonant",
        "Phonogram",
        "Muscle memory",
        "Formation"
      ],
      "parent_description": "Sandpaper Letters are the iconic Montessori material for writing preparation. Each letter is made of rough sandpaper mounted on a smooth colored card—vowels on blue, consonants on pink. Children trace the letter shape with their finger while hearing the letter sound, engaging vision, touch, and hearing simultaneously. This multisensory approach helps children internalize letter shapes and their corresponding sounds. Through repeated tracing, children develop the muscle memory necessary for writing. The tactile feedback of the sandpaper helps children understand when they're tracing correctly.",
      "why_it_matters": "Sandpaper Letters combine sensorial learning with phonetic instruction—classic Montessori integration of senses with academics. The tactile-kinesthetic approach appeals to young learners who learn best through touch and movement. Tracing sandpaper letters builds the fine motor control and hand strength necessary for writing while establishing sound-symbol connections essential for reading. By the time children move to writing on paper, the letter formation is already internalized, making the transition smooth and confident."
    },
    {
      "work_id": "la_sand_tray",
      "name": "Sand Tray Writing",
      "name_chinese": "蒙特梭利沙盘书写",
      "slug": "sand-tray",
      "area": "language",
      "category": "Writing Preparation",
      "sequence": 3,
      "age_range": "primary_year1",
      "quick_guide": "• Tray with sand or salt for practicing letter formation\n• Transitional writing practice before paper and pencil\n• Child traces letters in sand, can easily erase and retry\n• Low stakes practice develops confidence\n• Prepares for chalkboard and paper writing",
      "presentation_steps": [
        {
          "step": 1,
          "title": "Tray Setup",
          "description": "Present sand tray. Smooth sand surface.",
          "tip": "Thin, even sand layer."
        },
        {
          "step": 2,
          "title": "Demonstration",
          "description": "Write letter in sand using one finger.",
          "tip": "Same formation as Sandpaper Letters."
        },
        {
          "step": 3,
          "title": "Erasing",
          "description": "Gently shake tray to smooth sand. 'Ready for another.'",
          "tip": "Easy retry."
        },
        {
          "step": 4,
          "title": "Child Practice",
          "description": "Child writes letters, smooths, repeats.",
          "tip": "Low-pressure practice."
        },
        {
          "step": 5,
          "title": "Words",
          "description": "Progress to writing simple words.",
          "tip": "CVC words first."
        },
        {
          "step": 6,
          "title": "Stories",
          "description": "Advanced: write short sentences or stories.",
          "tip": "Expressive writing."
        }
      ],
      "direct_aims": [
        "Letter formation practice",
        "Muscle memory"
      ],
      "indirect_aims": [
        "Writing preparation"
      ],
      "materials": [
        "Sand tray with colored sand"
      ],
      "control_of_error": "Letter doesn't form correctly",
      "prerequisites": [
        "la_sandpaper_letters"
      ],
      "points_of_interest": [
        "Sensory experience",
        "Easy correction",
        "No erasing frustration"
      ],
      "variations": [
        "Salt tray",
        "Rice tray",
        "Finger paint tray"
      ],
      "common_challenges": [
        "Too much sand",
        "Letter formation",
        "Rushing"
      ],
      "video_search_term": "montessori sand tray writing letters",
      "data_status": "complete",
      "materials_needed": [
        "Sand tray with colored sand"
      ],
      "parent_description": "Your child is using their fingers to trace letters in sand, creating a multisensory experience that connects sight, touch, and movement. After seeing a letter shape card, they reproduce it in the sand tray using a wooden stylus or their finger. This tactile feedback helps cement letter formation before pencil is ever picked up.",
      "why_it_matters": "Sand tray work engages multiple senses simultaneously, which strengthens memory and muscle memory for letter shapes. The erasable medium removes pressure and encourages repeated practice—perfect for developing the motor patterns that lead to automatic letter writing."
    },
    {
      "work_id": "la_chalkboard_writing",
      "name": "Chalkboard Writing",
      "name_chinese": "蒙特梭利黑板书写",
      "slug": "chalkboard-writing",
      "area": "language",
      "category": "Writing Preparation",
      "sequence": 4,
      "age_range": "3.5-5.5 years",
      "quick_guide": "• Low-pressure writing on erasable chalkboard surface\n• Child can experiment freely without fear of mistakes\n• Progress from lines → letters → words\n• Chalkboard work bridges sandpaper letters to paper\n• Allow impermanence to encourage creative risk-taking",
      "presentation_steps": [
        {
          "step": 1,
          "title": "Introduce the Chalkboard",
          "description": "Show child the chalkboard, chalk or chalk pencil, and eraser/cloth. Demonstrate how to hold and use materials properly. Hold chalkboard still with one hand; hold chalk with pincer grip in dominant hand.",
          "tip": "Use a chalk pencil (not loose chalk stick) as it requires proper pencil grip, easing transition to paper writing."
        },
        {
          "step": 2,
          "title": "Practice Lines and Strokes",
          "description": "Begin with basic strokes: vertical lines, horizontal lines, wavy lines. Draw slowly, exaggerating movements. Invite child to trace your lines with their finger, then draw their own. Make this playful and pressure-free.",
          "tip": "Building fine motor control through lines prepares for letter formation. Spend time here; don't rush to letters."
        },
        {
          "step": 3,
          "title": "Write Individual Letters",
          "description": "Once lines are comfortable, introduce writing sandpaper letter shapes on the chalkboard. Start with familiar letters child has traced extensively. Write the letter slowly while child watches, then guide child's hand or let them trace it.",
          "tip": "The impermanence of chalk allows freedom. If the letter doesn't look perfect, simply erase and try again—no failure."
        },
        {
          "step": 4,
          "title": "Progress to Simple Words",
          "description": "When letters are established, write CVC words (cat, dog, sit). Point to each letter and make the sound. Write the word, read it, have child trace and read it. Keep words familiar and meaningful.",
          "tip": "Reading what you've written is as important as writing it. This reinforces the purpose of writing (communication)."
        },
        {
          "step": 5,
          "title": "Encourage Creative Expression",
          "description": "As skill develops, invite child to write their own letters, words, or simple sentences. Celebrate attempts without correction focused on neatness. Erase together and try again if desired.",
          "tip": "The beauty of chalkboard work is that mistakes don't matter. Emphasize the joy of creating and experimenting."
        }
      ],
      "direct_aims": [
        "Practice letter formation with low pressure",
        "Develop fine motor control and pencil grip",
        "Connect sounds to written symbols",
        "Build confidence in writing"
      ],
      "indirect_aims": [
        "Support risk-taking and creative expression",
        "Develop hand-eye coordination",
        "Build understanding of writing's purpose (communication)",
        "Prepare transition from sandpaper letters to pencil and paper",
        "Foster confidence and independence"
      ],
      "materials": [
        "Chalkboard",
        "Chalk",
        "Eraser"
      ],
      "control_of_error": "Visual feedback from chalk marks; teacher observation of letter formation and grip; successful erasure and re-attempts; child's readiness to progress to paper writing",
      "prerequisites": [
        "la_sand_tray"
      ],
      "points_of_interest": [
        "The ease of erasing and trying again",
        "Creating marks with chalk and eraser tools",
        "Seeing one's own written words appear",
        "The sensory experience of chalk on board",
        "Playful experimentation without pressure"
      ],
      "variations": [
        "Chalkboard with guide lines to support letter formation",
        "Chalkboard with base line and extended lines for letter height",
        "Larger format boards for children needing more space",
        "Wet/dry erase boards as alternative",
        "Sand tray as precursor to chalkboard work"
      ],
      "common_challenges": [
        "Child pressing too hard, breaking chalk",
        "Inconsistent letter size or formation",
        "Reluctance to erase work they're proud of",
        "Distraction or play taking over focused practice",
        "Transition anxiety to 'permanent' paper writing"
      ],
      "video_search_term": "montessori chalkboard writing",
      "data_status": "needs_guide",
      "materials_needed": [
        "Individual chalkboard (greenboard or blackboard)",
        "Chalk pencils (preferred) or chalk sticks",
        "Cloth, sponge, or eraser for cleaning",
        "Chalkboard with or without lines/guides",
        "Writing sample cards (optional, for reference)"
      ],
      "extensions": [
        "Transition to writing on lined paper with pencil",
        "Introduction of cursive writing on chalkboard",
        "Writing words from movable alphabet dictation",
        "Creating simple sentences or labels",
        "Illustrated words and stories on chalkboard"
      ],
      "vocabulary": [
        "Chalkboard",
        "Chalk",
        "Eraser",
        "Write",
        "Letter",
        "Word",
        "Line",
        "Erase"
      ],
      "parent_description": "Chalkboard Writing bridges the gap between sandpaper letters and paper writing. Children practice writing on erasable chalkboards, where mistakes can easily disappear. This low-pressure environment encourages experimentation and builds confidence. Without the permanence of pencil on paper, children feel free to attempt letters, try new words, and risk making mistakes. Through playful chalkboard practice, children develop muscle memory, pencil grip, and letter formation—all essential for successful paper writing. The emphasis remains on the joy of creating and expressing ideas, not on perfection.",
      "why_it_matters": "The transition from sandpaper letters to paper writing is significant. Chalkboard work provides a crucial intermediate step that maintains the tactile, low-pressure environment while building real writing skills. The impermanence of chalk writing helps children approach writing as playful exploration rather than high-stakes performance. Research shows that children who experience playful, low-pressure writing activities develop stronger writing skills and greater willingness to take risks in writing than children pushed to 'correct' writing too early."
    },
    {
      "work_id": "la_moveable_alphabet",
      "name": "Moveable Alphabet",
      "name_chinese": "蒙特梭利活动字母",
      "slug": "moveable-alphabet",
      "area": "language",
      "category": "Writing Preparation",
      "sequence": 5,
      "age_range": "primary_year1",
      "quick_guide": "• Box containing lowercase letters (consonants and vowels color-coded)\n• Allows children to build words before hand is ready for writing\n• Bridges phonemic awareness and reading through encoding\n• Child sounds out word and selects corresponding letters\n• Liberates expression from fine motor limitations",
      "presentation_steps": [
        {
          "step": 1,
          "title": "Introduction",
          "description": "Open Moveable Alphabet box. Identify letter sections.",
          "tip": "Review sounds of known letters first."
        },
        {
          "step": 2,
          "title": "CVC Word Building",
          "description": "'Let's build the word cat. What sound do you hear first?'",
          "tip": "Start with phonetic three-letter words."
        },
        {
          "step": 3,
          "title": "Sound Segmentation",
          "description": "Child identifies /c/. Find 'c' letter. Place on mat.",
          "tip": "Exaggerate segmentation initially."
        },
        {
          "step": 4,
          "title": "Complete Word",
          "description": "Continue with middle sound /a/, then ending sound /t/.",
          "tip": "Touch each letter while blending."
        },
        {
          "step": 5,
          "title": "Reading Back",
          "description": "Child blends sounds to read completed word.",
          "tip": "Point to each letter while sounding."
        },
        {
          "step": 6,
          "title": "Independent Building",
          "description": "Child builds words from objects or pictures.",
          "tip": "Focus on encoding, not spelling correctness."
        }
      ],
      "direct_aims": [
        "Encoding words",
        "Spelling",
        "Word building"
      ],
      "indirect_aims": [
        "Reading preparation",
        "Phonetic analysis"
      ],
      "materials": [
        "Large Moveable Alphabet (blue consonants, red vowels)"
      ],
      "control_of_error": "Word doesn't match intended word",
      "prerequisites": [
        "la_sandpaper_letters"
      ],
      "points_of_interest": [
        "Freedom to express before writing",
        "Word creation power",
        "Connection between sounds and symbols"
      ],
      "variations": [
        "Sentence building",
        "Story writing",
        "Word family building"
      ],
      "common_challenges": [
        "Letter reversals",
        "Missing middle sounds",
        "Frustration with irregular spellings"
      ],
      "video_search_term": "montessori moveable alphabet introduction",
      "data_status": "complete",
      "materials_needed": [
        "Large Moveable Alphabet (blue consonants, red vowels)"
      ],
      "parent_description": "Your child is building words by selecting individual letter tiles and arranging them on a mat. With vowels in blue and consonants in red, they sound out a word they hear and choose letters to represent each sound. This ingenious material allows children to express their thoughts in writing before their hand is ready for pencil work. Watch as your child 'writes' sentences and stories—they're becoming an author!",
      "why_it_matters": "The Moveable Alphabet bridges the gap between knowing letter sounds and actual writing, allowing children to compose words, sentences, and even stories. This early success with encoding builds confidence and a genuine love of writing—often before traditional handwriting instruction."
    },
    {
      "work_id": "la_handwriting_paper",
      "name": "Handwriting on Paper",
      "name_chinese": "蒙特梭利书写练习",
      "slug": "handwriting-paper",
      "area": "language",
      "category": "Writing Preparation",
      "sequence": 6,
      "age_range": "4-6 years",
      "quick_guide": "• Final step in writing progression after sandpaper and chalkboard\n• Use proper Montessori writing paper (lines with specific spacing)\n• Progress from letter formation to word writing\n• Maintain focus on legibility and hand strength, not speed\n• Support individual developmental pace",
      "presentation_steps": [
        {
          "step": 1,
          "title": "Assess Readiness",
          "description": "Before introducing paper writing, ensure child has mastered sandpaper letters, chalkboard writing, and demonstrates proper pencil grip, good hand strength, and focus. Child should be confident and willing.",
          "tip": "Pushing paper writing before readiness creates frustration and poor writing habits. Wait for mastery at previous steps."
        },
        {
          "step": 2,
          "title": "Introduce Montessori Writing Paper",
          "description": "Show child the special writing paper with baseline and extended line for letter height. Point out the space for writing. Demonstrate proper pencil grip again. Start with writing a single letter, then build to words.",
          "tip": "Montessori paper has specific spacing (typically 1 inch) that accommodates developing handwriting and prevents cramping."
        },
        {
          "step": 3,
          "title": "Begin with Single Letters",
          "description": "Child writes single letters on paper, referring to their knowledge from sandpaper letters. Start with vowels or frequently used consonants. Keep this casual and encouraging, not perfectionist.",
          "tip": "If child forms letter incorrectly, don't erase or make them rewrite. Simply note what they wrote and move forward."
        },
        {
          "step": 4,
          "title": "Progress to Word Writing",
          "description": "As letters become comfortable, introduce simple CVC words: cat, dog, sit, run. Child can copy words or write from dictation. Focus on legibility and phonetic accuracy, not perfection.",
          "tip": "Accept child's inventive spelling if phonetically logical. Correct spelling comes later; now focus on the motor act of writing."
        },
        {
          "step": 5,
          "title": "Create Opportunities for Writing",
          "description": "Provide real purposes for writing: labels for classroom items, lists, simple stories, birthday wishes for classmates. Make writing meaningful, not just practice.",
          "tip": "Purposeful writing is more motivating than worksheets. When children see their writing communicates real messages, they become invested."
        }
      ],
      "direct_aims": [
        "Develop legible handwriting",
        "Strengthen fine motor control",
        "Write words and simple sentences",
        "Connect sounds to written letters"
      ],
      "indirect_aims": [
        "Build confidence in written expression",
        "Develop understanding of writing's purpose",
        "Create foundation for fluent writing",
        "Support phonetic awareness and spelling",
        "Foster lifelong writing habits"
      ],
      "materials": [
        "Lined handwriting paper",
        "Pencils",
        "Letter formation cards"
      ],
      "control_of_error": "Visual comparison of child's writing to model or previous work; teacher feedback on legibility; readability of message; child's confidence and willingness to write",
      "prerequisites": [
        "la_chalkboard_writing"
      ],
      "points_of_interest": [
        "Seeing words they've written for a real purpose",
        "Building skill and legibility over time",
        "Transitioning to 'real' writing with pencil and paper",
        "Creating permanent records of their thoughts",
        "Pride in accomplishment and visible progress"
      ],
      "variations": [
        "Story paper (half blank for drawing, half lined for writing)",
        "Different paper sizes and line spacings as needed",
        "Cursive writing paper for schools teaching cursive",
        "Pencil grips or ergonomic supports as needed",
        "Personal writing journals for daily expression"
      ],
      "common_challenges": [
        "Child wants to erase and redo constantly",
        "Letter reversals or inconsistent formation",
        "Pressure too heavy or too light",
        "Resistance to moving from beloved chalkboard",
        "Slow development of automatic letter recall"
      ],
      "video_search_term": "montessori handwriting letters",
      "data_status": "needs_guide",
      "materials_needed": [
        "Montessori-style writing paper (baseline with extended lines)",
        "Pencils (triangle-grip, ergonomic if needed)",
        "Erasers (though erasing encouraged minimally)",
        "Writing samples or reference cards",
        "Dictation cards or word lists for copying",
        "Journals or blank books for creative writing"
      ],
      "extensions": [
        "Introduction of cursive handwriting",
        "Creative writing and storytelling on paper",
        "Journal writing with drawings",
        "Letter writing to family members",
        "Copying favorite poems or passages"
      ],
      "vocabulary": [
        "Write",
        "Paper",
        "Pencil",
        "Letter",
        "Word",
        "Sentence",
        "Handwriting",
        "Legible"
      ],
      "parent_description": "Handwriting on Paper is the culmination of the writing preparation sequence. After mastering sandpaper letters and chalkboard writing, children are ready to write with pencil on paper. Using special Montessori writing paper with guidelines to support letter formation, children write letters, then simple words and sentences. The focus is on legibility and purposeful communication rather than speed or perfection. Children practice writing in meaningful contexts—labeling items in the classroom, creating stories, writing messages to friends. Through this real-world writing, children develop both the mechanics of handwriting and the motivation to communicate through the written word.",
      "why_it_matters": "Proper handwriting instruction built on careful preparation prevents lifelong writing difficulties. Children who experience the Montessori writing progression develop confident, legible handwriting without tension or frustration. The progression from tactile (sandpaper) to temporary (chalkboard) to permanent (paper) respects children's developmental needs and cognitive ability to handle permanence. Most importantly, this sequence connects writing to meaningful communication, ensuring children view writing as a tool for expression rather than a chore."
    },
    {
      "work_id": "la_creative_writing",
      "name": "Creative Writing",
      "name_chinese": "蒙特梭利创意写作",
      "slug": "creative-writing",
      "area": "language",
      "category": "Writing Preparation",
      "sequence": 7,
      "age_range": "3.5-6 years",
      "quick_guide": "• Encourage original stories and self-expression in writing\n• Support inventive spelling and grammatical growth\n• Provide varied writing genres and purposes\n• Create classroom culture celebrating writing attempts\n• Connect writing to children's interests and experiences",
      "presentation_steps": [
        {
          "step": 1,
          "title": "Model Writing Enthusiasm",
          "description": "Write in front of children regularly. Tell them what you're writing and why: 'I'm writing a note to thank Maria for sharing snack with Diego.' Show them your writing process—thinking, writing, rereading. Model the joy and purpose of writing.",
          "tip": "Children who see adults writing purposefully become writers themselves. Model writing daily in visible ways."
        },
        {
          "step": 2,
          "title": "Establish Writing Opportunities",
          "description": "Create real purposes for writing throughout the day: thank you notes, classroom announcements, birthday messages, lists, recipes, stories. Make writing part of classroom culture, not isolated skill practice.",
          "tip": "Authentic writing (writing with real purpose) is more motivating than worksheets. Give genuine writing work."
        },
        {
          "step": 3,
          "title": "Encourage Inventive Spelling",
          "description": "When children want to write before they've mastered conventional spelling, celebrate their phonetic attempts. Say: 'I can read that! You wrote 'cat' as 'kat.' That makes sense because both letters sound right.' Value the effort, not the correctness.",
          "tip": "Pressuring conventional spelling before readiness creates writing anxiety. Encourage risk-taking and expression first."
        },
        {
          "step": 4,
          "title": "Provide Writing Prompts and Ideas",
          "description": "Offer story starters, picture prompts, or open-ended questions: 'What would happen if...?' 'Write about your favorite memory.' 'Tell a story about an adventure.' Vary genres: stories, poems, lists, letters, descriptions.",
          "tip": "Some children need prompts; others have endless ideas. Offer options but honor child's choice of topic."
        },
        {
          "step": 5,
          "title": "Celebrate and Share Writing",
          "description": "Create a classroom culture where writing is celebrated. Display stories, create class books, have author shares where children read their writing aloud. Respond with genuine interest and specific feedback: 'I loved the part when...'",
          "tip": "Public celebration of writing builds confidence and creates positive associations with the writing process."
        }
      ],
      "direct_aims": [
        "Express thoughts and ideas through writing",
        "Develop as an author",
        "Practice phonetic spelling and conventional writing",
        "Gain confidence in writing abilities"
      ],
      "indirect_aims": [
        "Foster creativity and imagination",
        "Build confidence and self-expression",
        "Develop understanding of writing's power",
        "Support emotional expression and processing",
        "Prepare for academic writing in later grades"
      ],
      "materials": [
        "Writing paper",
        "Journals",
        "Writing prompts"
      ],
      "control_of_error": "Child's engagement and willingness to write; variety and quality of writing attempts; positive self-perception as writer; movement toward conventional spelling over time",
      "prerequisites": [
        "la_handwriting_paper"
      ],
      "points_of_interest": [
        "The freedom to express original ideas",
        "Creating stories and worlds of their imagination",
        "Seeing their ideas transformed into written words",
        "Sharing stories with classmates and teachers",
        "Rereading their own creations"
      ],
      "variations": [
        "Illustrated stories (drawing as significant as writing)",
        "Collaborative class stories (each child contributes a page)",
        "Poetry and verse writing",
        "Friendly letter writing to classroom friends",
        "Recipe writing from classroom cooking activities"
      ],
      "common_challenges": [
        "Children's perfectionism preventing writing attempts",
        "Over-focus on spelling rather than expression",
        "Limited ideas or repetitive story patterns",
        "Difficulty transitioning from drawing to writing",
        "Shyness about sharing writing publicly"
      ],
      "video_search_term": "montessori writing labeling",
      "data_status": "needs_guide",
      "materials_needed": [
        "Blank paper or writing journals",
        "Pencils, markers, crayons for illustrating",
        "Picture prompts or story starter cards",
        "Classroom book-binding materials",
        "Display space for sharing work",
        "Writing reference charts (phonogram reminders, high-frequency words)"
      ],
      "extensions": [
        "Transition to chapter books and longer stories",
        "Revision and editing of favorite pieces",
        "Study of published authors' styles",
        "Introduction to different genres and forms",
        "Writing for authentic audiences beyond classroom"
      ],
      "vocabulary": [
        "Write",
        "Story",
        "Author",
        "Idea",
        "Sentence",
        "Describe",
        "Imagine",
        "Create"
      ],
      "parent_description": "Creative Writing is about encouraging children to express themselves through the written word. Beginning in early childhood, children are invited to write their own stories, messages, and ideas. Teachers celebrate invention and expression while gently supporting skill development. As children write, they naturally encounter questions: How do I spell this? Can I use this word? This authentic need drives learning more effectively than isolated spelling or grammar lessons. The Montessori approach trusts that children will develop conventional writing skills through purposeful, meaningful writing experiences.",
      "why_it_matters": "Children who write regularly, creatively, and with support develop strong writing skills and lifelong writing habits. Creative writing supports emotional development, allowing children to process experiences and express feelings. It develops imagination, creativity, and problem-solving skills. Children who view themselves as capable writers in early childhood maintain that positive identity and confidence throughout their academic careers. Perhaps most importantly, creative writing is joyful—when writing is about expressing ideas rather than following rules, children engage with enthusiasm and develop a love of the written word."
    },
    {
      "work_id": "la_object_boxes",
      "name": "Object Boxes (Pink/Blue/Green)",
      "name_chinese": "蒙特梭利物品盒",
      "slug": "object-boxes",
      "area": "language",
      "category": "Reading",
      "sequence": 1,
      "age_range": "primary_year1",
      "quick_guide": "• Collections of miniature objects organized by phonetic pattern\n• Multi-sensory reading practice connecting objects to words\n• Supports all reading series (Pink, Blue, Green) with concrete materials\n• Child manipulates objects while reading, engaging kinesthetic learning\n• Bridge between abstract decoding and meaningful reading",
      "presentation_steps": [
        {
          "step": 1,
          "title": "Box Selection",
          "description": "Select box matching child's reading level (Pink, Blue, or Green).",
          "tip": "Match to current phonetic series."
        },
        {
          "step": 2,
          "title": "Object Exploration",
          "description": "Remove and name all objects in box.",
          "tip": "Verify vocabulary knowledge."
        },
        {
          "step": 3,
          "title": "Word Card Reading",
          "description": "Child reads word card using phonetic decoding.",
          "tip": "No guessing from objects."
        },
        {
          "step": 4,
          "title": "Matching",
          "description": "Place word card beside corresponding object.",
          "tip": "Object confirms accurate reading."
        },
        {
          "step": 5,
          "title": "Self-Check",
          "description": "Child re-reads all cards to verify matches.",
          "tip": "Independent verification builds confidence."
        },
        {
          "step": 6,
          "title": "Recording",
          "description": "Child may copy words into reading journal.",
          "tip": "Integrates writing with reading."
        }
      ],
      "direct_aims": [
        "Reading first words",
        "Decoding"
      ],
      "indirect_aims": [
        "Reading confidence"
      ],
      "materials": [
        "Object boxes with miniatures and labels"
      ],
      "control_of_error": "Labels don't match objects",
      "prerequisites": [
        "la_moveable_alphabet"
      ],
      "points_of_interest": [
        "Tangible reading success",
        "Object manipulation engagement",
        "Growing word collection"
      ],
      "variations": [
        "Memory matching",
        "Category sorting",
        "Story creation with objects"
      ],
      "common_challenges": [
        "Guessing from objects",
        "Object vocabulary gaps",
        "Careless matching"
      ],
      "video_search_term": "montessori pink object box",
      "data_status": "complete",
      "materials_needed": [
        "Object boxes with miniatures and labels"
      ],
      "parent_description": "Your child is matching real objects to word cards, learning to recognize words through multiple exposures. These beautifully presented boxes contain miniature objects paired with phonetic word cards. By finding the matching word for each object, your child connects concrete items to their written symbols—building reading skills through hands-on exploration.",
      "why_it_matters": "The Object Boxes build reading fluency through pattern recognition and repeated exposure to phonetic words. This multi-sensory approach helps children internalize word recognition and solidifies the connection between meaning, sound, and symbol."
    },
    {
      "work_id": "la_pink_series",
      "name": "Pink Series (CVC Words)",
      "name_chinese": "蒙特梭利粉色系列",
      "slug": "pink-series",
      "area": "language",
      "category": "Reading",
      "sequence": 2,
      "age_range": "primary_year1",
      "quick_guide": "• Collection of phonetic CVC (consonant-vowel-consonant) words for beginning reading\n• Includes objects, pictures, and word cards for matching activities\n• Short vowel sounds only: cat, pen, pig, box, cup\n• Three-stage progression: object-word matching, picture-word matching, word lists\n• Foundation for phonetic reading before sight words",
      "presentation_steps": [
        {
          "step": 1,
          "title": "Object Box Introduction",
          "description": "Place 3-5 small objects on mat. Name each object.",
          "tip": "Verify child knows object names."
        },
        {
          "step": 2,
          "title": "Word Cards",
          "description": "Lay out corresponding word cards below objects.",
          "tip": "Cards face down initially for discovery."
        },
        {
          "step": 3,
          "title": "Reading First Word",
          "description": "Turn over card. Child sounds out: '/c/-/a/-/t/, cat!'",
          "tip": "Touch each letter while sounding."
        },
        {
          "step": 4,
          "title": "Matching",
          "description": "Child places word card below matching object.",
          "tip": "Encourage self-checking by re-reading."
        },
        {
          "step": 5,
          "title": "Picture Cards",
          "description": "Replace objects with picture cards. Child matches words to pictures.",
          "tip": "More abstract than objects."
        },
        {
          "step": 6,
          "title": "Word Lists",
          "description": "Child reads word lists without picture support.",
          "tip": "Pure decoding practice."
        }
      ],
      "direct_aims": [
        "Reading CVC words fluently",
        "Building reading confidence"
      ],
      "indirect_aims": [
        "Decoding skills",
        "Comprehension"
      ],
      "materials": [
        "Pink Series materials: picture cards, word cards, phrases, sentences, booklets"
      ],
      "control_of_error": "Words don't match pictures",
      "prerequisites": [
        "la_object_boxes"
      ],
      "points_of_interest": [
        "Success with first words",
        "Growing word recognition",
        "Independence in reading"
      ],
      "variations": [
        "Word building with Moveable Alphabet",
        "Sentence strips",
        "Word hunts"
      ],
      "common_challenges": [
        "Guessing instead of sounding out",
        "Vowel confusion",
        "Speed over accuracy"
      ],
      "video_search_term": "montessori pink series picture word matching",
      "data_status": "complete",
      "materials_needed": [
        "Pink Series materials: picture cards, word cards, phrases, sentences, booklets"
      ],
      "parent_description": "Your child is discovering the joy of reading simple three-letter words using the consonant-vowel-consonant pattern—words like cat, dog, and sit. These foundational words follow phonetic rules perfectly, allowing your child to apply their letter-sound knowledge immediately. By reading, tracing, and spelling CVC words, they're experiencing their first real reading success.",
      "why_it_matters": "The Pink Series builds early reading confidence by providing completely decodable words. This success with phonetic patterns gives children the foundation and motivation to become readers, and the predictable structure helps them apply learned letter sounds."
    },
    {
      "work_id": "la_blue_series",
      "name": "Blue Series (Blends)",
      "name_chinese": "蒙特梭利蓝色系列",
      "slug": "blue-series",
      "area": "language",
      "category": "Reading",
      "sequence": 3,
      "age_range": "primary_year1",
      "quick_guide": "• Words containing consonant blends (st, bl, fr) and digraphs (sh, ch, th)\n• Builds on Pink Series decoding skills with increased complexity\n• Includes objects, pictures, and word cards matching Pink Series format\n• Introduces concept of two letters making one sound (digraphs)\n• Prepares for Green Series long vowel patterns",
      "presentation_steps": [
        {
          "step": 1,
          "title": "Blend Introduction",
          "description": "Present objects: stamp, frog, clock. Emphasize beginning blend.",
          "tip": "Child should be fluent with CVC before starting."
        },
        {
          "step": 2,
          "title": "Hearing Blends",
          "description": "'Listen: /st/-amp. Two sounds together at the start.'",
          "tip": "Exaggerate the blend."
        },
        {
          "step": 3,
          "title": "Word Building",
          "description": "Build blend words with Moveable Alphabet first.",
          "tip": "Encoding before decoding."
        },
        {
          "step": 4,
          "title": "Object-Word Matching",
          "description": "Match word cards to blend objects.",
          "tip": "Follow Pink Series format."
        },
        {
          "step": 5,
          "title": "Digraph Introduction",
          "description": "Introduce sh, ch, th as 'two letters, one sound.'",
          "tip": "Key cards show digraphs with keywords."
        },
        {
          "step": 6,
          "title": "Mixed Practice",
          "description": "Child reads Blue Series word lists independently.",
          "tip": "Include both blends and digraphs."
        }
      ],
      "direct_aims": [
        "Reading words with blends",
        "Decoding longer words"
      ],
      "indirect_aims": [
        "Reading fluency",
        "Phonemic awareness"
      ],
      "materials": [
        "Blue Series materials: picture cards, word cards, phrases, sentences, booklets"
      ],
      "control_of_error": "Words don't decode correctly",
      "prerequisites": [
        "la_pink_series"
      ],
      "points_of_interest": [
        "Discovery of blends",
        "Digraph 'aha' moments",
        "Growing reading fluency"
      ],
      "variations": [
        "Blend sorting",
        "Digraph hunts",
        "Blend vs. digraph discrimination"
      ],
      "common_challenges": [
        "Separating blend sounds",
        "Confusing similar blends",
        "Digraph recognition"
      ],
      "video_search_term": "montessori blue series initial blends",
      "data_status": "complete",
      "materials_needed": [
        "Blue Series materials: picture cards, word cards, phrases, sentences, booklets"
      ],
      "parent_description": "Your child is now tackling consonant blends—those tricky beginning and ending sounds like 'bl' and 'st' where two consonants work together. The Blue Series introduces longer, slightly more complex words while maintaining the short vowel sounds they've mastered. Your child delights in discovering words like 'flag,' 'stop,' and 'brush.'",
      "why_it_matters": "Consonant blends are the next natural step in phonetic reading. Understanding that letter combinations can work together to make new sounds expands your child's decoding strategies and pushes reading into more sophisticated words."
    },
    {
      "work_id": "la_phonogram_intro",
      "name": "Phonogram Introduction",
      "name_chinese": "蒙特梭利音素介绍",
      "slug": "phonogram-intro",
      "area": "language",
      "category": "Reading",
      "sequence": 4,
      "age_range": "4-6 years",
      "quick_guide": "• Two-letter combinations that make single distinct sounds\n• Introduce using Three Period Lesson systematically\n• Focus on common phonograms (ch, sh, th, ng, ea, etc.)\n• Use picture boxes showing only that phonogram\n• Connect phonogram recognition to word building",
      "presentation_steps": [
        {
          "step": 1,
          "title": "Prepare Background Knowledge",
          "description": "Ensure child has mastered individual sandpaper letter sounds before introducing phonograms. Review the sounds that will combine into the phonogram. Have child thoroughly know letters before combining them.",
          "tip": "Reviewing all sandpaper phonograms the day before introduction boosts confidence and serves as assessment."
        },
        {
          "step": 2,
          "title": "First Period: Introduction",
          "description": "Show child the phonogram (e.g., 'ch' on a card or picture box lid). Say: 'When we see these two letters together, they make one sound: 'chhhh.' We don't say 'c,' 'h,' we say 'chhhh.' Can you say 'chhhh'?' Have child repeat clearly.",
          "tip": "Use picture boxes that contain only words with that phonogram to avoid confusion from varied letter combinations."
        },
        {
          "step": 3,
          "title": "Second Period: Recognition",
          "description": "Over several days, present the same phonograms. Show a phonogram and ask: 'What sound do these letters make?' or 'Trace these letters and say the sound.' Mix in review of previously learned phonograms. Build familiarity through repetition.",
          "tip": "Second period is significantly longer than first. Spend days here, allowing the sound-symbol connection to solidify."
        },
        {
          "step": 4,
          "title": "Third Period: Recall",
          "description": "Present phonogram without cueing. Ask: 'What sound does this make?' Child responds with the phonogram sound. Progress to finding words containing that phonogram in picture boxes.",
          "tip": "Only move to third period when child reliably identifies the phonogram in second period."
        },
        {
          "step": 5,
          "title": "Connect to Word Building",
          "description": "Once phonograms are familiar, use them in the movable alphabet to build words. Show how knowing the phonogram helps decode: 'You know 'ch' makes 'chhhh,' so this word is 'chap.'' Build bridge from phonogram recognition to word reading.",
          "tip": "This is powerful! Children realize they can now read more complex words by recognizing phonogram patterns."
        }
      ],
      "direct_aims": [
        "Learn common phonograms and their sounds",
        "Recognize letter combinations that make single sounds",
        "Develop ability to decode multi-letter word parts",
        "Build foundation for word reading"
      ],
      "indirect_aims": [
        "Recognize patterns in language",
        "Support phonetic awareness",
        "Build confidence in reading",
        "Prepare for more complex text",
        "Support spelling through pattern recognition"
      ],
      "materials": [
        "Sandpaper Phonograms",
        "Phonogram cards"
      ],
      "control_of_error": "Adult confirmation of correct phonogram sound; child's ability to identify phonograms in second and third periods; successful decoding of words containing phonograms",
      "prerequisites": [
        "la_blue_series"
      ],
      "points_of_interest": [
        "Discovery that two letters work together to make one sound",
        "Finding the same phonogram in different words",
        "Ability to sound out longer words using phonograms",
        "Recognition of patterns in English",
        "Joy of reading more words through phonogram knowledge"
      ],
      "variations": [
        "Phonograms organized by visual similarity or sound families",
        "Phonogram boxes showing multiple words with same phonogram",
        "Sorting activities finding phonograms in mixed word sets",
        "Creating personal phonogram picture dictionaries",
        "Combining single-letter and two-letter phonograms in words"
      ],
      "common_challenges": [
        "Child confuses phonograms with individual letters",
        "Difficulty isolating the phonogram sound from surrounding sounds",
        "Phonograms that have multiple sounds (e.g., 'ch' in 'school')",
        "Over-application of phonogram rule to exceptions",
        "Memorization without understanding"
      ],
      "video_search_term": "montessori phonograms double letters",
      "data_status": "needs_guide",
      "materials_needed": [
        "Phonogram cards (common phonograms: ch, sh, th, ng, ea, ee, oa, etc.)",
        "Picture boxes with words containing target phonograms",
        "Movable alphabet",
        "Phonogram reference chart",
        "Word lists organized by phonogram",
        "Books containing phonograms already learned"
      ],
      "extensions": [
        "More complex phonograms (igh, ould, etc.)",
        "Using phonograms to spell and write words",
        "Understanding when phonograms make different sounds",
        "Reading books featuring target phonograms",
        "Phonogram patterns in larger words and text"
      ],
      "vocabulary": [
        "Phonogram",
        "Sound",
        "Letter combination",
        "Decode",
        "Pattern",
        "Word building"
      ],
      "parent_description": "Phonogram Introduction teaches children that certain pairs of letters consistently make a single sound. After mastering individual letter sounds, children learn that 'ch' always makes the 'chhhh' sound, 'th' makes the 'thhhh' sound, and so on. Using Three Period Lessons and picture boxes containing only words with that phonogram, children systematically build knowledge of these sound patterns. Understanding phonograms is transformative—suddenly, children can read many more words. A child who knows individual letters plus phonograms can decode far more complex text than one who relies on single letters alone.",
      "why_it_matters": "English spelling is complex but has underlying patterns. Phonograms represent one of those patterns—consistent letter combinations that produce predictable sounds. Teaching phonograms explicitly bridges the gap between simple CVC words and more complex text. Research shows that children who understand letter patterns and phonogram combinations become more fluent, confident readers. Phonogram knowledge also supports spelling, as children learn to recognize and reproduce these patterns. Most importantly, phonograms help children understand that reading is decipherable through pattern recognition—an essential insight for reading growth."
    },
    {
      "work_id": "la_green_series",
      "name": "Green Series (Phonograms)",
      "name_chinese": "蒙特梭利绿色系列",
      "slug": "green-series",
      "area": "language",
      "category": "Reading",
      "sequence": 5,
      "age_range": "primary_year2",
      "quick_guide": "• Words containing long vowel patterns and vowel teams (oa, ea, ai, ee)\n• Most complex of the phonetic reading series\n• Introduces silent-e pattern and vowel combinations\n• Child discovers rules: 'When two vowels go walking, the first one does the talking'\n• Bridge to fluent reading of multi-syllable words",
      "presentation_steps": [
        {
          "step": 1,
          "title": "Silent-E Introduction",
          "description": "Show 'mat' and 'mate'. Compare sounds.",
          "tip": "'Magic e' makes the vowel say its name."
        },
        {
          "step": 2,
          "title": "Pattern Discovery",
          "description": "Present multiple silent-e pairs: can/cane, hop/hope.",
          "tip": "Child discovers the rule."
        },
        {
          "step": 3,
          "title": "Vowel Teams",
          "description": "Introduce 'oa' as in boat. Two vowels, one sound.",
          "tip": "Use keyword cards with pictures."
        },
        {
          "step": 4,
          "title": "Object Matching",
          "description": "Match Green Series word cards to objects/pictures.",
          "tip": "Follow established series format."
        },
        {
          "step": 5,
          "title": "Rule Articulation",
          "description": "Child states rules for patterns encountered.",
          "tip": "Verbal articulation reinforces learning."
        },
        {
          "step": 6,
          "title": "Independent Reading",
          "description": "Child reads Green Series word lists and books.",
          "tip": "Transition to authentic reading materials."
        }
      ],
      "direct_aims": [
        "Reading words with phonograms",
        "Phonogram recognition in context"
      ],
      "indirect_aims": [
        "Reading fluency",
        "Spelling patterns"
      ],
      "materials": [
        "Green Series materials organized by phonogram"
      ],
      "control_of_error": "Words don't decode correctly",
      "prerequisites": [
        "la_phonogram_intro"
      ],
      "points_of_interest": [
        "Magic e discovery",
        "Vowel team patterns",
        "Reading fluency development"
      ],
      "variations": [
        "Pattern sorting",
        "Word family building",
        "Spelling rules practice"
      ],
      "common_challenges": [
        "Overapplying rules",
        "Vowel team confusion",
        "Irregular word frustration"
      ],
      "video_search_term": "montessori green series matching",
      "data_status": "complete",
      "materials_needed": [
        "Green Series materials organized by phonogram"
      ],
      "parent_description": "Your child is diving into the trickier aspects of English—digraphs like 'ch' and 'sh,' silent letters, and vowel teams that don't follow the usual rules. The Green Series introduces phonograms: special letter combinations that sound different from what you'd expect. It's here that your child learns why English is wonderfully quirky!",
      "why_it_matters": "Phonograms and digraphs unlock a huge range of vocabulary beyond purely phonetic words. Understanding these special sound combinations allows children to read the majority of English words, preparing them for fluent, independent reading."
    },
    {
      "work_id": "la_puzzle_words",
      "name": "Puzzle Words (Sight Words)",
      "name_chinese": "蒙特梭利高频词",
      "slug": "puzzle-words",
      "area": "language",
      "category": "Reading",
      "sequence": 6,
      "age_range": "primary_year1",
      "quick_guide": "• High-frequency words that don't follow phonetic patterns\n• Words like: the, was, said, have, of, to\n• Must be memorized as 'sight words' or 'puzzle words'\n• Introduced after phonetic reading foundation\n• Essential for fluent reading",
      "presentation_steps": [
        {
          "step": 1,
          "title": "Introduction",
          "description": "'Some words are puzzles. They don't sound out normally.'",
          "tip": "Explain special category."
        },
        {
          "step": 2,
          "title": "First Word",
          "description": "Present 'the'. 'This word is THE.'",
          "tip": "Most common first."
        },
        {
          "step": 3,
          "title": "Memory Work",
          "description": "Look at word, say word, trace letters.",
          "tip": "Multi-sensory approach."
        },
        {
          "step": 4,
          "title": "Practice",
          "description": "Flash card practice with learned words.",
          "tip": "Quick recognition goal."
        },
        {
          "step": 5,
          "title": "In Context",
          "description": "Find puzzle words in sentences and books.",
          "tip": "Contextual reading."
        },
        {
          "step": 6,
          "title": "Writing",
          "description": "Practice writing puzzle words from memory.",
          "tip": "Spelling practice."
        }
      ],
      "direct_aims": [
        "Automatic recognition of common words",
        "Reading fluency"
      ],
      "indirect_aims": [
        "Comprehension",
        "Reading speed"
      ],
      "materials": [
        "Puzzle word cards",
        "Puzzle word booklets"
      ],
      "control_of_error": "Word not recognized",
      "prerequisites": [
        "la_pink_series"
      ],
      "points_of_interest": [
        "Necessity for reading",
        "Memory challenge",
        "Reading fluency"
      ],
      "variations": [
        "Puzzle word games",
        "Sentence building",
        "Word wall"
      ],
      "common_challenges": [
        "Memory load",
        "Sounding out habit",
        "Similar word confusion"
      ],
      "video_search_term": "montessori puzzle words first",
      "data_status": "complete",
      "materials_needed": [
        "Puzzle word cards",
        "Puzzle word booklets"
      ],
      "parent_description": "Your child is learning the 'puzzle words'—those tricky high-frequency words that can't be sounded out phonetically, like 'the,' 'said,' and 'where.' These words are so important in reading that they must be memorized. Your child learns these through playful matching games and repeated exposure, building reading speed and fluency.",
      "why_it_matters": "Sight words are essential for reading fluency. Since these common words appear constantly in texts, learning to recognize them instantly without sounding them out dramatically increases reading speed and comprehension."
    },
    {
      "work_id": "la_reading_analysis",
      "name": "Reading Analysis",
      "name_chinese": "蒙特梭利阅读分析",
      "slug": "reading-analysis",
      "area": "language",
      "category": "Reading",
      "sequence": 7,
      "age_range": "5-8 years",
      "quick_guide": "• Analyze sentence structure and function of words within sentences\n• Color-code parts of speech for visual organization\n• Begin with simple sentences, progress to complex\n• Use Analysis Charts to isolate nouns, verbs, articles, etc.\n• Support comprehension through grammatical understanding",
      "presentation_steps": [
        {
          "step": 1,
          "title": "Establish Prerequisites",
          "description": "Before Reading Analysis, child must have worked with Function of Words exercises and have strong reading ability. Child should understand sentence structure and basic parts of speech concepts.",
          "tip": "Reading Analysis builds on earlier grammar work. Don't introduce until foundational concepts are secure."
        },
        {
          "step": 2,
          "title": "Introduce Simple Sentences",
          "description": "Begin with very simple sentences: 'The cat sits.' Point out the subject (cat), verb (sits), and article (the). Discuss: 'Who is doing something?' (subject) 'What are they doing?' (verb) Build understanding of basic structure.",
          "tip": "Concrete, relatable sentences work best. Use sentences about classroom activities or familiar things."
        },
        {
          "step": 3,
          "title": "Present Analysis Charts",
          "description": "Show colorful Analysis Charts where parts of speech are marked with specific colors and shapes (noun = black triangle, verb = red circle, etc.). Use charts to diagram sentences visually. Child sees how words relate to each other.",
          "tip": "The visual representation is powerful. Color and shape make abstract grammar concepts concrete and memorable."
        },
        {
          "step": 4,
          "title": "Analyze Sample Sentences",
          "description": "Work through sentences together, identifying and marking each word according to function. 'The cat sits on the mat.' → 'The' (article), 'cat' (noun), 'sits' (verb), 'on' (preposition), 'the' (article), 'mat' (noun).",
          "tip": "Make this interactive. Have child point to and classify words while you guide."
        },
        {
          "step": 5,
          "title": "Progress to Independent Analysis",
          "description": "As understanding develops, child analyzes sentences independently, using color pencils to mark parts of speech or moving cut-apart sentence pieces to show relationships. Celebrate accurate analysis.",
          "tip": "Independent work builds mastery. Provide scaffold (color key, function labels) as needed."
        }
      ],
      "direct_aims": [
        "Understand relationship of words within sentences",
        "Recognize parts of speech and their functions",
        "Support reading comprehension through grammatical analysis",
        "Develop ability to parse complex sentences"
      ],
      "indirect_aims": [
        "Support grammar understanding",
        "Develop logical thinking about language structure",
        "Build metalinguistic awareness",
        "Support writing and expression",
        "Prepare for advanced literacy work"
      ],
      "materials": [
        "Reading analysis materials",
        "Phonogram charts"
      ],
      "control_of_error": "Correct use of Analysis Charts and color coding; teacher verification of function assignments; child's ability to explain why words function as they do",
      "prerequisites": [
        "la_green_series"
      ],
      "points_of_interest": [
        "Discovering the logic of sentence structure",
        "Understanding how different words have different functions",
        "Visual organization through color and shape",
        "Applying rules to decode meaning",
        "Ability to understand complex sentences through analysis"
      ],
      "variations": [
        "Different levels of sentence complexity",
        "Focusing on specific parts of speech in depth",
        "Creating original sentences and analyzing them",
        "Comparing different sentence structures",
        "Analyzing sentences from class reading materials"
      ],
      "common_challenges": [
        "Child focuses on definitions rather than function",
        "Difficulty understanding why function matters",
        "Confusion with overlapping parts of speech functions",
        "Resistance to 'rules' of grammar",
        "Moving too quickly before understanding is secure"
      ],
      "video_search_term": "montessori reading analysis phonograms",
      "data_status": "needs_guide",
      "materials_needed": [
        "Analysis Charts with color-coded parts of speech",
        "Simple sentence cards",
        "Color pencils or markers",
        "Cut-apart sentence pieces for kinesthetic sorting",
        "Function of words reference materials",
        "Books for finding and analyzing sentences"
      ],
      "extensions": [
        "Advanced analysis of complex sentence structures",
        "Understanding dependent and independent clauses",
        "Recognizing different sentence types",
        "Using analysis to improve own writing",
        "Exploring how word order affects meaning"
      ],
      "vocabulary": [
        "Analysis",
        "Function",
        "Part of speech",
        "Noun",
        "Verb",
        "Article",
        "Adjective",
        "Preposition",
        "Sentence structure"
      ],
      "parent_description": "Reading Analysis teaches children to look beneath the surface of sentences to understand how they're constructed. Using colorful Analysis Charts where parts of speech are marked with specific colors and shapes, children discover the function of each word in a sentence. They learn that 'the cat' contains an article and a noun; that 'sits' is the action verb; that 'on the mat' shows where the action happens. This grammatical understanding deepens reading comprehension and supports writing. Children see that sentences follow logical patterns, making even complex text decipherable.",
      "why_it_matters": "Grammar isn't about following arbitrary rules—it's about understanding how language conveys meaning. Reading Analysis gives children tools to decode not just words but the relationships between words. This metalinguistic awareness—thinking about language itself—supports reading comprehension, writing quality, and language learning generally. Children who understand sentence structure can tackle more complex texts with confidence. The Montessori approach to grammar is particularly effective because it makes the abstract structure of language concrete and visual."
    },
    {
      "work_id": "la_reading_classification",
      "name": "Reading Classification",
      "name_chinese": "蒙特梭利阅读分类",
      "slug": "reading-classification",
      "area": "language",
      "category": "Reading",
      "sequence": 8,
      "age_range": "4.5-8 years",
      "quick_guide": "• Organize words into meaningful categories\n• Sort words by function, meaning, or linguistic features\n• Use classification cards to group related words\n• Build vocabulary understanding through relationships\n• Support reading and spelling through pattern recognition",
      "presentation_steps": [
        {
          "step": 1,
          "title": "Introduce Classification Concept",
          "description": "Show child a set of picture cards with different items (animal, food, clothing, etc.). Discuss: 'What do these things have in common?' Help child recognize categories. Introduce idea that words can be organized similarly.",
          "tip": "Begin with very obvious categories (animals, food, vehicles). Build comfort with classification before moving to abstract word categories."
        },
        {
          "step": 2,
          "title": "Present Word Classification Cards",
          "description": "Use cards with individual words. Show categories: animals, actions, describing words, etc. Read each word clearly. Ask child: 'Is this an animal? An action? Something we eat?' Sort words into categories together.",
          "tip": "Physical sorting (moving cards into groups) helps kinesthetic learners understand relationships between words."
        },
        {
          "step": 3,
          "title": "Explore Multiple Classification Schemes",
          "description": "Show that the same words can be classified different ways. 'Apple' could go in: fruits, foods, things that are red, things that grow on trees. Discuss how context changes classification. Expand thinking flexibly.",
          "tip": "This teaches children that categories aren't rigid. Language is flexible and meanings depend on context."
        },
        {
          "step": 4,
          "title": "Connect to Reading and Spelling",
          "description": "Help child see that classification supports reading: knowing that 'cat,' 'dog,' 'bird' are all animals helps predict meaning. For spelling: words in the same category often follow similar patterns.",
          "tip": "Make the connection explicit. 'These are all animal words, so if you're reading about pets, you might see...' "
        },
        {
          "step": 5,
          "title": "Encourage Independent Classification",
          "description": "Provide word sets and ask child to classify them independently or propose their own classification scheme. Accept thoughtful, logical categories even if different from adult's.",
          "tip": "Child's unique classifications demonstrate understanding and creative thinking. Celebrate non-obvious but logical groupings."
        }
      ],
      "direct_aims": [
        "Classify words by function, meaning, or feature",
        "Recognize relationships between words",
        "Build vocabulary through pattern recognition",
        "Support reading and spelling through categorization"
      ],
      "indirect_aims": [
        "Develop logical thinking and organization",
        "Build understanding of language structure",
        "Support flexible thinking",
        "Prepare for advanced grammar and vocabulary work",
        "Strengthen memory through associations"
      ],
      "materials": [
        "Classification reading cards"
      ],
      "control_of_error": "Logical consistency of categories; teacher verification of appropriate groupings; child's ability to explain reasoning; connections to actual text patterns",
      "prerequisites": [
        "la_green_series",
        "la_classified_cards"
      ],
      "points_of_interest": [
        "Discovering relationships between words",
        "Organizing language into patterns",
        "Multiple ways of categorizing the same words",
        "Building vocabulary through associations",
        "The logic of language patterns"
      ],
      "variations": [
        "Classifying by parts of speech",
        "Grouping by meaning or association",
        "Sorting by phonetic patterns or spelling rules",
        "Categorizing words by number of syllables",
        "Discovering words that fit multiple categories"
      ],
      "common_challenges": [
        "Child's categories too obvious or too broad",
        "Difficulty justifying classification choices",
        "Confusion between related categories",
        "Over-reliance on teacher's categorization",
        "Seeing classification as rigid rather than flexible"
      ],
      "video_search_term": "montessori reading classification",
      "data_status": "needs_guide",
      "materials_needed": [
        "Classification cards with individual words",
        "Category label cards",
        "Word sorting trays or containers",
        "Lists of words organized by category",
        "Control cards showing one classification system",
        "Books and reading materials for finding classified words"
      ],
      "extensions": [
        "Creating personal word categories and collections",
        "Using classifications to build sentences",
        "Understanding synonyms through classification",
        "Exploring hierarchies (animal → mammal → dog)",
        "Applying classification to writing (choosing strong verbs from verb category)"
      ],
      "vocabulary": [
        "Classify",
        "Category",
        "Group",
        "Organize",
        "Relationship",
        "Pattern",
        "Sort"
      ],
      "parent_description": "Reading Classification organizes words into meaningful groups. Children sort words by category: animals, actions, describing words, or many other possibilities. This work helps children see relationships between words and recognize patterns in language. For example, understanding that 'cat,' 'dog,' and 'bird' are all animals helps children predict meaning and remember vocabulary. Classification supports both reading and spelling, as children notice that words in the same category often follow similar patterns. This organized approach to vocabulary builds a stronger, more interconnected understanding of language.",
      "why_it_matters": "Words aren't learned in isolation; they're learned as part of networks and categories. Classification work makes these networks visible and organized. Research on vocabulary acquisition shows that organizing words by meaning, function, or pattern supports learning and retention far better than memorization. Classification supports reading comprehension (knowing word categories helps predict meaning from context) and spelling (recognizing phonetic or structural patterns). Perhaps most importantly, it teaches children to think about language analytically—an essential skill for advanced literacy."
    },
    {
      "work_id": "la_command_cards",
      "name": "Command Cards (Action Reading)",
      "name_chinese": "蒙特梭利命令卡",
      "slug": "command-cards",
      "area": "language",
      "category": "Reading",
      "sequence": 9,
      "age_range": "3.5-6 years",
      "quick_guide": "• Child reads a word or short sentence and performs the action\n• Combines literacy with physical movement and comprehension\n• Start with single action words (sit, hop, jog)\n• Progress to simple sentences (hop three times)\n• Build understanding through doing, not just reading",
      "presentation_steps": [
        {
          "step": 1,
          "title": "Create Command Cards",
          "description": "Prepare simple cards with single action words: sit, stand, hop, jog, clap, jump, spin, wiggle, stomp, march, skip, dance. Later, expand to phrases and simple sentences.",
          "tip": "Begin with high-frequency action verbs that are easy to physically demonstrate. Use clear, large print."
        },
        {
          "step": 2,
          "title": "Model the Activity",
          "description": "Demonstrate for child: pick up a card, read the word aloud (with or without support), then perform the action with enthusiasm. Model a few examples, then invite child to try.",
          "tip": "Exaggerate the action and show enjoyment. Make it playful and inviting, not like a test."
        },
        {
          "step": 3,
          "title": "Child Reads and Acts Independently",
          "description": "Child picks a card, reads the command, and performs the action. Initially, child may need support reading; gradually withdraw support. Celebrate accurate reading and enthusiastic action.",
          "tip": "The physical action serves as control of error: if the child can do the action correctly, they understood the word."
        },
        {
          "step": 4,
          "title": "Progress to Phrases and Sentences",
          "description": "As child becomes comfortable with single words, introduce short sentences: 'Hop three times.' 'Spin around.' 'Clap your hands.' Later: 'Walk to the window and back.' 'Tiptoe to the door.' Build complexity gradually.",
          "tip": "Sentences should remain simple and achievable. The focus is on reading comprehension, not challenge."
        },
        {
          "step": 5,
          "title": "Extend to Real Recipes and Instructions",
          "description": "Connect command cards to real cooking or craft recipes children must follow: 'Mix the ingredients.' 'Pour into the bowl.' 'Bake at 350 degrees.' Real purposeful reading extends learning.",
          "tip": "Following actual recipes or instructions is authentic reading comprehension. Child sees reading has real function."
        }
      ],
      "direct_aims": [
        "Develop reading comprehension",
        "Understand that reading has meaning and purpose",
        "Read and follow written instructions",
        "Build vocabulary through physical association"
      ],
      "indirect_aims": [
        "Integrate movement with literacy",
        "Build confidence in reading",
        "Develop listening and following directions",
        "Support kinesthetic learning",
        "Foster joy in reading"
      ],
      "materials": [
        "Command cards at various levels"
      ],
      "control_of_error": "Child's successful execution of the command; ability to read the word or sentence; appropriateness of interpretation; child's engagement and enthusiasm",
      "prerequisites": [
        "la_pink_series"
      ],
      "points_of_interest": [
        "The joy of interpreting reading into action",
        "Immediate feedback through successful action",
        "Movement breaking up sitting and reading time",
        "Pride in completing commands correctly",
        "Understanding that reading is about meaning, not just decoding"
      ],
      "variations": [
        "Command cards with simple pictures and words",
        "Silly commands using nonsense words (once phonetically decodable)",
        "Commands requiring multiple steps",
        "Partner commands ('Tell your friend to hop')",
        "Recipes or craft instructions at appropriate level"
      ],
      "common_challenges": [
        "Child acts before reading carefully",
        "Difficulty interpreting abstract commands",
        "Safety concerns with some actions",
        "Loss of focus as activity feels like play",
        "Child trying to read too quickly"
      ],
      "video_search_term": "montessori command cards simple",
      "data_status": "needs_guide",
      "materials_needed": [
        "Command cards with action verbs",
        "Sentence strips with simple instructions",
        "Cards with directions for small movements or exercises",
        "Recipe cards with simple instructions to follow",
        "Craft instruction cards",
        "Open space for safe movement"
      ],
      "extensions": [
        "Transition to longer, more complex instructions",
        "Creating original command cards",
        "Following written instructions for activities",
        "Reading and executing cooking or craft recipes",
        "Writing own commands for classmates to follow"
      ],
      "vocabulary": [
        "Command",
        "Action",
        "Verb",
        "Instruction",
        "Follow",
        "Execute",
        "Direction"
      ],
      "parent_description": "Command Cards make reading active and joyful. Children read a word or short sentence card and then perform the action it describes: sit, hop, clap, spin. The physical action serves as both motivation and comprehension check—if the child can do the action, they understood the reading. This work combines literacy with movement and is particularly engaging for kinesthetic learners. As children become fluent with single-word commands, they progress to short sentences and eventually to following written instructions for recipes or crafts. Command Cards teach that reading is about understanding meaning and taking action, not just decoding words.",
      "why_it_matters": "Command Cards bridge the gap between decoding and comprehension. Many children can call out words without understanding meaning; Command Cards require true comprehension. The immediate physical feedback (doing the action) confirms understanding. The integration of movement with reading activates multiple pathways in the brain, supporting memory and engagement. Most importantly, Command Cards demonstrate that reading has purpose—you read to understand and do something with that understanding. This realization transforms reading from a skill exercise to a meaningful tool."
    },
    {
      "work_id": "la_interpretive_reading",
      "name": "Interpretive Reading",
      "name_chinese": "蒙特梭利表达性阅读",
      "slug": "interpretive-reading",
      "area": "language",
      "category": "Reading",
      "sequence": 10,
      "age_range": "4-8 years",
      "quick_guide": "• Read for full comprehension and ability to interpret meaning\n• Understand author's intent and emotional content\n• Act out selections from stories or books\n• Draw or create responses to reading\n• Develop critical thinking about text",
      "presentation_steps": [
        {
          "step": 1,
          "title": "Select Meaningful Stories",
          "description": "Choose stories with clear themes, emotional resonance, and action children can interpret. Picture books, folktales, simple chapter books work well. Ensure the story has substance beyond the surface words.",
          "tip": "Stories that children can relate to their own experiences support deeper comprehension and interpretation."
        },
        {
          "step": 2,
          "title": "Read Aloud with Expression",
          "description": "Read the story with natural expression and emotion. Pause for predictions: 'What will happen next?' Let children anticipate. This engages them actively in comprehension, not passively listening.",
          "tip": "Your reading model matters. Read with genuine feeling, varying pace and tone. Show that stories have emotional life."
        },
        {
          "step": 3,
          "title": "Discuss Meaning and Feeling",
          "description": "After reading, discuss: 'What was happening? How did the character feel? Why did they do that? What would you do?' Focus on meaning and emotion, not factual recall alone.",
          "tip": "Open-ended questions encourage thinking. 'Why do you think...?' invites interpretation, not just right answer."
        },
        {
          "step": 4,
          "title": "Act Out or Dramatize",
          "description": "Have children act out scenes or the whole story. This kinesthetic interpretation deepens comprehension. Children must understand action, motivation, and emotion to portray them.",
          "tip": "No scripts or perfection needed. Simple, spontaneous dramatization helps children process meaning."
        },
        {
          "step": 5,
          "title": "Create Artistic Responses",
          "description": "Children draw, paint, or create responses to stories. Ask: 'Show me your favorite part.' 'Draw how the character felt.' 'Create what you think will happen next.' Art is another way to show understanding.",
          "tip": "Visual responses honor different ways of demonstrating comprehension. Some children express understanding more easily through art."
        }
      ],
      "direct_aims": [
        "Develop reading comprehension at deeper levels",
        "Understand author's intent and message",
        "Develop critical thinking about text",
        "Interpret and respond to literature"
      ],
      "indirect_aims": [
        "Foster love of reading and literature",
        "Build emotional intelligence",
        "Support creative expression",
        "Develop empathy and perspective-taking",
        "Connect reading to real life and emotions"
      ],
      "materials": [
        "Poetry",
        "Short stories",
        "Drama scripts"
      ],
      "control_of_error": "Child's ability to discuss meaning and emotion from text; quality of dramatization showing understanding; artistic responses reflecting comprehension; child's engagement and emotional connection",
      "prerequisites": [
        "la_green_series"
      ],
      "points_of_interest": [
        "Discovering deeper meaning in stories",
        "Connecting stories to own experiences and emotions",
        "The power of stories to move and change us",
        "Multiple ways to interpret and respond to text",
        "Becoming part of the story through dramatization"
      ],
      "variations": [
        "Puppet shows dramatizing favorite stories",
        "Written responses to reading (older elementary)",
        "Creating new endings to familiar stories",
        "Comparing different versions of same story",
        "Reading stories from different cultures"
      ],
      "common_challenges": [
        "Children focus on factual details rather than deeper meaning",
        "Shyness or reluctance to dramatize or express interpretation",
        "Difficulty understanding abstract or metaphorical language",
        "Over-reliance on teacher interpretation",
        "Losing interest in 'deeper' analysis; wanting only surface story"
      ],
      "video_search_term": "montessori reading expression",
      "data_status": "needs_guide",
      "materials_needed": [
        "Picture books and early chapter books with meaning",
        "Stories with emotional depth and relatable themes",
        "Props or costumes for dramatization",
        "Art materials (paint, colored pencils, paper)",
        "Space for acting and movement",
        "Books for independent follow-up reading"
      ],
      "extensions": [
        "Reading longer, more complex stories",
        "Literary analysis and discussion groups",
        "Creating original stories and performing them",
        "Connecting stories to real-life issues and themes",
        "Research following up on topics from stories"
      ],
      "vocabulary": [
        "Interpret",
        "Comprehend",
        "Meaning",
        "Author's intent",
        "Theme",
        "Character",
        "Emotion",
        "Dramatize"
      ],
      "parent_description": "Interpretive Reading is reading for meaning, not just decoding. After learning to read words and follow simple instructions, children begin to read for deeper understanding: What is the author trying to communicate? How do I feel about what I read? What does it mean? Children discuss stories, act them out, draw responses, and create their own interpretations. The focus shifts from 'Can you read this word?' to 'What does this story mean?' This is reading for real—reading for pleasure, meaning, and connection. Interpretive reading develops critical thinking and builds a lifelong love of literature.",
      "why_it_matters": "Reading with only surface comprehension is incomplete literacy. True reading means understanding and interpreting meaning. Interpretive reading develops the higher-order thinking skills essential for academic and lifelong success. Acting out stories and discussing meaning develops empathy—understanding others' perspectives and emotions. When children see reading as a path to deeper understanding of the world and human experience, they become motivated readers. The emotional connection to stories, fostered through interpretation and dramatization, creates lifelong readers who read for pleasure and growth."
    },
    {
      "work_id": "la_silent_reading",
      "name": "Silent Reading",
      "name_chinese": "蒙特梭利默读",
      "slug": "silent-reading",
      "area": "language",
      "category": "Reading",
      "sequence": 11,
      "age_range": "3-8+ years",
      "quick_guide": "• Independent, quiet reading time for pleasure and practice\n• Child chooses books at their level of interest and ability\n• Teacher observes reading habits and provides new book suggestions\n• Create peaceful, beautiful space for reading\n• Balance teacher direction with child choice and autonomy",
      "presentation_steps": [
        {
          "step": 1,
          "title": "Create Reading Environment",
          "description": "Establish a beautiful, peaceful reading space with comfortable seating: cushions, beanbags, low shelves with inviting book displays. Ensure adequate lighting. Make reading space welcoming and inviting.",
          "tip": "The physical space signals that reading is valued and pleasurable. Comfort and beauty support engagement."
        },
        {
          "step": 2,
          "title": "Provide Book Choices",
          "description": "Offer diverse books at varying difficulty levels. Include picture books, early readers, books related to classroom study, fiction and nonfiction. Rotate books regularly to maintain freshness and interest.",
          "tip": "Choice is essential. Children more likely to read when they select books themselves. Provide guidance without limiting choice."
        },
        {
          "step": 3,
          "title": "Establish Reading Time",
          "description": "Set aside regular daily time for silent reading. Create expectation that everyone reads quietly. Start with shorter periods (5-10 minutes) and gradually extend. Model reading yourself alongside children.",
          "tip": "Teacher reading alongside children is powerful modeling. Children see reading is valued and normal."
        },
        {
          "step": 4,
          "title": "Allow Browsing and Rereading",
          "description": "Not every book must be read cover-to-cover. Accept that children browse, flip through pictures, reread favorites. Sometimes 'reading' is looking at pictures in a book they love.",
          "tip": "Browsing and rereading build comfort with books. Don't pressure completion of every book."
        },
        {
          "step": 5,
          "title": "Observe and Respond",
          "description": "Quietly observe children's choices and reading habits. Note interests and offer new books matching those interests: 'You loved that dinosaur book. I think you'll enjoy this one too.' Support with gentle suggestions, not demands.",
          "tip": "Your observations personalize reading experiences. Knowing each child's interests allows you to match them with books."
        }
      ],
      "direct_aims": [
        "Build independent reading fluency",
        "Foster love of reading and literature",
        "Read for pleasure and information",
        "Develop sustained concentration"
      ],
      "indirect_aims": [
        "Build confidence as reader",
        "Expand vocabulary and knowledge",
        "Support emotional and social development through literature",
        "Create lifelong reading habits",
        "Build joy and intrinsic motivation for reading"
      ],
      "materials": [
        "Leveled books",
        "Book corner"
      ],
      "control_of_error": "Child's engagement with books; growth in reading ability and confidence; frequency of voluntary book selection; breadth of book choices; length of reading attention span",
      "prerequisites": [
        "la_green_series"
      ],
      "points_of_interest": [
        "Freedom to choose books of personal interest",
        "Peaceful, uninterrupted time for reading",
        "Discovering new stories and ideas",
        "Comfort and pleasure of reading",
        "Pride in independent reading ability"
      ],
      "variations": [
        "Partner reading or buddy reading",
        "Reading in pairs with different ability levels",
        "Themed reading times (mystery books, poetry, animal stories)",
        "Family reading time at home",
        "Book discussions in small groups",
        "Reading with recording for audiobook experience"
      ],
      "common_challenges": [
        "Child selects books too difficult or too easy",
        "Reluctance to choose new books; rereading same book repeatedly",
        "Difficulty sitting quietly for reading time",
        "Some children finishing books quickly, others slowly",
        "Balance between supporting choice and providing guidance"
      ],
      "video_search_term": "montessori silent reading",
      "data_status": "needs_guide",
      "materials_needed": [
        "Diverse collection of books at varying levels",
        "Beautiful shelving or book displays",
        "Comfortable seating (cushions, beanbags, chairs)",
        "Quiet, peaceful space",
        "Optional: book journals or reading logs",
        "Tools for tracking and responding to reading (optional)"
      ],
      "extensions": [
        "Written responses to books or reading journals",
        "Book recommendations to classmates",
        "Author studies of favorite authors",
        "Reading challenges (diverse genres, authors, time goals)",
        "Starting a classroom library or book exchange"
      ],
      "vocabulary": [
        "Silent reading",
        "Independent reading",
        "Choose",
        "Interest",
        "Fluency",
        "Comprehension",
        "Pleasure reading"
      ],
      "parent_description": "Silent Reading is independent, quiet reading time where children choose books they want to read and read for pleasure. In a peaceful, beautiful classroom space, children read books they select, discovering stories they love. Teachers observe, gently guide book selection, and model reading alongside children. The focus is on building a love of reading, not on testing comprehension or meeting standards. Children discover that reading is pleasurable and meaningful. Over time, silent reading builds fluency, expands vocabulary, and creates the foundation for lifelong learning. Even early readers and children with fewer words can enjoy books through pictures and teacher reading aloud.",
      "why_it_matters": "Silent reading time is essential for developing fluent readers and lifelong love of reading. Research clearly shows that children who engage in frequent, pleasurable reading develop stronger reading skills, larger vocabularies, and better comprehension than children who read less. Voluntary reading—reading of one's own choice—is particularly powerful for motivation and sustained engagement. Perhaps most importantly, silent reading creates an association between reading and pleasure, building the intrinsic motivation that sustains readers throughout life. Children who love reading succeed academically across all subjects."
    },
    {
      "work_id": "la_noun_intro",
      "name": "Introduction to the Noun",
      "name_chinese": "蒙特梭利名词介绍",
      "slug": "noun-intro",
      "area": "language",
      "category": "Grammar",
      "sequence": 1,
      "age_range": "primary_year2",
      "quick_guide": "• First grammar introduction using concrete objects and experiences\n• Large black triangle symbol represents the noun (solid, stable things)\n• Child discovers that nouns are naming words for people, places, and things\n• Farm or environment used for concrete noun identification\n• Prepares for other parts of speech introduction",
      "presentation_steps": [
        {
          "step": 1,
          "title": "Naming Game",
          "description": "Look around room. 'Everything has a name: chair, window, book.'",
          "tip": "Touch each item while naming."
        },
        {
          "step": 2,
          "title": "Writing Labels",
          "description": "Write label for one object. Child places label on object.",
          "tip": "'We're giving things their names.'"
        },
        {
          "step": 3,
          "title": "Noun Definition",
          "description": "'Words that name things are called nouns.' Introduce term.",
          "tip": "Use exact grammatical language."
        },
        {
          "step": 4,
          "title": "Symbol Introduction",
          "description": "Present black triangle. 'This is the noun symbol.'",
          "tip": "Explain: pyramid is old and solid like naming words."
        },
        {
          "step": 5,
          "title": "Farm Work",
          "description": "Using Montessori farm, identify and label nouns.",
          "tip": "Extend to people, places."
        },
        {
          "step": 6,
          "title": "Symbol Placement",
          "description": "Child places triangle symbol above nouns in sentences.",
          "tip": "Physical manipulation reinforces concept."
        }
      ],
      "direct_aims": [
        "Understanding nouns name things",
        "Noun identification"
      ],
      "indirect_aims": [
        "Grammar awareness",
        "Vocabulary"
      ],
      "materials": [
        "Noun lesson materials",
        "Black triangle symbol",
        "Objects and labels"
      ],
      "control_of_error": "Incorrect classification",
      "prerequisites": [
        "la_pink_series"
      ],
      "points_of_interest": [
        "Everything has a name",
        "Symbol meaning",
        "Classification power"
      ],
      "variations": [
        "Noun hunts",
        "Sorting people/places/things",
        "Noun detective games"
      ],
      "common_challenges": [
        "Confusing with other parts of speech",
        "Abstract nouns difficulty",
        "Symbol placement errors"
      ],
      "video_search_term": "montessori noun introduction",
      "data_status": "complete",
      "materials_needed": [
        "Noun lesson materials",
        "Black triangle symbol",
        "Objects and labels"
      ],
      "parent_description": "Your child is beginning to understand grammar through a beautiful black pyramid symbol representing nouns. A noun is a 'naming word'—the solid, concrete name of a person, place, or thing. Your child explores the classroom finding nouns (desk, book, teacher) and discovers that nouns are the foundation of language. The concrete symbol and hands-on exploration make this concept tangible.",
      "why_it_matters": "Understanding nouns is the foundation for all grammar learning. By recognizing nouns, children begin to see how language is structured, preparing them for deeper comprehension of sentence construction and meaningful writing."
    },
    {
      "work_id": "la_article_intro",
      "name": "Introduction to the Article",
      "name_chinese": "蒙特梭利冠词介绍",
      "slug": "article-intro",
      "area": "language",
      "category": "Grammar",
      "sequence": 2,
      "age_range": "primary_year2",
      "quick_guide": "• Introduction to articles: a, an, the (determiners)\n• Small light blue triangle symbol for article\n• Shows that articles accompany nouns\n• First grammar function word introduction\n• Prepares for complete sentence analysis",
      "presentation_steps": [
        {
          "step": 1,
          "title": "Noun Review",
          "description": "Review nouns and black triangle symbol.",
          "tip": "Build on prior knowledge."
        },
        {
          "step": 2,
          "title": "Article Introduction",
          "description": "'Some little words go with nouns: A cat. THE book.'",
          "tip": "Point out in sentences."
        },
        {
          "step": 3,
          "title": "Symbol",
          "description": "Introduce small light blue triangle.",
          "tip": "Small because it's a small word."
        },
        {
          "step": 4,
          "title": "Placement",
          "description": "Place article symbols above articles in sentences.",
          "tip": "Before noun symbol."
        },
        {
          "step": 5,
          "title": "A vs. An",
          "description": "Discover rule: 'a' before consonant, 'an' before vowel.",
          "tip": "Pattern discovery."
        },
        {
          "step": 6,
          "title": "Practice",
          "description": "Identify articles in sentences and books.",
          "tip": "Reinforce recognition."
        }
      ],
      "direct_aims": [
        "Understanding a, an, the",
        "Article usage"
      ],
      "indirect_aims": [
        "Grammar awareness"
      ],
      "materials": [
        "Article materials",
        "Small light blue triangle"
      ],
      "control_of_error": "Incorrect article use",
      "prerequisites": [
        "la_noun_intro"
      ],
      "points_of_interest": [
        "Noun companion",
        "Symbol pairing",
        "Rule discovery"
      ],
      "variations": [
        "Article hunt",
        "Sentence building",
        "A/an sorting"
      ],
      "common_challenges": [
        "A/an confusion",
        "Symbol placement",
        "Function understanding"
      ],
      "video_search_term": "montessori article introduction",
      "data_status": "complete",
      "materials_needed": [
        "Article materials",
        "Small light blue triangle"
      ],
      "parent_description": "Your child is discovering articles—the small words 'a,' 'an,' and 'the' that introduce nouns. Using concrete materials and a light blue triangle symbol, they explore how articles work with nouns to give us more specific information. This subtle but powerful work helps children understand how words work together to create meaning.",
      "why_it_matters": "Articles are essential for precise communication. Understanding how they function helps children appreciate how small words carry significant meaning, and prepares them for more complex grammar study."
    },
    {
      "work_id": "la_adjective_intro",
      "name": "Introduction to the Adjective",
      "name_chinese": "蒙特梭利形容词介绍",
      "slug": "adjective-intro",
      "area": "language",
      "category": "Grammar",
      "sequence": 3,
      "age_range": "primary_year2",
      "quick_guide": "• Introduction to adjectives as describing words\n• Medium blue triangle symbol for adjective\n• Adjectives describe nouns: big cat, red ball\n• Detective game: 'Which one?' leads to adjective need\n• Develops descriptive language and vocabulary",
      "presentation_steps": [
        {
          "step": 1,
          "title": "Setup",
          "description": "Place two identical objects on table, one red, one blue.",
          "tip": "Need to distinguish."
        },
        {
          "step": 2,
          "title": "Problem",
          "description": "'Bring me the ball.' 'Which one?'",
          "tip": "Create need for adjective."
        },
        {
          "step": 3,
          "title": "Solution",
          "description": "'Bring me the RED ball.' Adjective solves problem.",
          "tip": "Describing word needed."
        },
        {
          "step": 4,
          "title": "Definition",
          "description": "'Describing words are called adjectives.'",
          "tip": "Term introduction."
        },
        {
          "step": 5,
          "title": "Symbol",
          "description": "Introduce medium blue triangle symbol.",
          "tip": "Blue for descriptive."
        },
        {
          "step": 6,
          "title": "Practice",
          "description": "Add adjectives to sentences. Find in books.",
          "tip": "Application."
        }
      ],
      "direct_aims": [
        "Understanding adjectives describe nouns",
        "Adjective identification"
      ],
      "indirect_aims": [
        "Descriptive language"
      ],
      "materials": [
        "Adjective materials",
        "Medium dark blue triangle",
        "Detective adjective game"
      ],
      "control_of_error": "Adjective doesn't describe noun",
      "prerequisites": [
        "la_article_intro"
      ],
      "points_of_interest": [
        "Problem-solving introduction",
        "Descriptive power",
        "Vocabulary expansion"
      ],
      "variations": [
        "Adjective games",
        "Description challenges",
        "Five senses adjectives"
      ],
      "common_challenges": [
        "Adjective/adverb confusion",
        "Limited vocabulary",
        "Overuse"
      ],
      "video_search_term": "montessori adjective detective game",
      "data_status": "complete",
      "materials_needed": [
        "Adjective materials",
        "Medium dark blue triangle",
        "Detective adjective game"
      ],
      "parent_description": "Your child is exploring descriptive words that tell us what something is like. Using a dark blue triangle symbol and concrete materials (objects that differ by color, size, or texture), your child discovers how adjectives modify nouns. They might write 'the big red ball' and learn that adjectives add richness and specificity to writing.",
      "why_it_matters": "Adjectives bring language to life. Learning to recognize and use descriptive words helps children write more vivid, engaging sentences and deepens their ability to understand and express ideas with precision."
    },
    {
      "work_id": "la_verb_intro",
      "name": "Introduction to the Verb",
      "name_chinese": "蒙特梭利动词介绍",
      "slug": "verb-intro",
      "area": "language",
      "category": "Grammar",
      "sequence": 4,
      "age_range": "primary_year2",
      "quick_guide": "• Introduction to verbs as action words\n• Large red circle symbol for verb\n• Verbs show what nouns do: runs, jumps, eats\n• Action card games reinforce verb concept\n• Energy of circle represents action energy",
      "presentation_steps": [
        {
          "step": 1,
          "title": "Action Game",
          "description": "Perform action. 'What am I doing?' Running.",
          "tip": "Physical demonstration."
        },
        {
          "step": 2,
          "title": "Verb Definition",
          "description": "'Action words are called verbs.'",
          "tip": "Term introduction."
        },
        {
          "step": 3,
          "title": "Symbol",
          "description": "Introduce large red circle. 'Red like energy.'",
          "tip": "Circle shows action."
        },
        {
          "step": 4,
          "title": "In Sentences",
          "description": "'The cat RUNS.' Place circle above verb.",
          "tip": "Identify in context."
        },
        {
          "step": 5,
          "title": "Verb Commands",
          "description": "Give commands using verbs. Child acts them out.",
          "tip": "Physical reinforcement."
        },
        {
          "step": 6,
          "title": "Writing",
          "description": "Write sentences with strong verbs.",
          "tip": "Verb variety."
        }
      ],
      "direct_aims": [
        "Understanding verbs show action",
        "Verb identification"
      ],
      "indirect_aims": [
        "Sentence building"
      ],
      "materials": [
        "Verb materials",
        "Large red circle symbol",
        "Action cards"
      ],
      "control_of_error": "Action doesn't match verb",
      "prerequisites": [
        "la_noun_intro"
      ],
      "points_of_interest": [
        "Action connection",
        "Energy symbol",
        "Physical learning"
      ],
      "variations": [
        "Verb charades",
        "Verb tense introduction",
        "Verb collection"
      ],
      "common_challenges": [
        "State verbs (is, has)",
        "Tense confusion",
        "Action identification"
      ],
      "video_search_term": "montessori verb introduction action",
      "data_status": "complete",
      "materials_needed": [
        "Verb materials",
        "Large red circle symbol",
        "Action cards"
      ],
      "parent_description": "Your child is discovering the energy of language through verbs—action words represented by a red circle, just like the vital sun! They delight in acting out verbs like 'skip,' 'wiggle,' and 'jump' while classmates guess the action. This kinesthetic, joyful introduction helps children understand that verbs bring sentences to life with movement and energy.",
      "why_it_matters": "Verbs are the heart of meaningful sentences. Understanding action and state-of-being verbs helps children compose sentences with purpose and energy, and deepens their comprehension of what makes a complete thought."
    },
    {
      "work_id": "la_adverb_intro",
      "name": "Introduction to the Adverb",
      "name_chinese": "蒙特梭利副词介绍",
      "slug": "adverb-intro",
      "area": "language",
      "category": "Grammar",
      "sequence": 5,
      "age_range": "primary_year2",
      "quick_guide": "• Introduction to adverbs as words describing verbs\n• Small orange circle symbol mirrors verb relationship\n• Answers: how, when, where regarding actions\n• Demonstrated through varied action performance\n• Develops precise descriptive language",
      "presentation_steps": [
        {
          "step": 1,
          "title": "Verb Review",
          "description": "Review verbs and red circle symbol.",
          "tip": "Build on prior knowledge."
        },
        {
          "step": 2,
          "title": "How Game",
          "description": "'Walk.' Then: 'Walk SLOWLY.' 'Walk QUICKLY.'",
          "tip": "Same verb, different way."
        },
        {
          "step": 3,
          "title": "Adverb Definition",
          "description": "'Words that describe how we do actions are adverbs.'",
          "tip": "Term introduction."
        },
        {
          "step": 4,
          "title": "Symbol",
          "description": "Introduce small orange circle. 'Describes the verb.'",
          "tip": "Color connects to verb."
        },
        {
          "step": 5,
          "title": "In Sentences",
          "description": "'She runs QUICKLY.' Identify and mark adverb.",
          "tip": "Sentence application."
        },
        {
          "step": 6,
          "title": "Writing",
          "description": "Add adverbs to make sentences more interesting.",
          "tip": "Vocabulary development."
        }
      ],
      "direct_aims": [
        "Understanding adverbs describe how, when, where",
        "Adverb identification"
      ],
      "indirect_aims": [
        "Descriptive writing"
      ],
      "materials": [
        "Adverb materials",
        "Small orange circle",
        "Adverb game"
      ],
      "control_of_error": "Adverb doesn't modify correctly",
      "prerequisites": [
        "la_verb_intro"
      ],
      "points_of_interest": [
        "Action modification",
        "Precise description",
        "Verb connection"
      ],
      "variations": [
        "Adverb charades",
        "How-when-where sorting",
        "Writing with adverbs"
      ],
      "common_challenges": [
        "Adjective confusion",
        "Limited adverb vocabulary",
        "Overuse of 'very'"
      ],
      "video_search_term": "montessori adverb manner",
      "data_status": "complete",
      "materials_needed": [
        "Adverb materials",
        "Small orange circle",
        "Adverb game"
      ],
      "parent_description": "Your child is learning how adverbs modify verbs, making actions more interesting and specific. Using an orange circle symbol, they explore how 'skip quickly' is different from 'skip slowly.' By performing the same action in different ways based on adverb instructions, your child experiences directly how these words change the quality of an action.",
      "why_it_matters": "Adverbs expand children's ability to express how, when, and where actions happen. This work prepares them to write with greater nuance and helps them understand the layers of meaning in the sentences they read."
    },
    {
      "work_id": "la_pronoun_intro",
      "name": "Introduction to the Pronoun",
      "name_chinese": "蒙特梭利代词介绍",
      "slug": "pronoun-intro",
      "area": "language",
      "category": "Grammar",
      "sequence": 6,
      "age_range": "primary_year2",
      "quick_guide": "• Introduction to pronouns as noun replacements\n• Purple triangle symbol (like noun but different color)\n• Pronouns: he, she, it, they, we, I, you\n• Prevents repetitive noun use in sentences\n• Develops understanding of reference in text",
      "presentation_steps": [
        {
          "step": 1,
          "title": "Repetition Problem",
          "description": "'The cat ran. The cat ate. The cat slept.' Repetitive.",
          "tip": "Create need for pronouns."
        },
        {
          "step": 2,
          "title": "Solution",
          "description": "'The cat ran. IT ate. IT slept.' Better.",
          "tip": "Pronoun replaces noun."
        },
        {
          "step": 3,
          "title": "Pronoun Term",
          "description": "'Words that replace nouns are pronouns.'",
          "tip": "Term introduction."
        },
        {
          "step": 4,
          "title": "Symbol",
          "description": "Introduce purple/isoceles triangle.",
          "tip": "Triangle like noun but purple."
        },
        {
          "step": 5,
          "title": "Matching",
          "description": "Match pronouns to the nouns they replace.",
          "tip": "Reference understanding."
        },
        {
          "step": 6,
          "title": "In Reading",
          "description": "Identify what pronouns refer to in sentences.",
          "tip": "Comprehension skill."
        }
      ],
      "direct_aims": [
        "Understanding pronoun substitution",
        "Pronoun identification"
      ],
      "indirect_aims": [
        "Varied writing"
      ],
      "materials": [
        "Pronoun materials",
        "Purple/violet triangle"
      ],
      "control_of_error": "Pronoun doesn't match noun",
      "prerequisites": [
        "la_noun_intro"
      ],
      "points_of_interest": [
        "Noun replacement",
        "Smoother sentences",
        "Reference tracking"
      ],
      "variations": [
        "Pronoun substitution games",
        "Story rewriting",
        "Who/what does it mean?"
      ],
      "common_challenges": [
        "Reference confusion",
        "Pronoun agreement",
        "He/she/they selection"
      ],
      "video_search_term": "montessori personal pronouns",
      "data_status": "complete",
      "materials_needed": [
        "Pronoun materials",
        "Purple/violet triangle"
      ],
      "parent_description": "Your child is discovering pronouns—words that stand in for nouns, like 'he,' 'she,' 'they,' and 'I.' Using a purple triangle symbol, they explore how pronouns replace names to avoid repetition. This concept becomes concrete when they record sentences and swap pronouns in place of repeated nouns, seeing how language becomes more elegant.",
      "why_it_matters": "Pronouns are essential for writing flow and clarity. Understanding how pronouns replace nouns helps children write more sophisticated sentences and comprehend how language maintains meaning while varying word choice."
    },
    {
      "work_id": "la_preposition_intro",
      "name": "Introduction to the Preposition",
      "name_chinese": "蒙特梭利介词介绍",
      "slug": "preposition-intro",
      "area": "language",
      "category": "Grammar",
      "sequence": 7,
      "age_range": "primary_year2",
      "quick_guide": "• Introduction to prepositions as position words\n• Green crescent/bridge symbol represents connection\n• Shows relationship between nouns: on, in, under, beside\n• Physical activities demonstrate preposition meaning\n• Essential for following directions",
      "presentation_steps": [
        {
          "step": 1,
          "title": "Position Game",
          "description": "Place object ON table, UNDER table, etc.",
          "tip": "Physical demonstration."
        },
        {
          "step": 2,
          "title": "Word Identification",
          "description": "'These words tell where: on, in, under.'",
          "tip": "Position vocabulary."
        },
        {
          "step": 3,
          "title": "Preposition Term",
          "description": "'Position words are called prepositions.'",
          "tip": "Term introduction."
        },
        {
          "step": 4,
          "title": "Symbol",
          "description": "Introduce green crescent. 'Like a bridge connecting.'",
          "tip": "Relationship symbol."
        },
        {
          "step": 5,
          "title": "In Sentences",
          "description": "'The cat is ON the mat.' Identify and mark preposition.",
          "tip": "Sentence application."
        },
        {
          "step": 6,
          "title": "Direction Following",
          "description": "Follow directions using prepositions.",
          "tip": "Practical application."
        }
      ],
      "direct_aims": [
        "Understanding position words",
        "Preposition identification"
      ],
      "indirect_aims": [
        "Spatial language"
      ],
      "materials": [
        "Preposition materials",
        "Green crescent symbol",
        "Preposition game"
      ],
      "control_of_error": "Position doesn't match preposition",
      "prerequisites": [
        "la_noun_intro"
      ],
      "points_of_interest": [
        "Position clarity",
        "Direction following",
        "Spatial vocabulary"
      ],
      "variations": [
        "Preposition hunt",
        "Art direction game",
        "Obstacle course"
      ],
      "common_challenges": [
        "Many prepositions",
        "Abstract meanings",
        "Similar prepositions"
      ],
      "video_search_term": "montessori preposition introduction",
      "data_status": "complete",
      "materials_needed": [
        "Preposition materials",
        "Green crescent symbol",
        "Preposition game"
      ],
      "parent_description": "Your child is exploring relationships between objects using prepositions—words that show location and connection, like 'in,' 'under,' 'beside,' and 'between.' With a green symbol and hands-on materials (like beads and boxes), they physically place objects in different positions and discover how prepositions describe these spatial relationships.",
      "why_it_matters": "Prepositions are crucial for expressing relationships and giving directions. This work helps children understand how spatial and logical relationships are expressed in language, preparing them for clear writing and reading comprehension."
    },
    {
      "work_id": "la_conjunction_intro",
      "name": "Introduction to the Conjunction",
      "name_chinese": "蒙特梭利连词介绍",
      "slug": "conjunction-intro",
      "area": "language",
      "category": "Grammar",
      "sequence": 8,
      "age_range": "primary_year3",
      "quick_guide": "• Introduction to conjunctions as connecting words\n• Pink rectangle symbol represents bridge between ideas\n• Words: and, but, or, because, so\n• Connects words, phrases, and sentences\n• Develops compound sentence construction",
      "presentation_steps": [
        {
          "step": 1,
          "title": "Connecting Ideas",
          "description": "'I like cats. I like dogs.' How to combine?",
          "tip": "Create need for connection."
        },
        {
          "step": 2,
          "title": "Conjunction Introduction",
          "description": "'I like cats AND dogs.' 'And' connects.",
          "tip": "Joining word."
        },
        {
          "step": 3,
          "title": "Conjunction Term",
          "description": "'Connecting words are called conjunctions.'",
          "tip": "Term introduction."
        },
        {
          "step": 4,
          "title": "Symbol",
          "description": "Introduce pink rectangle. 'Bridge between parts.'",
          "tip": "Connecting symbol."
        },
        {
          "step": 5,
          "title": "Different Conjunctions",
          "description": "Explore: and, but, or, because.",
          "tip": "Different relationships."
        },
        {
          "step": 6,
          "title": "Sentence Building",
          "description": "Combine sentences using conjunctions.",
          "tip": "Writing application."
        }
      ],
      "direct_aims": [
        "Understanding connecting words",
        "Conjunction identification"
      ],
      "indirect_aims": [
        "Complex sentence building"
      ],
      "materials": [
        "Conjunction materials",
        "Pink rectangle symbol"
      ],
      "control_of_error": "Words not properly connected",
      "prerequisites": [
        "la_verb_intro"
      ],
      "points_of_interest": [
        "Idea connection",
        "Sentence variety",
        "Relationship expression"
      ],
      "variations": [
        "Conjunction games",
        "Sentence combining",
        "Because/so pairs"
      ],
      "common_challenges": [
        "Run-on sentences",
        "Conjunction selection",
        "Comma use"
      ],
      "video_search_term": "montessori conjunction introduction",
      "data_status": "complete",
      "materials_needed": [
        "Conjunction materials",
        "Pink rectangle symbol"
      ],
      "parent_description": "Your child is discovering conjunctions—the connecting words like 'and,' 'but,' and 'or' represented by a pink rectangle or ribbon symbol. By exploring how conjunctions tie ideas together (like a ribbon connecting two objects), they understand how these words link words and ideas to create more interesting, complex sentences.",
      "why_it_matters": "Conjunctions are the glue that holds more sophisticated sentences together. Understanding how to use connectives helps children move beyond simple, choppy sentences and begin composing complex thoughts with nuance and flow."
    },
    {
      "work_id": "la_interjection_intro",
      "name": "Introduction to the Interjection",
      "name_chinese": "蒙特梭利感叹词介绍",
      "slug": "interjection-intro",
      "area": "language",
      "category": "Grammar",
      "sequence": 9,
      "age_range": "primary_year3",
      "quick_guide": "• Introduction to interjections as exclamation words\n• Gold keyhole/exclamation symbol represents expression\n• Words: oh, wow, ouch, hey, hooray\n• Express strong emotion or reaction\n• Often followed by exclamation point",
      "presentation_steps": [
        {
          "step": 1,
          "title": "Emotion Expression",
          "description": "Stub toe: 'Ouch!' Surprise: 'Wow!'",
          "tip": "Demonstrate emotion words."
        },
        {
          "step": 2,
          "title": "Interjection Term",
          "description": "'Emotion words are called interjections.'",
          "tip": "Term introduction."
        },
        {
          "step": 3,
          "title": "Symbol",
          "description": "Introduce gold exclamation/keyhole shape.",
          "tip": "Shows emphasis."
        },
        {
          "step": 4,
          "title": "Punctuation",
          "description": "Interjections often use exclamation points.",
          "tip": "Punctuation connection."
        },
        {
          "step": 5,
          "title": "Collection",
          "description": "Collect interjection examples from books.",
          "tip": "Reading application."
        },
        {
          "step": 6,
          "title": "Writing",
          "description": "Add interjections to make writing expressive.",
          "tip": "Emotion in writing."
        }
      ],
      "direct_aims": [
        "Understanding exclamatory words",
        "Interjection identification"
      ],
      "indirect_aims": [
        "Expressive language"
      ],
      "materials": [
        "Interjection materials",
        "Gold keyhole symbol"
      ],
      "control_of_error": "Incorrect usage",
      "prerequisites": [
        "la_verb_intro"
      ],
      "points_of_interest": [
        "Emotion expression",
        "Dramatic effect",
        "Punctuation connection"
      ],
      "variations": [
        "Interjection drama",
        "Comic book study",
        "Dialogue writing"
      ],
      "common_challenges": [
        "Overuse",
        "Appropriate contexts",
        "Punctuation rules"
      ],
      "video_search_term": "montessori interjection",
      "data_status": "complete",
      "materials_needed": [
        "Interjection materials",
        "Gold keyhole symbol"
      ],
      "parent_description": "Your child is discovering interjections—those expressive one-word exclamations like 'Wow!' 'Yikes!' and 'Stop!' represented by a gold exclamation point symbol. These words burst with emotion and stand alone as complete units. Your child explores the feelings behind interjections, understanding how they add personality and emotion to writing.",
      "why_it_matters": "Interjections bring authentic emotion and voice to writing. Understanding how to use these powerful words helps children write with genuine expression and personality, making their writing more engaging and true to their voice."
    },
    {
      "work_id": "la_grammar_boxes",
      "name": "Grammar Boxes",
      "name_chinese": "蒙特梭利语法盒",
      "slug": "grammar-boxes",
      "area": "language",
      "category": "Grammar",
      "sequence": 10,
      "age_range": "primary_year3",
      "quick_guide": "• Color-coded boxes for sorting words by part of speech\n• Each box matches grammar symbol color\n• Child sorts word cards into appropriate boxes\n• Reinforces all parts of speech recognition\n• Develops automatic classification ability",
      "presentation_steps": [
        {
          "step": 1,
          "title": "Box Introduction",
          "description": "Present grammar boxes in row. Identify colors.",
          "tip": "One box per part of speech."
        },
        {
          "step": 2,
          "title": "Card Preparation",
          "description": "Prepare word cards from a sentence.",
          "tip": "Each word on separate card."
        },
        {
          "step": 3,
          "title": "Sorting",
          "description": "Child reads word, identifies part of speech, sorts into box.",
          "tip": "Use symbol knowledge."
        },
        {
          "step": 4,
          "title": "Verification",
          "description": "Check sorted cards for accuracy.",
          "tip": "Self-correction."
        },
        {
          "step": 5,
          "title": "Sentence Cards",
          "description": "Sort words from various sentences.",
          "tip": "Practice variety."
        },
        {
          "step": 6,
          "title": "Create Sentences",
          "description": "Take one card from each box to create sentence.",
          "tip": "Creative grammar."
        }
      ],
      "direct_aims": [
        "Sentence analysis",
        "Part of speech function"
      ],
      "indirect_aims": [
        "Writing skills",
        "Sentence variety"
      ],
      "materials": [
        "Grammar Boxes I-VIII",
        "Filling boxes"
      ],
      "control_of_error": "Sentences don't make sense",
      "prerequisites": [
        "la_adjective_intro",
        "la_verb_intro"
      ],
      "points_of_interest": [
        "Classification practice",
        "Color-coding",
        "Sentence creation"
      ],
      "variations": [
        "Race sorting",
        "Create own word cards",
        "Sentence challenges"
      ],
      "common_challenges": [
        "Ambiguous words",
        "Speed over accuracy",
        "Box confusion"
      ],
      "video_search_term": "montessori grammar box I article",
      "data_status": "complete",
      "materials_needed": [
        "Grammar Boxes I-VIII",
        "Filling boxes"
      ],
      "parent_description": "Your child is building actual sentences using color-coded cards for each part of speech. The Grammar Boxes contain compartments filled with articles (tan), nouns (black), adjectives (brown), verbs (red), prepositions (green), adverbs (orange), pronouns (purple), and conjunctions (pink). Your child selects a sentence card and builds it by finding the appropriate words, then acts it out to truly understand the meaning.",
      "why_it_matters": "Grammar Boxes transform abstract grammar into concrete, kinesthetic learning. By building sentences with their hands and performing them with their bodies, children internalize how grammar works and develop a deep, intuitive understanding of sentence structure."
    },
    {
      "work_id": "la_sentence_analysis",
      "name": "Sentence Analysis",
      "name_chinese": "蒙特梭利句子分析",
      "slug": "sentence-analysis",
      "area": "language",
      "category": "Grammar",
      "sequence": 11,
      "age_range": "primary_year3",
      "quick_guide": "• Breaking sentences into grammatical components\n• Subject/predicate division using arrows and symbols\n• Visual analysis of sentence structure\n• Develops understanding of sentence mechanics\n• Prepares for complex sentence construction",
      "presentation_steps": [
        {
          "step": 1,
          "title": "Simple Sentence",
          "description": "Present: 'The cat runs.' Who/what? The cat.",
          "tip": "Subject identification."
        },
        {
          "step": 2,
          "title": "Subject Arrow",
          "description": "Place black arrow under subject.",
          "tip": "'Who or what?'"
        },
        {
          "step": 3,
          "title": "Predicate",
          "description": "'What does the cat do? Runs.' Red circle.",
          "tip": "Action identification."
        },
        {
          "step": 4,
          "title": "Full Analysis",
          "description": "Place all symbols above sentence parts.",
          "tip": "Complete analysis."
        },
        {
          "step": 5,
          "title": "Complex Sentences",
          "description": "Progress to longer sentences with more elements.",
          "tip": "Gradual complexity."
        },
        {
          "step": 6,
          "title": "Diagramming",
          "description": "Introduce basic sentence diagramming.",
          "tip": "Visual structure."
        }
      ],
      "direct_aims": [
        "Understanding sentence structure",
        "Subject and predicate"
      ],
      "indirect_aims": [
        "Complex sentence writing"
      ],
      "materials": [
        "Sentence analysis charts",
        "Question arrows"
      ],
      "control_of_error": "Analysis incorrect",
      "prerequisites": [
        "la_grammar_boxes"
      ],
      "points_of_interest": [
        "Sentence structure",
        "Visual analysis",
        "Pattern recognition"
      ],
      "variations": [
        "Sentence building from analysis",
        "Complex sentence work",
        "Creative analysis"
      ],
      "common_challenges": [
        "Complex subjects",
        "Compound sentences",
        "Phrase identification"
      ],
      "video_search_term": "montessori sentence analysis subject predicate",
      "data_status": "complete",
      "materials_needed": [
        "Sentence analysis charts",
        "Question arrows"
      ],
      "parent_description": "Your child is breaking down sentences into their component parts, discovering how subjects, predicates, verbs, and objects work together to create meaning. Using color-coded arrows and symbols, they analyze sentences from books, their own writing, or teacher-created examples, asking questions to identify each grammatical role.",
      "why_it_matters": "Sentence analysis develops reading comprehension and writing clarity. By understanding how sentences are structured, children can read more critically, troubleshoot their own writing, and compose increasingly sophisticated sentences with purpose and correctness."
    },
    {
      "work_id": "la_word_families",
      "name": "Word Families",
      "name_chinese": "蒙特梭利词族",
      "slug": "word-families",
      "area": "language",
      "category": "Word Study",
      "sequence": 1,
      "age_range": "primary_year1",
      "quick_guide": "• Groups of words sharing common phonetic patterns\n• Example: -at family: cat, bat, hat, mat, sat\n• Develops phonemic awareness and decoding skills\n• Shows spelling patterns across words\n• Accelerates reading and spelling",
      "presentation_steps": [
        {
          "step": 1,
          "title": "Family Introduction",
          "description": "Present: cat, bat, hat. 'Notice the pattern.'",
          "tip": "Visual/auditory pattern."
        },
        {
          "step": 2,
          "title": "Pattern Identification",
          "description": "'They all end in -at. They're in the -at family.'",
          "tip": "Family term."
        },
        {
          "step": 3,
          "title": "Family Generation",
          "description": "'What other -at words can you think of?'",
          "tip": "Brainstorming."
        },
        {
          "step": 4,
          "title": "Other Families",
          "description": "Introduce other families: -ig, -op, -ug.",
          "tip": "Multiple patterns."
        },
        {
          "step": 5,
          "title": "Sorting",
          "description": "Sort words into family groups.",
          "tip": "Classification activity."
        },
        {
          "step": 6,
          "title": "Writing",
          "description": "Write sentences using family words.",
          "tip": "Application."
        }
      ],
      "direct_aims": [
        "Recognizing spelling patterns",
        "Rhyme families"
      ],
      "indirect_aims": [
        "Spelling",
        "Decoding"
      ],
      "materials": [
        "Word family cards",
        "Word family charts"
      ],
      "control_of_error": "Words don't fit family",
      "prerequisites": [
        "la_pink_series"
      ],
      "points_of_interest": [
        "Pattern recognition",
        "Reading acceleration",
        "Spelling support"
      ],
      "variations": [
        "Family flip books",
        "Rhyming games",
        "Word family houses"
      ],
      "common_challenges": [
        "Exceptions to patterns",
        "Similar family confusion",
        "Transfer to reading"
      ],
      "video_search_term": "montessori word family at",
      "data_status": "complete",
      "materials_needed": [
        "Word family cards",
        "Word family charts"
      ],
      "parent_description": "Your child is discovering patterns in words by exploring word families—groups of words with similar sounds and structures, like 'cat, sat, bat, mat' or 'make, bake, take, shake.' By recognizing these patterns, your child learns to decode new words more efficiently and builds phonemic awareness through exploring words that rhyme and share patterns.",
      "why_it_matters": "Word families are an efficient way to decode and spell words. By understanding phonetic patterns, children can apply knowledge of one word to unlock the reading of many related words, dramatically accelerating vocabulary development and reading fluency."
    },
    {
      "work_id": "la_spelling_rules",
      "name": "Spelling Rules",
      "name_chinese": "蒙特梭利拼写规则",
      "slug": "spelling-rules",
      "area": "language",
      "category": "Word Study",
      "sequence": 2,
      "age_range": "5-8+ years",
      "quick_guide": "• Teach explicit spelling patterns and rules\n• Focus on common, high-utility rules first\n• Use word families and pattern recognition\n• Provide mnemonic helpers for complex rules\n• Connect spelling to phonetics and word structure",
      "presentation_steps": [
        {
          "step": 1,
          "title": "Assess Spelling Patterns",
          "description": "Observe children's spelling attempts to identify which patterns they understand and which need explicit teaching. Use assessments to guide which rules to teach and when.",
          "tip": "Children's invented spelling reveals their understanding of spelling patterns. Use this as diagnostic information."
        },
        {
          "step": 2,
          "title": "Introduce Common Rules First",
          "description": "Begin with high-utility rules that apply to many words: doubling consonants before adding suffix (hop→hopped), dropping final e before adding -ing (make→making), changing y to i (happy→happily). Teach rules that help spell the most words.",
          "tip": "Montessori teachers often supplement standard materials with explicit spelling rule instruction, as Dr. Montessori developed materials for Italian, which has simpler spelling."
        },
        {
          "step": 3,
          "title": "Use Word Families",
          "description": "Organize words by pattern. Show a family: -at (cat, bat, fat, mat, sat). Or -ing (walking, talking, running, sitting). Children see the pattern visually and aurally, making the rule memorable.",
          "tip": "Word family sorting activities help children internalize patterns without memorizing rules abstractly."
        },
        {
          "step": 4,
          "title": "Teach Rule with Examples",
          "description": "Explicitly state the rule and provide multiple examples. 'When a word ends in consonant-vowel-consonant (like 'hop'), double the last consonant before adding a suffix starting with a vowel: h-o-p = hop. Double: hopped.' Show examples: hop-hopped, sit-sitting, run-running.",
          "tip": "Explicit instruction is effective. State the rule clearly, not assuming children will discover it independently."
        },
        {
          "step": 5,
          "title": "Practice and Apply",
          "description": "Provide word lists for children to practice applying rules. Have them sort words by rule, create new words following rules, or identify which rule applies to given words. Connect to their writing.",
          "tip": "Apply rules to children's actual writing. When they write 'makeing,' it's a teaching moment to review the rule."
        }
      ],
      "direct_aims": [
        "Learn common spelling rules and patterns",
        "Develop ability to spell multisyllabic words",
        "Apply rules to unfamiliar words",
        "Build independent spelling strategies"
      ],
      "indirect_aims": [
        "Develop understanding of English orthography",
        "Build confidence in writing",
        "Recognize patterns in language",
        "Support reading through pattern recognition",
        "Develop problem-solving approach to spelling"
      ],
      "materials": [
        "Spelling rule charts",
        "Word sorting materials"
      ],
      "control_of_error": "Accuracy of spelling following taught rules; ability to apply rule to new words; improvement in writing; understanding of rule logic and when it applies",
      "prerequisites": [
        "la_green_series"
      ],
      "points_of_interest": [
        "Discovery that spelling isn't random—it follows patterns",
        "Recognition of familiar patterns in new words",
        "Ability to spell more complex words using rules",
        "Confidence in attempting to spell unfamiliar words",
        "The logic underlying English spelling"
      ],
      "variations": [
        "Focusing on specific rule families in depth",
        "Creating personal spelling journals with rules and examples",
        "Spelling games using rules (word building, sorting)",
        "Visual mnemonics or acronyms for complex rules",
        "Integrating rules with phonogram learning"
      ],
      "common_challenges": [
        "Too many exceptions to rules confusing children",
        "Teaching rules without application to real words",
        "Children memorizing rules without understanding why",
        "Overlooking irregular or 'puzzle' words that don't follow rules",
        "Disconnect between learning rules and applying to writing"
      ],
      "video_search_term": "montessori spelling doubling rule",
      "data_status": "needs_guide",
      "materials_needed": [
        "Word family cards organized by pattern",
        "Spelling rule charts with examples",
        "Word sorting activities",
        "Spelling word lists organized by rule",
        "Reference charts for classroom use",
        "Writing samples for application practice"
      ],
      "extensions": [
        "More complex rules (prefix/suffix combinations, syllabication)",
        "Exceptions to rules and why they exist",
        "Etymology and how word origins explain spelling",
        "Multi-step rules (e.g., changing y to i, then adding suffix)",
        "Applying rules to children's own writing"
      ],
      "vocabulary": [
        "Spelling rule",
        "Pattern",
        "Consonant",
        "Vowel",
        "Suffix",
        "Prefix",
        "Word family",
        "Exception"
      ],
      "parent_description": "Spelling Rules teach that English spelling, while complex, follows underlying patterns. Rather than requiring children to memorize each word, teaching rules and patterns gives them tools to spell unfamiliar words. Children learn that hopping doubles the p, that dropping the final e occurs before adding -ing, that changing y to i happens before adding -ly. These patterns, seen across many words, help children spell more independently. While English contains exceptions, knowing the rules gets you 84% of the way—enough to support confident, independent spelling.",
      "why_it_matters": "Teaching spelling rules explicitly supports spelling accuracy and writing fluency. Children who understand spelling patterns become more confident writers, less likely to avoid writing complex words. Pattern-based spelling instruction is more effective than memorization because it's generalizable—once a child knows the doubling rule, they can apply it to numerous words, not just those memorized. Spelling competence also supports reading, as recognizing spelling patterns helps children decode unfamiliar words."
    },
    {
      "work_id": "la_compound_words",
      "name": "Compound Words",
      "name_chinese": "蒙特梭利复合词",
      "slug": "compound-words",
      "area": "language",
      "category": "Word Study",
      "sequence": 3,
      "age_range": "primary_year2",
      "quick_guide": "• Words made from combining two smaller words\n• Examples: rainbow, sunflower, baseball\n• Develops vocabulary and word analysis skills\n• Shows how meaning combines from parts\n• Prepares for prefix/suffix understanding",
      "presentation_steps": [
        {
          "step": 1,
          "title": "Introduction",
          "description": "Present 'sun' card and 'flower' card separately.",
          "tip": "Two known words."
        },
        {
          "step": 2,
          "title": "Combining",
          "description": "Push together: 'sunflower'. New word!",
          "tip": "Visual combination."
        },
        {
          "step": 3,
          "title": "Meaning",
          "description": "Discuss: sun + flower = flower that looks like sun.",
          "tip": "Combined meaning."
        },
        {
          "step": 4,
          "title": "More Examples",
          "description": "Rainbow, baseball, cupcake, etc.",
          "tip": "Pattern recognition."
        },
        {
          "step": 5,
          "title": "Matching Game",
          "description": "Match word halves to make compounds.",
          "tip": "Game format."
        },
        {
          "step": 6,
          "title": "Writing",
          "description": "Use compound words in sentences.",
          "tip": "Application."
        }
      ],
      "direct_aims": [
        "Understanding word building",
        "Vocabulary"
      ],
      "indirect_aims": [
        "Reading comprehension"
      ],
      "materials": [
        "Compound word cards",
        "Matching materials"
      ],
      "control_of_error": "Compound doesn't make sense",
      "prerequisites": [
        "la_blue_series"
      ],
      "points_of_interest": [
        "Word combination",
        "Meaning discovery",
        "Vocabulary growth"
      ],
      "variations": [
        "Compound word hunt",
        "Create new compounds",
        "Illustrate compounds"
      ],
      "common_challenges": [
        "Non-compound confusion",
        "Meaning interpretation",
        "Spelling"
      ],
      "video_search_term": "montessori compound words matching",
      "data_status": "complete",
      "materials_needed": [
        "Compound word cards",
        "Matching materials"
      ],
      "parent_description": "Your child is delighted to discover that two separate words can combine to create a brand new word with its own unique meaning! Words like 'sunflower' (sun + flower), 'sometimes' (some + times), and 'butterfly' (butter + fly) fascinate children as they break compounds into parts and create their own new combinations. This work reveals the logic—and sometimes the beautiful illogic—of English.",
      "why_it_matters": "Understanding compound words expands vocabulary and develops word analysis skills. Children learn that knowing smaller words helps unlock larger ones, and the creativity of combining words captures their interest in how language works."
    },
    {
      "work_id": "la_prefixes_suffixes",
      "name": "Prefixes and Suffixes",
      "name_chinese": "蒙特梭利前缀后缀",
      "slug": "prefixes-suffixes",
      "area": "language",
      "category": "Word Study",
      "sequence": 4,
      "age_range": "5-8+ years",
      "quick_guide": "• Word elements that modify meaning (un-, re-, -ful, -less)\n• Teach common prefixes and suffixes explicitly\n• Show how affixes change word meaning and function\n• Practice building new words with affixes\n• Connect to reading and writing skills",
      "presentation_steps": [
        {
          "step": 1,
          "title": "Introduce Prefix Concept",
          "description": "Show word pairs: happy/unhappy, do/redo, do/undo. Discuss: 'What part is the same?' (happy, do) 'What part is added?' (un-, re-) 'Does it change the meaning?' Introduce the idea that affixes change words.",
          "tip": "Start with very common, high-utility prefixes (un-, re-, pre-) that children will encounter in reading."
        },
        {
          "step": 2,
          "title": "Teach Individual Prefixes",
          "description": "Present one prefix with multiple examples: un-(undo, unhappy, unfair, unzip). Use consistent language: 'un- means not.' Show how the prefix changes meaning. Have children practice making new words with the prefix.",
          "tip": "Knowing the meaning of the prefix helps children decode new words. 'Un- means not, so unlucky means...'"
        },
        {
          "step": 3,
          "title": "Introduce Suffixes",
          "description": "Show word pairs showing suffix addition: walk/walker, slow/slowly, beauty/beautiful. Discuss: 'What part is the same?' 'What's added?' 'How does it change meaning or function?' Introduce suffix concept.",
          "tip": "Suffixes often change parts of speech: walk (verb) → walker (noun), slow (adjective) → slowly (adverb)."
        },
        {
          "step": 4,
          "title": "Teach Individual Suffixes",
          "description": "Present suffixes one at a time with multiple examples: -ful (careful, helpful, beautiful, wonderful). Teach the meaning: '-ful means full of.' Show how it changes meaning and part of speech.",
          "tip": "Some suffixes are straightforward (-er = one who); others are more complex. Start with the clearest."
        },
        {
          "step": 5,
          "title": "Practice Word Building",
          "description": "Provide activities where children build words using affixes: add prefixes to root words, add suffixes, combine multiple affixes. Sort words by which prefix or suffix they contain. Apply to reading and writing.",
          "tip": "Kinesthetic letter manipulation (movable alphabet) helps children experience how affixes combine with roots."
        }
      ],
      "direct_aims": [
        "Learn common prefixes and suffixes",
        "Understand how affixes modify meaning",
        "Develop ability to decode unfamiliar words",
        "Build vocabulary efficiently"
      ],
      "indirect_aims": [
        "Recognize patterns in word structure",
        "Build understanding of how English creates new words",
        "Support reading fluency and comprehension",
        "Develop spelling and writing skills",
        "Expand vocabulary through pattern recognition"
      ],
      "materials": [
        "Prefix/suffix cards",
        "Word building materials"
      ],
      "control_of_error": "Accuracy of meaning when affix is applied; child's ability to build new words correctly; application to reading and writing; understanding of what each affix means",
      "prerequisites": [
        "la_spelling_rules"
      ],
      "points_of_interest": [
        "Discovering that new words can be built from familiar parts",
        "Understanding how affixes change meaning",
        "Ability to decode unfamiliar words by recognizing affixes",
        "Building 'new' words from known roots",
        "The systematic nature of word building"
      ],
      "variations": [
        "Creating personal prefix and suffix collections",
        "Sorting words by which affix they contain",
        "Building word families from one root",
        "Discovering how multiple affixes can be combined",
        "Connecting affixes to etymology and word origins"
      ],
      "common_challenges": [
        "Children confuse root meaning with affix meaning",
        "Words where letters within root change when affix is added (happy→happily, not happyly)",
        "Affixes with multiple meanings (re- can mean again or back)",
        "Pseudo-affixes: words that look like they have affixes but are roots (under, over)",
        "Applying rules mechanically without understanding meaning"
      ],
      "video_search_term": "montessori suffixes",
      "data_status": "needs_guide",
      "materials_needed": [
        "Prefix and suffix cards",
        "Root word cards for combining with affixes",
        "Word building cards with affixes and roots on separate pieces",
        "Word lists organized by prefix/suffix",
        "Charts showing common affixes and their meanings",
        "Movable alphabet letters for manipulation"
      ],
      "extensions": [
        "More complex affixes and their combinations",
        "Etymology: understanding affix origins (Latin, Greek, Old English)",
        "Exceptions: words that look like they have affixes but don't",
        "Multiple syllables and stress patterns with affixes",
        "Using affixes to understand meanings of multisyllabic words"
      ],
      "vocabulary": [
        "Prefix",
        "Suffix",
        "Affix",
        "Root word",
        "Modify",
        "Meaning",
        "Combine",
        "Morpheme"
      ],
      "parent_description": "Prefixes and Suffixes are word parts that modify meaning. Prefixes (un-, re-, pre-) attach to the beginning of words; suffixes (-ful, -less, -ing, -ly) attach to the end. Teaching these word elements explicitly empowers children to decode unfamiliar words. Learning that 'un-' means not helps children understand that unkind means not kind, unhappy means not happy. Learning that '-ful' means full of helps them understand that careful means full of care. By recognizing these parts in new words, children can decode them independently and expand vocabulary significantly.",
      "why_it_matters": "Prefixes and suffixes are powerful tools for word learning and reading fluency. A child who knows common affixes can decode hundreds of words they've never seen before. Etymology and morphological awareness (understanding word structure) directly supports reading comprehension and vocabulary growth. Research shows that explicit instruction in affixes significantly improves reading comprehension and spelling. Perhaps most importantly, understanding affixes teaches children that language is systematic—words are built from parts that follow rules, not random collections of letters."
    },
    {
      "work_id": "la_synonyms_antonyms",
      "name": "Synonyms and Antonyms",
      "name_chinese": "蒙特梭利近义词反义词",
      "slug": "synonyms-antonyms",
      "area": "language",
      "category": "Word Study",
      "sequence": 5,
      "age_range": "5-8+ years",
      "quick_guide": "• Synonyms: words with similar meanings (big/large, happy/joyful)\n• Antonyms: words with opposite meanings (big/small, happy/sad)\n• Teach through comparison and categorization\n• Use in reading to expand vocabulary and comprehension\n• Support writing through word choice variety",
      "presentation_steps": [
        {
          "step": 1,
          "title": "Introduce Synonym Concept",
          "description": "Show word pairs with similar meanings: big/large, small/tiny, happy/joyful, run/sprint. Discuss: 'Do these words mean the same thing?' 'Are they exactly the same, or slightly different?' Introduce idea that different words can have similar meanings.",
          "tip": "Even synonyms have nuances. Big and large mean similar things but have different feel/usage. This sophistication is valuable."
        },
        {
          "step": 2,
          "title": "Present Synonym Groups",
          "description": "Show groups of similar words: happy/joyful/glad/delighted. Discuss how they're similar (all positive emotions) and different (delighted is more intense than happy). Show range of synonyms from simple to sophisticated.",
          "tip": "This helps children see vocabulary nuance. Not all synonyms are perfectly interchangeable; context matters."
        },
        {
          "step": 3,
          "title": "Introduce Antonym Concept",
          "description": "Show word pairs with opposite meanings: big/small, happy/sad, hot/cold, go/stop. Discuss: 'These words have opposite meanings.' Introduce term 'antonym.' Explore multiple pairs.",
          "tip": "Some antonyms are perfect opposites (on/off); others are just opposite ends of a spectrum (big/small)."
        },
        {
          "step": 4,
          "title": "Create Synonym and Antonym Connections",
          "description": "Use visual organizers: one word in center, synonyms around it, antonyms on opposite side. Or sort cards into synonym groups. Activities help children see relationships visually.",
          "tip": "Visual organization makes abstract relationships concrete and memorable."
        },
        {
          "step": 5,
          "title": "Apply to Reading and Writing",
          "description": "In reading: 'This character is very sad. What's the antonym?' In writing: 'You used 'happy' twice. What's a synonym you could use instead?' Connect concepts to actual language use.",
          "tip": "Real application motivates learning. Children see why understanding synonyms and antonyms matters for communication."
        }
      ],
      "direct_aims": [
        "Learn synonyms and antonyms",
        "Understand word relationships and meanings",
        "Expand vocabulary through related words",
        "Improve writing through varied word choices"
      ],
      "indirect_aims": [
        "Develop sophisticated understanding of vocabulary",
        "Support reading comprehension",
        "Build confidence in language use",
        "Foster appreciation for language variety",
        "Support thinking about similarity and difference"
      ],
      "materials": [
        "Synonym/antonym cards",
        "Matching games"
      ],
      "control_of_error": "Accuracy of synonym/antonym identification; ability to explain similarity/difference; application to reading and writing; quality of word choice improvements",
      "prerequisites": [
        "la_green_series"
      ],
      "points_of_interest": [
        "Discovering multiple ways to express the same idea",
        "Understanding nuances in word meaning",
        "Building vocabulary through relationships",
        "Improving writing through word choice variety",
        "Understanding how words relate to each other"
      ],
      "variations": [
        "Organizing synonyms by intensity (sad → upset → devastated)",
        "Finding antonyms that form compound words or phrases",
        "Creating personal thesaurus of favorite synonyms",
        "Exploring how synonyms appear in different contexts",
        "Finding synonyms and antonyms in classroom reading materials"
      ],
      "common_challenges": [
        "Children treat all synonyms as perfect substitutes without noticing nuance",
        "Confusion between synonyms and words that are simply related",
        "Difficulty finding antonyms for abstract words",
        "Limited vocabulary restricting synonym knowledge",
        "Mechanical completion of synonym/antonym tasks without understanding"
      ],
      "video_search_term": "montessori antonyms",
      "data_status": "needs_guide",
      "materials_needed": [
        "Synonym and antonym card sets",
        "Visual organizers (word webs, comparison charts)",
        "Word sort activities organized by synonym/antonym relationships",
        "Thesaurus for exploring word relationships",
        "Books highlighted with synonym and antonym examples",
        "Writing samples for analysis and improvement"
      ],
      "extensions": [
        "Understanding subtle shades of meaning within synonyms",
        "Exploring why synonyms might be preferred in different contexts",
        "Learning connotations (neutral vs. positive/negative tone)",
        "Creating word families showing related meanings",
        "Advanced study of near-synonyms and nearly-opposite words"
      ],
      "vocabulary": [
        "Synonym",
        "Antonym",
        "Opposite",
        "Similar",
        "Meaning",
        "Word relationship",
        "Vocabulary"
      ],
      "parent_description": "Synonyms are words with similar meanings; antonyms are words with opposite meanings. Children learn that 'big' and 'large' are synonyms—similar but not identical. They learn that 'big' and 'small' are antonyms—opposite meanings. Understanding these relationships helps children understand texts (using context and word relationships to infer meaning), expand vocabulary, and vary word choices in writing. Rather than always using the same word (happy, happy, happy), children learn alternatives (joyful, delighted, glad) that add sophistication and precision. This work is playful and visual, often involving sorting, categorizing, and building connections between words.",
      "why_it_matters": "Understanding word relationships is central to vocabulary growth and reading comprehension. When children understand that words have synonyms and antonyms, they recognize larger patterns in language. In reading, knowing an antonym can help infer meaning: 'The opposite of cloudy is clear, so clearing up means getting clearer.' In writing, choosing among synonyms helps express subtle meanings and add variety. Most importantly, working with synonyms and antonyms teaches children to think about language analytically—to see words not as isolated items but as parts of an interconnected system. This metalinguistic awareness supports all future language learning."
    },
    {
      "work_id": "la_homonyms",
      "name": "Homonyms",
      "name_chinese": "蒙特梭利同音词",
      "slug": "homonyms",
      "area": "language",
      "category": "Word Study",
      "sequence": 6,
      "age_range": "primary_year2",
      "quick_guide": "• Word relationship studies for vocabulary development\n• Synonyms: same/similar meaning (big/large)\n• Antonyms: opposite meaning (big/small)\n• Homonyms: same sound, different meaning (bear/bare)\n• Develops precise word choice and vocabulary",
      "presentation_steps": [
        {
          "step": 1,
          "title": "Synonym Introduction",
          "description": "'Big and large mean the same. They're synonyms.'",
          "tip": "Same meaning words."
        },
        {
          "step": 2,
          "title": "Synonym Matching",
          "description": "Match synonym pairs: happy/glad, fast/quick.",
          "tip": "Card matching."
        },
        {
          "step": 3,
          "title": "Antonym Introduction",
          "description": "'Hot and cold are opposites. They're antonyms.'",
          "tip": "Opposite meaning."
        },
        {
          "step": 4,
          "title": "Antonym Matching",
          "description": "Match antonym pairs: up/down, day/night.",
          "tip": "Opposite pairs."
        },
        {
          "step": 5,
          "title": "Homonym Introduction",
          "description": "'Bear (animal) and bare (no clothes) sound the same.'",
          "tip": "Same sound, different spelling/meaning."
        },
        {
          "step": 6,
          "title": "Practice",
          "description": "Sort, match, use in context.",
          "tip": "Multiple activities."
        }
      ],
      "direct_aims": [
        "Understanding multiple meanings",
        "Spelling awareness"
      ],
      "indirect_aims": [
        "Context clues"
      ],
      "materials": [
        "Homonym cards with pictures"
      ],
      "control_of_error": "Wrong meaning for context",
      "prerequisites": [
        "la_green_series"
      ],
      "points_of_interest": [
        "Word relationships",
        "Vocabulary expansion",
        "Precise language"
      ],
      "variations": [
        "Thesaurus use",
        "Writing with synonyms",
        "Antonym chains"
      ],
      "common_challenges": [
        "Category confusion",
        "Subtle differences",
        "Homophone spelling"
      ],
      "video_search_term": "montessori homophones",
      "data_status": "complete",
      "materials_needed": [
        "Homonym cards with pictures"
      ],
      "parent_description": "Your child is exploring the playful complexity of English by discovering homonyms—words that are spelled the same but have different meanings (like 'bat: the animal' vs. 'bat: the sports equipment'), and homophones—words that sound the same but are spelled differently (like 'there/their/they're'). Using matching cards and definition work, your child discovers why context matters so much in reading.",
      "why_it_matters": "Understanding homonyms and homophones develops reading comprehension and spelling accuracy. This work helps children understand that multiple words can sound or look alike but carry completely different meanings, making them more careful readers and writers."
    }
  ]
}