[
  {"work_id": "pl_carrying_mat", "area": "practical_life", "parent_description": "Your child learns to carry, unroll, and roll their work mat with care, building independence and respect for the classroom space.", "why_it_matters": "Prepares for all other classroom activities and builds responsibility.", "home_connection": "Notice how they handle their belongings more carefully at home."},
  {"work_id": "pl_carrying_chair", "area": "practical_life", "parent_description": "Your child practices lifting and placing a chair quietly, learning to move through spaces with awareness of others around them.", "why_it_matters": "Builds body control and consideration for others.", "home_connection": "Watch them move furniture without bumping or scraping."},
  {"work_id": "pl_carrying_tray", "area": "practical_life", "parent_description": "Your child carries a tray with objects balanced and steady, developing coordination and concentration while preparing for more complex tasks.", "why_it_matters": "Foundation for serving food and carrying materials safely.", "home_connection": "Let them help carry things to the table at mealtimes."},
  {"work_id": "pl_carrying_table", "area": "practical_life", "parent_description": "Your child works with a partner to carry a table together, learning teamwork and how to communicate while coordinating movements.", "why_it_matters": "Teaches cooperation and non-verbal communication.", "home_connection": "They may want to help rearrange furniture with you."},
  {"work_id": "pl_opening_closing_door", "area": "practical_life", "parent_description": "Your child practices opening and closing doors quietly, learning awareness of who might be on the other side and how to move gracefully.", "why_it_matters": "Builds courtesy and safety awareness.", "home_connection": "Notice them being more careful with doors at home."},
  {"work_id": "pl_walking_line", "area": "practical_life", "parent_description": "Your child walks carefully along a line on the floor, sometimes carrying objects, building balance and the ability to control their body.", "why_it_matters": "Develops self-discipline and physical control.", "home_connection": "They may practice balancing while walking at home."},
  {"work_id": "pl_sitting_standing", "area": "practical_life", "parent_description": "Your child learns the graceful way to sit down at a table and stand up again, moving their chair quietly and with control.", "why_it_matters": "Creates good habits for any seated activity.", "home_connection": "Watch for improved table manners at meals."},
  {"work_id": "pl_silence_game", "area": "practical_life", "parent_description": "Your child practices being completely still and quiet, listening for soft sounds and their whispered name, building inner calm and self-control.", "why_it_matters": "Develops concentration and peaceful awareness.", "home_connection": "Try a quiet moment together and see how long they can stay still."},
  {"work_id": "pl_turning_pages", "area": "practical_life", "parent_description": "Your child learns to handle books gently, turning pages one at a time from the corner, showing care and respect for classroom materials.", "why_it_matters": "Builds love of books and care for belongings.", "home_connection": "Notice gentler handling of books at home."},
  {"work_id": "pl_folding_cloth", "area": "practical_life", "parent_description": "Your child folds napkins and cloths along lines, matching edges precisely, developing hand control and early concepts of halves and quarters.", "why_it_matters": "Prepares hand skills for writing and early math concepts.", "home_connection": "Let them help fold napkins or small towels."},
  {"work_id": "pl_dry_transfer_hand", "area": "practical_life", "parent_description": "Your child moves objects like cotton balls or beans from one bowl to another using just their hands, building focus and hand-eye coordination.", "why_it_matters": "First step in a sequence that leads to writing readiness.", "home_connection": "Let them sort small items like buttons or pasta at home."},
  {"work_id": "pl_spooning", "area": "practical_life", "parent_description": "Your child carefully transfers small objects from one bowl to another using a spoon, building the hand control needed for writing.", "why_it_matters": "Strengthens the same muscles used to hold a pencil.", "home_connection": "Let them help scoop rice or beans at mealtimes."},
  {"work_id": "pl_tonging", "area": "practical_life", "parent_description": "Your child uses different types of tongs to pick up and move objects, strengthening their hand muscles and practicing the squeezing motion.", "why_it_matters": "Builds hand strength essential for pencil grip.", "home_connection": "Try kitchen tongs at home for picking up salad or ice."},
  {"work_id": "pl_tweezers", "area": "practical_life", "parent_description": "Your child uses tweezers to pick up tiny objects and place them carefully, developing the precise thumb-and-finger grip needed for writing.", "why_it_matters": "Directly prepares the fingers for holding a pencil.", "home_connection": "Notice their improved ability to pick up small things."},
  {"work_id": "pl_chopsticks", "area": "practical_life", "parent_description": "Your child learns to use chopsticks to transfer objects, mastering one of the most challenging hand coordination skills while connecting to Chinese culture.", "why_it_matters": "Combines cultural learning with advanced hand control.", "home_connection": "Practice chopsticks together at family meals."},
  {"work_id": "pl_pouring_dry", "area": "practical_life", "parent_description": "Your child pours dry materials like rice or beans from one pitcher to another, learning to control their wrist and judge amounts.", "why_it_matters": "Prepares for pouring liquids without spills.", "home_connection": "Let them pour cereal or pasta from containers."},
  {"work_id": "pl_pouring_water", "area": "practical_life", "parent_description": "Your child pours water between pitchers and into glasses, learning to control the flow and stop at the right moment.", "why_it_matters": "Builds independence for self-serving at meals.", "home_connection": "Let them pour their own water or milk at home."},
  {"work_id": "pl_sponging", "area": "practical_life", "parent_description": "Your child squeezes water from a sponge to transfer it between bowls, building hand strength while learning to clean up spills.", "why_it_matters": "Prepares hands for writing and teaches cleanup skills.", "home_connection": "Give them a sponge to help wipe up spills."},
  {"work_id": "pl_basting", "area": "practical_life", "parent_description": "Your child uses a turkey baster to squeeze and release water, discovering how pressure creates suction while building hand strength.", "why_it_matters": "Combines science concepts with hand strengthening.", "home_connection": "Try a baster in the bathtub for fun water play."},
  {"work_id": "pl_dropper", "area": "practical_life", "parent_description": "Your child uses an eye dropper to move water one drop at a time, developing the precise finger control needed for detailed work.", "why_it_matters": "The closest activity to holding a pencil for writing.", "home_connection": "They may love using droppers for art or science play."},
  {"work_id": "pl_frame_velcro", "area": "practical_life", "parent_description": "Your child practices opening and closing velcro fasteners on a special frame, learning the easiest fastening skill that leads to dressing independence.", "why_it_matters": "First step toward dressing without help.", "home_connection": "Look for velcro shoes or jackets to practice at home."},
  {"work_id": "pl_frame_snaps", "area": "practical_life", "parent_description": "Your child learns to pop open and press closed snap buttons on a frame, building finger strength and the satisfying click of success.", "why_it_matters": "Builds hand strength for buttoning and writing.", "home_connection": "Point out snap buttons on their own clothes."},
  {"work_id": "pl_frame_large_buttons", "area": "practical_life", "parent_description": "Your child practices pushing large buttons through buttonholes using both hands together, building the coordination needed for getting dressed.", "why_it_matters": "Two-handed coordination essential for many life skills.", "home_connection": "Let them button their own shirt or pajamas."},
  {"work_id": "pl_frame_small_buttons", "area": "practical_life", "parent_description": "Your child masters the challenge of small buttons, developing patience and precision while working toward complete dressing independence.", "why_it_matters": "Refines the fine control needed for detailed tasks.", "home_connection": "Celebrate when they button small buttons alone."},
  {"work_id": "pl_frame_zipper", "area": "practical_life", "parent_description": "Your child learns to connect and pull zippers, mastering both jacket-style separating zippers and simpler straight zippers.", "why_it_matters": "Essential skill for jackets, bags, and backpacks.", "home_connection": "Let them zip their own jacket before going outside."},
  {"work_id": "pl_frame_hook_eye", "area": "practical_life", "parent_description": "Your child carefully hooks tiny fasteners into small loops, developing the patience and precision needed for the most delicate clothing closures.", "why_it_matters": "Develops extremely precise finger control.", "home_connection": "These are often on dress-up clothes they may want to wear."},
  {"work_id": "pl_frame_buckles", "area": "practical_life", "parent_description": "Your child threads straps through buckles and fastens them, learning the same skill needed for belts, backpacks, and car seats.", "why_it_matters": "Practical skill used daily in many situations.", "home_connection": "Let them buckle their own backpack or belt."},
  {"work_id": "pl_frame_safety_pins", "area": "practical_life", "parent_description": "Your child learns to open, thread, and safely close safety pins, combining careful attention with awareness of the sharp point.", "why_it_matters": "Builds safety awareness while handling tools.", "home_connection": "An advanced skill - supervise practice at home."},
  {"work_id": "pl_frame_lacing", "area": "practical_life", "parent_description": "Your child threads laces through holes in a crisscross pattern, building the foundation for tying their own shoes one day.", "why_it_matters": "Direct preparation for shoe tying independence.", "home_connection": "Practice lacing on shoes before trying to tie."},
  {"work_id": "pl_frame_bow_tying", "area": "practical_life", "parent_description": "Your child learns to tie ribbons into bows, mastering one of the most complex hand coordination challenges on the path to tying shoes.", "why_it_matters": "Major milestone in dressing independence.", "home_connection": "Practice on ribbons before moving to shoelaces."},
  {"work_id": "pl_shoe_polishing", "area": "practical_life", "parent_description": "Your child cares for shoes by applying polish, brushing, and buffing until they shine, taking pride in maintaining their belongings.", "why_it_matters": "Teaches care for belongings and completing multi-step tasks.", "home_connection": "Let them help polish family shoes on weekends."},
  {"work_id": "pl_braiding", "area": "practical_life", "parent_description": "Your child weaves three strands over and under each other to create braids, following a pattern that requires patience and attention.", "why_it_matters": "Builds pattern recognition and sustained concentration.", "home_connection": "They may want to braid hair, yarn, or bread dough."},
  {"work_id": "pl_hand_washing", "area": "practical_life", "parent_description": "Your child learns to wash their hands completely - wetting, soaping, scrubbing, rinsing, and drying - building healthy habits through careful steps.", "why_it_matters": "Foundation for health and illness prevention.", "home_connection": "Expect them to want to wash hands thoroughly at home."},
  {"work_id": "pl_face_washing", "area": "practical_life", "parent_description": "Your child practices washing and drying their own face using a cloth and basin, building self-care skills and body awareness.", "why_it_matters": "Develops independence in daily hygiene routines.", "home_connection": "Let them wash their face alone at the bathroom sink."},
  {"work_id": "pl_teeth_brushing", "area": "practical_life", "parent_description": "Your child learns proper teeth brushing technique, taking responsibility for their dental health by brushing all surfaces thoroughly.", "why_it_matters": "Builds lifelong healthy dental habits.", "home_connection": "Let them brush independently, check their work after."},
  {"work_id": "pl_nose_blowing", "area": "practical_life", "parent_description": "Your child learns to use a tissue properly - taking it, blowing gently, and disposing of it - gaining independence in managing their own needs.", "why_it_matters": "Essential self-care skill for health and hygiene.", "home_connection": "Keep tissues accessible so they can help themselves."},
  {"work_id": "pl_coughing_sneezing", "area": "practical_life", "parent_description": "Your child learns to cover coughs and sneezes with their elbow, protecting others while developing courtesy and health awareness.", "why_it_matters": "Prevents spreading germs and shows consideration.", "home_connection": "Model this yourself and praise when they remember."},
  {"work_id": "pl_hair_brushing", "area": "practical_life", "parent_description": "Your child practices brushing or combing their own hair while looking in a mirror, building grooming skills and self-awareness.", "why_it_matters": "Develops self-care and personal pride in appearance.", "home_connection": "Provide a child-sized brush and low mirror at home."},
  {"work_id": "pl_hair_washing", "area": "practical_life", "parent_description": "Your child learns hair washing steps, first practicing on a doll before trying on their own hair, building independence in bathing.", "why_it_matters": "Advanced self-care skill toward full bathing independence.", "home_connection": "Let them practice the steps at bath time."},
  {"work_id": "pl_dressing_self", "area": "practical_life", "parent_description": "Your child practices putting on jackets, shoes, and clothing independently, using special techniques like the flip method for coats.", "why_it_matters": "Major milestone in daily independence.", "home_connection": "Allow extra time for them to dress themselves."},
  {"work_id": "pl_dusting", "area": "practical_life", "parent_description": "Your child uses a duster or cloth to clean surfaces and objects, taking responsibility for keeping the classroom environment beautiful and cared for.", "why_it_matters": "Builds ownership and respect for shared spaces.", "home_connection": "Give them a soft cloth to dust their own room."},
  {"work_id": "pl_sweeping", "area": "practical_life", "parent_description": "Your child learns to use a broom and dustpan to clean up small messes, coordinating two tools together while caring for the classroom floor.", "why_it_matters": "Teaches responsibility and multi-tool coordination.", "home_connection": "A child-sized broom makes sweeping possible at home."},
  {"work_id": "pl_mopping", "area": "practical_life", "parent_description": "Your child uses a mop to clean floors, learning to dip, wring, and push in smooth strokes while contributing to classroom cleanliness.", "why_it_matters": "Builds coordination and pride in environment care.", "home_connection": "Try a spray mop together for spills at home."},
  {"work_id": "pl_table_scrubbing", "area": "practical_life", "parent_description": "Your child works through the complete process of scrubbing a table clean - wetting, soaping, scrubbing, rinsing, and drying in careful sequence.", "why_it_matters": "Teaches thorough multi-step processes from start to finish.", "home_connection": "Let them help wipe down their table after meals."},
  {"work_id": "pl_window_washing", "area": "practical_life", "parent_description": "Your child sprays and wipes windows or mirrors until they sparkle, learning to see smudges and streaks and remove them completely.", "why_it_matters": "Develops visual attention and thoroughness.", "home_connection": "Try window washing together on an easy-to-reach window."},
  {"work_id": "pl_polishing_wood", "area": "practical_life", "parent_description": "Your child applies polish to wooden objects and buffs them until they gleam, caring for classroom materials while building focus and patience.", "why_it_matters": "Teaches care for belongings and attention to detail.", "home_connection": "Let them help polish a wooden cutting board or toy."},
  {"work_id": "pl_polishing_metal", "area": "practical_life", "parent_description": "Your child polishes brass or silver objects, watching tarnish transform into shine through careful, repeated rubbing motions.", "why_it_matters": "Shows how care and effort create visible results.", "home_connection": "A small brass item makes a satisfying home project."},
  {"work_id": "pl_polishing_glass", "area": "practical_life", "parent_description": "Your child cleans and polishes glass objects with gentle care, learning to handle fragile materials while making them sparkle.", "why_it_matters": "Builds gentleness and respect for delicate things.", "home_connection": "Let them help dry glasses after washing."},
  {"work_id": "pl_plant_care", "area": "practical_life", "parent_description": "Your child waters plants, mists leaves, and wipes dust away, learning to nurture living things and notice what they need to thrive.", "why_it_matters": "Develops responsibility and connection to nature.", "home_connection": "Give them their own plant to care for at home."},
  {"work_id": "pl_flower_arranging", "area": "practical_life", "parent_description": "Your child cuts flower stems, fills vases with water, and arranges blooms beautifully, creating something lovely for the classroom.", "why_it_matters": "Combines practical skills with artistic expression.", "home_connection": "Let them arrange flowers for the table at home."},
  {"work_id": "pl_animal_care", "area": "practical_life", "parent_description": "Your child helps feed classroom pets and keep their spaces clean, learning responsibility and gentle care for living creatures.", "why_it_matters": "Builds empathy and understanding of animals' needs.", "home_connection": "If you have pets, involve them in daily care routines."},
  {"work_id": "pl_dish_washing", "area": "practical_life", "parent_description": "Your child washes dishes in soapy water, rinses them clean, and dries them carefully, completing the full cycle of cleaning up after eating.", "why_it_matters": "Essential life skill and contribution to community.", "home_connection": "Let them wash their own plate or cup after meals."},
  {"work_id": "pl_laundry", "area": "practical_life", "parent_description": "Your child hand-washes small cloths with soap and water, scrubbing, rinsing, and wringing before hanging them to dry.", "why_it_matters": "Teaches the complete process of cleaning fabric.", "home_connection": "Let them wash small items like socks or washcloths."},
  {"work_id": "pl_folding_laundry", "area": "practical_life", "parent_description": "Your child folds different clothing items neatly - napkins, towels, shirts, and pants - building organization skills and care for belongings.", "why_it_matters": "Practical skill used daily throughout life.", "home_connection": "Let them fold their own clothes from the laundry."},
  {"work_id": "pl_greetings", "area": "practical_life", "parent_description": "Your child practices saying hello and goodbye, making eye contact, and shaking hands, building confidence in meeting and interacting with others.", "why_it_matters": "Foundation for all social interactions.", "home_connection": "Practice greetings when meeting family and friends."},
  {"work_id": "pl_introductions", "area": "practical_life", "parent_description": "Your child learns to introduce themselves by name and to introduce friends to each other, building social confidence and communication skills.", "why_it_matters": "Essential skill for making new friends.", "home_connection": "Have them introduce you to their friends."},
  {"work_id": "pl_please_thank_you", "area": "practical_life", "parent_description": "Your child practices using polite words naturally - please when asking, thank you when receiving - building habits of courtesy and gratitude.", "why_it_matters": "Basic courtesy that opens doors throughout life.", "home_connection": "Model these words consistently at home."},
  {"work_id": "pl_excuse_me", "area": "practical_life", "parent_description": "Your child learns when and how to say excuse me - after a bump, when passing by, or when needing attention - showing awareness of others.", "why_it_matters": "Shows respect and consideration for others' space.", "home_connection": "Practice this in crowded places together."},
  {"work_id": "pl_interrupting", "area": "practical_life", "parent_description": "Your child learns the polite way to get adult attention - placing a hand on your arm and waiting quietly instead of calling out.", "why_it_matters": "Teaches patience and respect for others' conversations.", "home_connection": "Practice this technique at home consistently."},
  {"work_id": "pl_offering_help", "area": "practical_life", "parent_description": "Your child learns to offer help when someone needs it and to accept help graciously, building kindness and community in the classroom.", "why_it_matters": "Develops empathy and social awareness.", "home_connection": "Notice opportunities to help others together."},
  {"work_id": "pl_apologizing", "area": "practical_life", "parent_description": "Your child learns to say sorry meaningfully when they've hurt someone's feelings or body, understanding that words help repair relationships.", "why_it_matters": "Essential skill for maintaining friendships.", "home_connection": "Model sincere apologies when you make mistakes."},
  {"work_id": "pl_table_manners", "area": "practical_life", "parent_description": "Your child practices sitting properly, using utensils correctly, and passing food politely, building the skills for pleasant shared meals.", "why_it_matters": "Makes mealtimes enjoyable for everyone.", "home_connection": "Practice these manners at family dinners."},
  {"work_id": "pl_table_setting", "area": "practical_life", "parent_description": "Your child learns to place plates, utensils, cups, and napkins in their proper positions, preparing the table for meals with care.", "why_it_matters": "Combines practical skill with contributing to the family.", "home_connection": "Let them set the table for family meals."},
  {"work_id": "pl_observing_work", "area": "practical_life", "parent_description": "Your child learns to watch someone else work without touching or talking, building patience and the ability to learn by watching.", "why_it_matters": "Important skill for learning from others.", "home_connection": "Practice quiet observation when watching someone cook or craft."},
  {"work_id": "pl_walking_around_work", "area": "practical_life", "parent_description": "Your child learns to walk around a classmate's work mat without stepping on it, showing respect for others' workspace and concentration.", "why_it_matters": "Teaches spatial awareness and respect for others.", "home_connection": "Apply this respect to siblings' play areas at home."},
  {"work_id": "pl_sharing", "area": "practical_life", "parent_description": "Your child learns to wait for a turn and share materials, understanding that patience is part of being in a community together.", "why_it_matters": "Foundation for all cooperative relationships.", "home_connection": "Practice taking turns with toys and games at home."},
  {"work_id": "pl_washing_produce", "area": "practical_life", "parent_description": "Your child washes fruits and vegetables under water, learning that food needs to be cleaned before eating while preparing for cooking.", "why_it_matters": "First step in food safety and preparation.", "home_connection": "Let them wash produce before family meals."},
  {"work_id": "pl_spreading", "area": "practical_life", "parent_description": "Your child spreads butter, jam, or cream cheese on bread or crackers, using controlled movements to cover the surface evenly.", "why_it_matters": "Practical skill they'll use every day.", "home_connection": "Let them make their own toast or crackers with spread."},
  {"work_id": "pl_peeling_easy", "area": "practical_life", "parent_description": "Your child peels bananas, oranges, and hard-boiled eggs by hand, discovering how to remove the outside to reach the food inside.", "why_it_matters": "Builds independence in feeding themselves.", "home_connection": "Serve foods they can peel themselves at snack time."},
  {"work_id": "pl_peeling_tool", "area": "practical_life", "parent_description": "Your child uses a vegetable peeler to remove the skin from carrots, cucumbers, or potatoes, learning safe tool use in the kitchen.", "why_it_matters": "Introduces safe tool use and cooking preparation.", "home_connection": "Let them help peel vegetables for dinner."},
  {"work_id": "pl_cutting_soft", "area": "practical_life", "parent_description": "Your child uses a child-safe knife to cut soft foods like bananas, cheese, and cucumbers into smaller pieces, learning knife safety.", "why_it_matters": "First step toward full cooking independence.", "home_connection": "Provide safe cutting opportunities at snack time."},
  {"work_id": "pl_cutting_hard", "area": "practical_life", "parent_description": "Your child cuts firmer foods like apples and carrots, developing stronger cutting skills and understanding that different foods need different pressure.", "why_it_matters": "Advances cooking skills and knife control.", "home_connection": "Supervise cutting practice with harder fruits and vegetables."},
  {"work_id": "pl_grating", "area": "practical_life", "parent_description": "Your child uses a grater to shred cheese or vegetables, learning to keep fingers away from the sharp surface while creating useful ingredients.", "why_it_matters": "Practical cooking skill requiring careful attention.", "home_connection": "Let them grate cheese for family pasta or pizza."},
  {"work_id": "pl_juicing", "area": "practical_life", "parent_description": "Your child presses and twists citrus fruits on a juicer to extract the juice, building hand strength while making fresh drinks.", "why_it_matters": "Combines hand strength with immediate reward.", "home_connection": "Make fresh orange juice or lemonade together."},
  {"work_id": "pl_cracking_eggs", "area": "practical_life", "parent_description": "Your child learns to crack eggs cleanly into a bowl without getting shell in the mixture, mastering a key cooking skill.", "why_it_matters": "Essential cooking skill for baking and breakfast.", "home_connection": "Let them crack eggs for scrambled eggs or baking."},
  {"work_id": "pl_making_snack", "area": "practical_life", "parent_description": "Your child combines several skills to prepare complete snacks independently - from washing to cutting to serving - building confidence in the kitchen.", "why_it_matters": "Combines skills into real independence.", "home_connection": "Let them prepare their own after-school snack."},
  {"work_id": "pl_threading_beads", "area": "practical_life", "parent_description": "Your child threads beads onto a string, developing the hand-eye coordination and finger control needed for later sewing and writing.", "why_it_matters": "Prepares hands for detailed work like sewing.", "home_connection": "Bead projects make great gifts for family."},
  {"work_id": "pl_sewing_cards", "area": "practical_life", "parent_description": "Your child laces yarn through holes in cardboard cards, learning the in-and-out motion of sewing while creating patterns.", "why_it_matters": "Direct preparation for real sewing.", "home_connection": "Sewing cards are available for home practice."},
  {"work_id": "pl_punching", "area": "practical_life", "parent_description": "Your child uses a paper punch to make holes in paper, building hand strength while preparing materials for sewing projects.", "why_it_matters": "Builds the hand strength needed for cutting and sewing.", "home_connection": "Let them punch holes for filing or crafts."},
  {"work_id": "pl_running_stitch", "area": "practical_life", "parent_description": "Your child sews simple running stitches on fabric with a blunt needle, learning the basic stitch that forms the foundation of all sewing.", "why_it_matters": "First real sewing skill they can use for repairs.", "home_connection": "Simple sewing projects build on this skill."},
  {"work_id": "pl_cross_stitch", "area": "practical_life", "parent_description": "Your child creates X-shaped stitches on special fabric, following patterns to make decorative designs through careful counting and stitching.", "why_it_matters": "Combines pattern following with handwork.", "home_connection": "Cross-stitch kits make wonderful home projects."},
  {"work_id": "pl_button_sewing", "area": "practical_life", "parent_description": "Your child learns to sew buttons onto fabric securely, gaining a practical repair skill they can use when buttons fall off their clothes.", "why_it_matters": "Practical life skill for clothing repair.", "home_connection": "Save loose buttons for practice at home."},
  {"work_id": "pl_weaving", "area": "practical_life", "parent_description": "Your child weaves strips of paper or yarn over and under in patterns, creating fabric-like designs while developing patience and pattern recognition.", "why_it_matters": "Foundation skill used in many crafts.", "home_connection": "Paper weaving is easy to try at home."}
]