[
  {"work_id": "se_cylinder_block_1", "area": "sensorial", "parent_description": "Your child fits cylinders of different widths into matching holes, developing the same three-finger grip they'll use to hold a pencil.", "why_it_matters": "Directly prepares the hand for writing.", "home_connection": "Notice how they hold crayons and pencils now."},
  {"work_id": "se_cylinder_block_2", "area": "sensorial", "parent_description": "Your child arranges cylinders that vary only in height, training their eyes to see subtle differences in how tall things are.", "why_it_matters": "Sharpens visual comparison skills.", "home_connection": "They may start noticing height differences everywhere."},
  {"work_id": "se_cylinder_block_3", "area": "sensorial", "parent_description": "Your child works with cylinders that change in both width and height together, learning to track two differences at once.", "why_it_matters": "Builds the ability to notice multiple qualities.", "home_connection": "Watch them compare objects by more than one feature."},
  {"work_id": "se_cylinder_block_4", "area": "sensorial", "parent_description": "Your child solves the puzzle of cylinders where tall ones are thin and short ones are wide - the opposite of what feels natural.", "why_it_matters": "Develops problem-solving with unexpected patterns.", "home_connection": "They're learning that patterns aren't always obvious."},
  {"work_id": "se_cylinder_blocks_combined", "area": "sensorial", "parent_description": "Your child mixes cylinders from multiple blocks and sorts them all correctly, solving a complex visual puzzle with 40 pieces.", "why_it_matters": "Challenges their visual discrimination at an advanced level.", "home_connection": "This focus transfers to sorting and organizing at home."},
  {"work_id": "se_pink_tower", "area": "sensorial", "parent_description": "Your child stacks ten pink cubes from largest to smallest, training their eyes to see subtle differences in size.", "why_it_matters": "Develops visual discrimination needed for reading letters.", "home_connection": "They may start noticing size differences everywhere."},
  {"work_id": "se_brown_stair", "area": "sensorial", "parent_description": "Your child arranges ten brown blocks from thickest to thinnest, learning to see differences in width and depth.", "why_it_matters": "Trains eyes to notice thickness - important for letters.", "home_connection": "Watch them compare thick and thin objects at home."},
  {"work_id": "se_red_rods", "area": "sensorial", "parent_description": "Your child arranges ten red rods from longest to shortest, developing understanding of length that prepares for measuring and numbers.", "why_it_matters": "Foundation for understanding measurement and the number line.", "home_connection": "Count steps together - they understand length now."},
  {"work_id": "se_knobless_cylinders", "area": "sensorial", "parent_description": "Your child works with four sets of colored cylinders without frames to guide them, using only their eyes to compare and arrange.", "why_it_matters": "Advanced visual discrimination without built-in error checking.", "home_connection": "They're learning to trust their own judgment."},
  {"work_id": "se_color_box_1", "area": "sensorial", "parent_description": "Your child matches pairs of red, yellow, and blue tablets, learning the names of primary colors while developing visual discrimination.", "why_it_matters": "Foundation for all color learning.", "home_connection": "Point out primary colors in everyday life."},
  {"work_id": "se_color_box_2", "area": "sensorial", "parent_description": "Your child matches eleven pairs of colors including pink, purple, orange, and more, expanding their color vocabulary significantly.", "why_it_matters": "Builds rich color vocabulary for art and description.", "home_connection": "Play color-finding games around your home."},
  {"work_id": "se_color_box_3", "area": "sensorial", "parent_description": "Your child arranges seven shades of each color from darkest to lightest, developing a refined eye for subtle color differences.", "why_it_matters": "Develops sophisticated color perception for art.", "home_connection": "Notice how they describe colors with more detail now."},
  {"work_id": "se_geometric_cabinet", "area": "sensorial", "parent_description": "Your child explores a cabinet with 35 geometric shapes, learning their names and how they feel while tracing the edges.", "why_it_matters": "Foundation for geometry and prepares fingers for writing.", "home_connection": "Find shapes together in buildings and nature."},
  {"work_id": "se_geometric_solids", "area": "sensorial", "parent_description": "Your child handles ten blue 3D shapes - spheres, cubes, cones, and more - learning what makes each shape unique.", "why_it_matters": "Connects flat shapes to the 3D world around them.", "home_connection": "Find matching shapes in household objects."},
  {"work_id": "se_constructive_triangles_rect", "area": "sensorial", "parent_description": "Your child discovers that triangles can combine to make rectangles and squares, seeing how shapes relate to each other.", "why_it_matters": "Foundation for understanding that shapes are related.", "home_connection": "Look for triangles within larger shapes together."},
  {"work_id": "se_constructive_triangles_tri", "area": "sensorial", "parent_description": "Your child builds different types of triangles by combining smaller triangles, exploring how triangle families work.", "why_it_matters": "Deepens understanding of triangle properties.", "home_connection": "Point out different triangle types around you."},
  {"work_id": "se_constructive_triangles_large_hex", "area": "sensorial", "parent_description": "Your child creates hexagons and other shapes from yellow triangles, discovering patterns in how shapes fit together.", "why_it_matters": "Shows connections between different geometric shapes.", "home_connection": "Notice hexagons in nature, like honeycomb."},
  {"work_id": "se_constructive_triangles_small_hex", "area": "sensorial", "parent_description": "Your child works with complex triangle combinations, discovering that different arrangements can make the same shape.", "why_it_matters": "Introduces the concept of equivalence in geometry.", "home_connection": "This understanding helps with puzzles and building."},
  {"work_id": "se_constructive_triangles_blue", "area": "sensorial", "parent_description": "Your child freely creates shapes and patterns using blue triangles, exploring creative possibilities in geometry.", "why_it_matters": "Combines geometric understanding with creativity.", "home_connection": "Try triangle crafts together at home."},
  {"work_id": "se_binomial_cube", "area": "sensorial", "parent_description": "Your child rebuilds a colorful cube puzzle where each piece has its perfect place, preparing their mind for algebra years later.", "why_it_matters": "Plants seeds for understanding algebraic formulas.", "home_connection": "They're building spatial reasoning for future math."},
  {"work_id": "se_trinomial_cube", "area": "sensorial", "parent_description": "Your child masters a complex 27-piece cube puzzle, developing advanced spatial reasoning and pattern recognition.", "why_it_matters": "Advanced preparation for algebraic thinking.", "home_connection": "Watch their persistence with challenging puzzles."},
  {"work_id": "se_superimposed_geometric_figures", "area": "sensorial", "parent_description": "Your child overlays geometric shapes to see how they relate - circles inside squares, triangles inside hexagons.", "why_it_matters": "Shows mathematical relationships between shapes.", "home_connection": "Find nested shapes in artwork and design."},
  {"work_id": "se_touch_boards", "area": "sensorial", "parent_description": "Your child feels the difference between rough and smooth surfaces with their fingertips, developing sensitivity for later writing.", "why_it_matters": "Prepares fingertips for the delicate work of writing.", "home_connection": "Feel different textures together around your home."},
  {"work_id": "se_touch_tablets", "area": "sensorial", "parent_description": "Your child matches and grades tablets by texture alone, developing such fine touch sensitivity they can do it with eyes closed.", "why_it_matters": "Refines touch discrimination to a high degree.", "home_connection": "Play touch-guessing games with household items."},
  {"work_id": "se_fabric_matching", "area": "sensorial", "parent_description": "Your child matches fabric swatches by feel, learning to distinguish silk from cotton, wool from velvet, using touch alone.", "why_it_matters": "Connects sensory learning to real-world materials.", "home_connection": "Feel different fabrics in clothing stores together."},
  {"work_id": "se_sorting_grains", "area": "sensorial", "parent_description": "Your child sorts different grains by touch with their eyes closed, developing extremely refined tactile discrimination.", "why_it_matters": "Challenges touch sensitivity with similar textures.", "home_connection": "Try sorting rice, lentils, and beans at home."},
  {"work_id": "se_baric_tablets", "area": "sensorial", "parent_description": "Your child sorts and grades wooden tablets by weight alone, learning to feel the subtle difference between heavy and light.", "why_it_matters": "Develops the often-overlooked sense of weight.", "home_connection": "Compare weights of similar-looking objects at home."},
  {"work_id": "se_thermic_tablets", "area": "sensorial", "parent_description": "Your child feels how different materials hold warmth differently - metal feels cold, felt feels warm - even at room temperature.", "why_it_matters": "Teaches that materials have different properties.", "home_connection": "Feel kitchen utensils - metal vs. wood vs. plastic."},
  {"work_id": "se_thermic_bottles", "area": "sensorial", "parent_description": "Your child matches bottles of water by temperature, developing sensitivity to actual heat differences through touch.", "why_it_matters": "Refines temperature awareness for safety and cooking.", "home_connection": "Let them test bath water temperature safely."},
  {"work_id": "se_sound_boxes", "area": "sensorial", "parent_description": "Your child shakes cylinders and matches them by sound, developing their ears to hear differences from soft to loud.", "why_it_matters": "Sharpens listening skills important for language.", "home_connection": "Listen for different sounds in your environment."},
  {"work_id": "se_bells", "area": "sensorial", "parent_description": "Your child matches musical bells by pitch and arranges them in scale order, developing a musical ear through careful listening.", "why_it_matters": "Foundation for music education and appreciation.", "home_connection": "Listen to music together and talk about high and low."},
  {"work_id": "se_smelling_bottles", "area": "sensorial", "parent_description": "Your child matches bottles by smell alone, developing their sense of smell while learning scent vocabulary.", "why_it_matters": "Refines an often-neglected sense.", "home_connection": "Smell spices, flowers, and foods together."},
  {"work_id": "se_tasting_bottles", "area": "sensorial", "parent_description": "Your child identifies sweet, sour, salty, and bitter tastes, building vocabulary for describing food and flavors.", "why_it_matters": "Develops taste vocabulary and awareness.", "home_connection": "Talk about tastes when cooking and eating together."},
  {"work_id": "se_mystery_bag", "area": "sensorial", "parent_description": "Your child reaches into a bag and identifies objects by touch alone, building the power to know things without seeing them.", "why_it_matters": "Develops mental visualization from touch.", "home_connection": "Play guessing games with household objects."},
  {"work_id": "se_sorting_objects", "area": "sensorial", "parent_description": "Your child sorts mixed objects into groups using only their sense of touch, combining all their tactile learning.", "why_it_matters": "Applies touch discrimination to practical sorting.", "home_connection": "Sort laundry or toys by feel together."}
]