{
  "version": "1.0.0",
  "generated": "2026-02-01",
  "total_lines": 96878,
  "books": [
    "absorbent_mind",
    "secret_of_childhood",
    "montessori_method",
    "own_handbook",
    "pedagogical_anthropology",
    "spontaneous_activity",
    "elementary_material"
  ],
  "topics": {
    "sensitive_periods": {
      "order": {
        "sources": [
          "absorbent_mind",
          "secret_of_childhood"
        ],
        "line_ranges": {
          "absorbent_mind": [
            [
              7419,
              7487
            ]
          ],
          "secret_of_childhood": [
            [
              2145,
              2308
            ],
            [
              2412,
              2636
            ],
            [
              9008,
              9077
            ]
          ]
        },
        "total_matches": 8,
        "key_passages": [
          {
            "source": "absorbent_mind",
            "line": 7457,
            "excerpt": "then the fundamental need for order erased everything \nelse. So this study allows us to penetrate into the mind \nof the child to a depth where psychologists generally do"
          },
          {
            "source": "secret_of_childhood",
            "line": 2275,
            "excerpt": "ORIENTATION THROUGH ORDER\n\nthe sensitive period of order shows itself in the first\nmonths of life Only nurses trained on our principles\ncan give mstances of it I can give an example of a"
          },
          {
            "source": "secret_of_childhood",
            "line": 2600,
            "excerpt": "faculty, which seems a gift of nature of orienting him-\nself, of finding his way about, im the world. In the\nsensitive period of order, nature gives the first lesson,\nin the same way as a teacher will"
          },
          {
            "source": "secret_of_childhood",
            "line": 9040,
            "excerpt": "of his eye to colours and dimensions, which guide his\nattention to garner the smallest details of his environ-\nment. Wonderful too is the sensitive period of order of\nTespect of external objects and t"
          }
        ]
      },
      "language": {
        "sources": [
          "pedagogical_anthropology",
          "own_handbook",
          "secret_of_childhood",
          "montessori_method",
          "absorbent_mind",
          "elementary_material"
        ],
        "line_ranges": {
          "absorbent_mind": [
            [
              5755,
              5831
            ],
            [
              6218,
              6283
            ],
            [
              6483,
              6657
            ],
            [
              8165,
              8229
            ]
          ],
          "secret_of_childhood": [
            [
              6073,
              6234
            ]
          ],
          "montessori_method": [
            [
              1227,
              1351
            ],
            [
              6702,
              6766
            ],
            [
              8134,
              8195
            ],
            [
              9448,
              9527
            ],
            [
              9971,
              10431
            ],
            [
              10536,
              11222
            ],
            [
              12702,
              12772
            ]
          ],
          "own_handbook": [
            [
              2737,
              2802
            ]
          ],
          "pedagogical_anthropology": [
            [
              12817,
              12934
            ]
          ],
          "elementary_material": [
            [
              219,
              292
            ],
            [
              513,
              583
            ],
            [
              4280,
              4386
            ],
            [
              7676,
              7932
            ]
          ]
        },
        "total_matches": 61,
        "key_passages": [
          {
            "source": "absorbent_mind",
            "line": 5785,
            "excerpt": "child must be placed in a position to see everything. \n\nThe absorption of language presents a more difficult \nproblem especially to nurses who themselves belong to a \nsocial environment different from"
          },
          {
            "source": "absorbent_mind",
            "line": 6251,
            "excerpt": "There comes to my mind a sort of comparison to \nthis absorption of language by the child. My idea has \nnothing to do with the various factors of the phenomenon, \nnor with reality, but it gives a pictu"
          },
          {
            "source": "absorbent_mind",
            "line": 6519,
            "excerpt": "It is clear that at birth, these two activities of the \nheard and the spoken language do not exist. What does \nexist then ? Nothing exists, yet at the same time every- \nthing is there. What exists are"
          },
          {
            "source": "secret_of_childhood",
            "line": 6203,
            "excerpt": "written language was understood by children merely\nas another way of expressing themselves, another form\nof spoken language meant in the same way to be trans-\nmitted directly from one person to anothe"
          },
          {
            "source": "secret_of_childhood",
            "line": 6105,
            "excerpt": "1s alphabetical wnting, if not the correspondence of\na sign with a sound? Language in itself 1s spoken\nJanguage , written language 1s nothing else than a really\nIiteral translation All the progress of"
          },
          {
            "source": "secret_of_childhood",
            "line": 6109,
            "excerpt": "wniting springs from this pomt of contact from which\nthe two languages can evolve im parallel. In the\nbeginning the one, the written language, falls from the\nother drop by drop, and these will later f"
          },
          {
            "source": "montessori_method",
            "line": 8164,
            "excerpt": "system of nerve centres; and human activity which is eminently social\nactivity, manifests itself through acts of the individual--manual work,\nwriting, spoken language, etc.--by means of the psychomoto"
          },
          {
            "source": "montessori_method",
            "line": 9484,
            "excerpt": "always easy and pleasant for him. Writing develops in the little child\nwith _facility_ and _spontaneity_, analogous to the development of\nspoken language--which is a motor translation of audible sound"
          },
          {
            "source": "montessori_method",
            "line": 10004,
            "excerpt": "The importance of these exercises is very complex. The child analyses,\nperfects, fixes his own spoken language,--placing an object in\ncorrespondence to every sound which he utters. The composition of "
          },
          {
            "source": "own_handbook",
            "line": 2770,
            "excerpt": "All those early acquisitions which have brought order into the child's\nmind, would be wasted were they not firmly established by means of\nwritten language and of figures. Thus established, however, th"
          },
          {
            "source": "pedagogical_anthropology",
            "line": 12855,
            "excerpt": "Now, why do we not also educate the voice for its ordinary task of the\nspoken language? Speech is one of the marvels that characterise man,\nand also one of the most difficult spontaneous creations tha"
          },
          {
            "source": "pedagogical_anthropology",
            "line": 12894,
            "excerpt": "of instruction in schools for children. I have introduced it into the\n\"Children's Houses,\" among children between the ages of four and six,\ncombining it with a special instruction in written language "
          },
          {
            "source": "elementary_material",
            "line": 7706,
            "excerpt": "reading. As one considers all of the details of this period of\ndevelopment, it is apparent that its mechanism is closely allied with\nthat of the spoken language.\n\nWhen the child's attention has been i"
          },
          {
            "source": "elementary_material",
            "line": 7715,
            "excerpt": "pronouncing it himself. We have shown that the work on the written\nlanguage in the exercises with the alphabet was _necessary_ for\ndeveloping and perfecting the spoken language. It is by so doing that"
          },
          {
            "source": "elementary_material",
            "line": 7855,
            "excerpt": "constitutes true reading. Reading aloud, on the other hand, is a\ncombination of reading and articulate expression, in other words, a\ncombination involving the two great mechanisms of the spoken langua"
          }
        ]
      },
      "movement": {
        "sources": [
          "spontaneous_activity"
        ],
        "line_ranges": {
          "spontaneous_activity": [
            [
              6170,
              6270
            ]
          ]
        },
        "total_matches": 1,
        "key_passages": [
          {
            "source": "spontaneous_activity",
            "line": 6225,
            "excerpt": "There is a perfect parallel between the formation of the will and the\ncoordination of movement of its physiological structure, the striated\nmuscles. It is evident that exercise is necessary to establi"
          }
        ]
      },
      "sensory": {
        "sources": [
          "spontaneous_activity",
          "elementary_material",
          "montessori_method"
        ],
        "line_ranges": {
          "montessori_method": [
            [
              999,
              1086
            ]
          ],
          "spontaneous_activity": [
            [
              380,
              441
            ]
          ],
          "elementary_material": [
            [
              12206,
              12268
            ],
            [
              13655,
              13718
            ]
          ]
        },
        "total_matches": 4,
        "key_passages": [
          {
            "source": "montessori_method",
            "line": 1033,
            "excerpt": "life, not essential elements of its eternal form. There is obvious\nopportunity here for profound difference of philosophic theory and\nbelief. She seems to hold, too, that sense perception forms the so"
          },
          {
            "source": "spontaneous_activity",
            "line": 411,
            "excerpt": "Non-seasonal impressions--spiritual truths\n\n  Education in sense perception strengthens imagination\n\n  Perfection in art dependent on approximation to truth"
          },
          {
            "source": "elementary_material",
            "line": 12236,
            "excerpt": "elementary exercises, only the whole tone bells corresponding to the\nwhite spaces are used. Later, the semi-tones are brought in. This first\nexercise in sense perception corresponds to the pairing pra"
          },
          {
            "source": "elementary_material",
            "line": 13687,
            "excerpt": "\"turning\" himself around to begin over again.\n\nWhen the children have reached such a stage of sensory development, they\nhave no difficulty in recognizing the tonic accents. For this purpose,\nwe have p"
          }
        ]
      },
      "small_objects": {
        "sources": [
          "spontaneous_activity",
          "own_handbook",
          "secret_of_childhood",
          "montessori_method"
        ],
        "line_ranges": {
          "secret_of_childhood": [
            [
              6686,
              6758
            ]
          ],
          "montessori_method": [
            [
              6489,
              6551
            ],
            [
              7074,
              7147
            ],
            [
              8671,
              8735
            ]
          ],
          "own_handbook": [
            [
              427,
              506
            ]
          ],
          "spontaneous_activity": [
            [
              2844,
              2929
            ],
            [
              4558,
              4648
            ],
            [
              10882,
              10959
            ]
          ]
        },
        "total_matches": 8,
        "key_passages": [
          {
            "source": "secret_of_childhood",
            "line": 6727,
            "excerpt": "was a child so incapable of keeping still that he could\nnot sit down long enough to pass his fingers over one\nof the small objects we give to the children. In many\ncases the movements of the children "
          },
          {
            "source": "montessori_method",
            "line": 6519,
            "excerpt": "It had already been noted that little ones of two or three years take\nthe greatest pleasure in arranging small objects, and this experiment in\nthe \"Children's Houses\" demonstrates the truth of this as"
          },
          {
            "source": "montessori_method",
            "line": 7114,
            "excerpt": "ways--they amuse the children who find delight in the recognition of a\nstimulus, as in the thermic exercises; for example--they may raise any\nsmall objects, toy soldiers, little balls, and, above all,"
          },
          {
            "source": "montessori_method",
            "line": 8703,
            "excerpt": "design that it may be a record. Little by little, the drawings become\nmore intelligible, and verily reveal the progress which the child makes\nin the observation of the forms about him. Often the most "
          },
          {
            "source": "own_handbook",
            "line": 463,
            "excerpt": "In the working-room there are two indispensable pieces of furniture.\nOne of these is a very long cupboard with large doors. (Fig. 1.) It is\nvery low so that a small child can set on the top of it smal"
          },
          {
            "source": "spontaneous_activity",
            "line": 2885,
            "excerpt": "can be more interesting than such experiments. By their means external\nstimuli may be determined with the greatest precision, both as regards\nquality and quantity. For instance, very small objects of "
          },
          {
            "source": "spontaneous_activity",
            "line": 4590,
            "excerpt": "known that when a new discovery is to be explained to the public, it\nis necessary to set forth the coarser details; the uninitiated cannot\ntake in those minute details which constituted the real essen"
          },
          {
            "source": "spontaneous_activity",
            "line": 10919,
            "excerpt": "What shall it profit man to discover by means of science the law of\nphysical self-preservation in its most minute details, if he has no\ncare for that which corresponds in man to the \"instinct\" of his "
          }
        ]
      }
    },
    "concentration": {
      "development": {
        "sources": [
          "spontaneous_activity",
          "own_handbook",
          "secret_of_childhood",
          "absorbent_mind",
          "elementary_material"
        ],
        "line_ranges": {
          "absorbent_mind": [
            [
              9415,
              9507
            ],
            [
              11000,
              11061
            ],
            [
              11523,
              11600
            ],
            [
              11895,
              12086
            ],
            [
              12200,
              12360
            ],
            [
              13690,
              13783
            ],
            [
              14971,
              15152
            ]
          ],
          "secret_of_childhood": [
            [
              5479,
              5711
            ],
            [
              6878,
              7157
            ]
          ],
          "own_handbook": [
            [
              787,
              849
            ]
          ],
          "spontaneous_activity": [
            [
              3412,
              3895
            ],
            [
              5002,
              5062
            ],
            [
              5252,
              5609
            ],
            [
              6955,
              7262
            ]
          ],
          "elementary_material": [
            [
              2230,
              2300
            ],
            [
              7727,
              7809
            ],
            [
              8785,
              8856
            ],
            [
              9015,
              9094
            ],
            [
              11852,
              11923
            ]
          ]
        },
        "total_matches": 61,
        "key_passages": [
          {
            "source": "absorbent_mind",
            "line": 9445,
            "excerpt": "taken with passionate interest and awakens mental \nconcentration and meditation. Forty-two years ago \nthis fact caused great surprise. Concentration had never \nbeen recognized in children of three yea"
          },
          {
            "source": "absorbent_mind",
            "line": 9446,
            "excerpt": "taken with passionate interest and awakens mental \nconcentration and meditation. Forty-two years ago \nthis fact caused great surprise. Concentration had never \nbeen recognized in children of three yea"
          },
          {
            "source": "absorbent_mind",
            "line": 9467,
            "excerpt": "groves of a table). This is what we want for success in \neducation. What any teacher requires of his pupils is \nattention and concentration on what the teacher does, \nso that they can carry out exactl"
          },
          {
            "source": "secret_of_childhood",
            "line": 5510,
            "excerpt": "led me to begin to count the number of times she re-\npeated the exercise Then I thought I would see\nhow far the strange concentration she showed could\nwithstand disturbance, and I told the teacher to "
          },
          {
            "source": "secret_of_childhood",
            "line": 5532,
            "excerpt": "age when attention flats from one thing to another and\ncannot be held down Yet she had been absorbed m\na concentration such that her ego had withdrawn itself\nfrom reach of any external stimulus That c"
          },
          {
            "source": "secret_of_childhood",
            "line": 5547,
            "excerpt": "great joy\n\nThough such instances of a concentration reachir\ninsensibihty to the outer world were not usual,\nnoticed a peculiar behaviour that was common to a!"
          },
          {
            "source": "own_handbook",
            "line": 819,
            "excerpt": "before the whole of the two ellipses or the one line is covered with\nchildren balancing themselves, and continuing to walk round, watching\ntheir feet with an expression of deep attention on their face"
          },
          {
            "source": "spontaneous_activity",
            "line": 3613,
            "excerpt": "But, on the other hand, when _the cycle is completed_, the child\ndetaches himself from his internal concentration; refreshed and\nsatisfied, he experiences the higher social impulses, such as desiring\n"
          },
          {
            "source": "spontaneous_activity",
            "line": 3787,
            "excerpt": "At this stage the completion of an entire cycle will exercise an\ninfluence more and more far-reaching on the personality of the child.\nNot only is he spurred on to a work of intimate concentration\nimm"
          },
          {
            "source": "spontaneous_activity",
            "line": 3819,
            "excerpt": "of personality it is essential that _some real task_ should be\nperformed each day; for it is from the completed cycle of an activity,\nfrom methodical concentration, that the child develops equilibrium"
          },
          {
            "source": "elementary_material",
            "line": 2260,
            "excerpt": "The _analyses_, on the other hand, are of quite different character.\n\"Analysis\" is done at the table. It is work which requires quiet and\nconcentration. While the command gives the _intuition_, the an"
          },
          {
            "source": "elementary_material",
            "line": 7768,
            "excerpt": "interpreting the meaning of the words before them, did so without\nspeaking,--reading, that is, mentally. Interpretation, in fact, is a\nquestion of mental concentration. Reading is an affair of the\n_in"
          },
          {
            "source": "elementary_material",
            "line": 8818,
            "excerpt": "accomplish. We found the drawing hour best adapted for this work. It was\nour experience that it is easier to gain a hearing when the children are\nbusy with something which does not require great conce"
          }
        ]
      },
      "obstacles": {
        "sources": [
          "absorbent_mind",
          "spontaneous_activity",
          "elementary_material",
          "montessori_method"
        ],
        "line_ranges": {
          "absorbent_mind": [
            [
              9566,
              9631
            ]
          ],
          "montessori_method": [
            [
              7230,
              7302
            ]
          ],
          "spontaneous_activity": [
            [
              5213,
              5288
            ],
            [
              8678,
              8749
            ]
          ],
          "elementary_material": [
            [
              14814,
              14877
            ]
          ]
        },
        "total_matches": 5,
        "key_passages": [
          {
            "source": "absorbent_mind",
            "line": 9601,
            "excerpt": "verbose attack of explanations on the class, whereas \nanything beyond the necessary and sufficient causes \ndistraction and confusion. My uneducated 4 teacher * \ndid exactly what she was told and, to h"
          },
          {
            "source": "montessori_method",
            "line": 7266,
            "excerpt": "slightly different game. The pieces may be mixed upon a carpet or table,\nand then put in order upon another table at some distance. As he carries\neach piece, the child must walk without letting his at"
          },
          {
            "source": "spontaneous_activity",
            "line": 8712,
            "excerpt": "of the walls and the white muslin curtains over the windows preclude\nany alleviation for the senses. The object of this depressing\nenvironment is to prevent the distraction of the scholar's attention\n"
          },
          {
            "source": "spontaneous_activity",
            "line": 5256,
            "excerpt": "is the characteristic of little children of three or four years old;\nattracted by everything they see, they pass from object to object,\nunable to concentrate on any; and generally the difficulty of fi"
          },
          {
            "source": "elementary_material",
            "line": 14844,
            "excerpt": "about him that might tend to divert him from his work.\n\n      Whether after a compulsory distraction he takes up\n      again the task that has been interrupted."
          }
        ]
      },
      "fostering": {
        "sources": [
          "spontaneous_activity"
        ],
        "line_ranges": {
          "spontaneous_activity": [
            [
              3714,
              3784
            ]
          ]
        },
        "total_matches": 1,
        "key_passages": [
          {
            "source": "spontaneous_activity",
            "line": 3754,
            "excerpt": "choice of his culminating exercise.\n\nConsequently, two successive phases of uninterrupted work are left;\none may be called the _phase of preparation_, the other the _phase of\nserious work_. The phase "
          }
        ]
      }
    },
    "normalization": {
      "process": {
        "sources": [
          "pedagogical_anthropology",
          "spontaneous_activity",
          "secret_of_childhood",
          "montessori_method",
          "absorbent_mind"
        ],
        "line_ranges": {
          "absorbent_mind": [
            [
              5236,
              5308
            ],
            [
              7039,
              7318
            ],
            [
              10858,
              10922
            ],
            [
              11360,
              11421
            ],
            [
              12360,
              12446
            ],
            [
              12819,
              12890
            ]
          ],
          "secret_of_childhood": [
            [
              6336,
              6402
            ],
            [
              6912,
              6996
            ]
          ],
          "montessori_method": [
            [
              1895,
              1962
            ],
            [
              5483,
              5560
            ],
            [
              5795,
              5855
            ]
          ],
          "pedagogical_anthropology": [
            [
              7082,
              7337
            ],
            [
              8262,
              8327
            ],
            [
              10763,
              10831
            ],
            [
              11267,
              11366
            ],
            [
              13080,
              13144
            ],
            [
              15423,
              15492
            ],
            [
              20812,
              20874
            ],
            [
              21491,
              21562
            ]
          ],
          "spontaneous_activity": [
            [
              5638,
              5703
            ]
          ]
        },
        "total_matches": 24,
        "key_passages": [
          {
            "source": "absorbent_mind",
            "line": 10892,
            "excerpt": "A SOCIAL CONTRIBUTION OF THE CHILD : \nNORMALIZATION \n\nALL the characteristics we described in the last chapter"
          },
          {
            "source": "absorbent_mind",
            "line": 11390,
            "excerpt": "represents those whom we do not help ; they are the \nsaints and geniuses of society who do not need us. \nNormalization is for the great mass of men, not for the \nvery few exceptions on either side, th"
          },
          {
            "source": "absorbent_mind",
            "line": 12394,
            "excerpt": "virtues come by themselves. One cannot teach this type \nof morality to children of three years, but experience can. \nAs normalization was not achieved by the children \nin other environments, this was "
          },
          {
            "source": "secret_of_childhood",
            "line": 6368,
            "excerpt": "of developing existing characteristics, but first of dis~\ncovering their nature , only afterwards does it become\npossible to foster normal development\n\nIf we study the first series of conditions, prod"
          },
          {
            "source": "secret_of_childhood",
            "line": 6954,
            "excerpt": "man, and leading to an infinity of deviations.\n_ The singular fact that we note im child conversions\nis a psychological cure, a return to normal condrtions.\nThe child who seems miraculous m his precoc"
          },
          {
            "source": "montessori_method",
            "line": 1927,
            "excerpt": "And when, during this same social epoch, we find that the children in\nour schoolrooms are working amid unhygienic conditions, so poorly\nadapted to normal development that even the skeleton becomes def"
          },
          {
            "source": "montessori_method",
            "line": 5513,
            "excerpt": "We must understand by _gymnastics_ and in general by muscular education\na series of exercises tending to _aid_ the normal development of\nphysiological movements (such as walking, breathing, speech), t"
          },
          {
            "source": "montessori_method",
            "line": 5825,
            "excerpt": "tongue and placing it against the dental arch, or showing him clearly\nthe movements which she herself makes when pronouncing the syllable. She\nmust seek in every way to aid the normal development of t"
          },
          {
            "source": "pedagogical_anthropology",
            "line": 7113,
            "excerpt": "predisposition! In fact, the sitting posture--or rather, that of\nstooping over the desk, to write--and the prolonged confinement in\na closed environment, impede the normal development of the thorax\nan"
          },
          {
            "source": "pedagogical_anthropology",
            "line": 7247,
            "excerpt": "from it; but rather to some acute illness occurring in early childhood\n(pneumonia, etc.), after which the child ceased to progress in\naccordance with his former obviously normal development.\n\n_Anangio"
          },
          {
            "source": "pedagogical_anthropology",
            "line": 7300,
            "excerpt": "close sympathy with the entire group of formative glands: so much so\nthat, if the glands of internal secretion are injured, the genital\nglands usually fail to attain normal development (infantilism). "
          },
          {
            "source": "spontaneous_activity",
            "line": 5673,
            "excerpt": "When a living being is in process of evolution, it is essential to\nprovide for the special requirements of the moment, in order to ensure\nits normal development. The foetus must be nourished with bloo"
          }
        ]
      },
      "characteristics": {
        "sources": [
          "absorbent_mind",
          "own_handbook",
          "secret_of_childhood",
          "montessori_method"
        ],
        "line_ranges": {
          "absorbent_mind": [
            [
              10922,
              10989
            ],
            [
              12384,
              12470
            ]
          ],
          "secret_of_childhood": [
            [
              75,
              153
            ]
          ],
          "montessori_method": [
            [
              10664,
              10743
            ]
          ],
          "own_handbook": [
            [
              2785,
              2848
            ]
          ]
        },
        "total_matches": 5,
        "key_passages": [
          {
            "source": "absorbent_mind",
            "line": 10952,
            "excerpt": "them calm serenity and joy, and then something else \nappeared that had never yet appeared in a group of \nchildren : a spontaneous discipline. This struck people \neven more than the explosion into writ"
          },
          {
            "source": "absorbent_mind",
            "line": 12431,
            "excerpt": "could not be given by the teacher. Generally if a teacher \ninterferes, she has an idea quite different from that of \nthe children and disturbs the social harmony of the \nclass. If there is such a prob"
          },
          {
            "source": "secret_of_childhood",
            "line": 108,
            "excerpt": "They Refused Sweets\nTheir Sense of Digmty\nSpontaneous Discipline\n“T’ve written ! I’ve written !”\nReading Came Later"
          },
          {
            "source": "montessori_method",
            "line": 10706,
            "excerpt": "order, while the silence is only interrupted by the sound of little feet\nrunning lightly, and by the voices of the children who sing. This is an\nunexpected revelation of the perfection of spontaneous "
          },
          {
            "source": "own_handbook",
            "line": 2815,
            "excerpt": "The results obtained are surprising, for the children have shown a\nlove of work which no one suspected to be in them, and a calm and an\norderliness in their movements which, surpassing the limits of\nc"
          }
        ]
      },
      "deviations": {
        "sources": [
          "pedagogical_anthropology",
          "spontaneous_activity",
          "secret_of_childhood",
          "montessori_method",
          "absorbent_mind"
        ],
        "line_ranges": {
          "absorbent_mind": [
            [
              4581,
              4770
            ],
            [
              5215,
              5420
            ],
            [
              7039,
              7318
            ],
            [
              8562,
              8692
            ],
            [
              9224,
              9309
            ],
            [
              10527,
              10711
            ],
            [
              11566,
              11629
            ],
            [
              11984,
              12054
            ],
            [
              13203,
              13278
            ],
            [
              13471,
              13542
            ]
          ],
          "secret_of_childhood": [
            [
              88,
              153
            ],
            [
              270,
              351
            ],
            [
              1971,
              2032
            ],
            [
              2636,
              2701
            ],
            [
              4779,
              4843
            ],
            [
              6607,
              6698
            ],
            [
              6799,
              7704
            ],
            [
              7827,
              8568
            ],
            [
              8925,
              8997
            ],
            [
              9654,
              9794
            ],
            [
              10136,
              10205
            ]
          ],
          "montessori_method": [
            [
              2240,
              2301
            ],
            [
              2567,
              2651
            ],
            [
              4097,
              4159
            ],
            [
              4824,
              4884
            ],
            [
              5485,
              5560
            ],
            [
              8897,
              9217
            ]
          ],
          "pedagogical_anthropology": [
            [
              176,
              237
            ],
            [
              514,
              662
            ],
            [
              859,
              1236
            ],
            [
              1573,
              1650
            ],
            [
              1790,
              1924
            ],
            [
              3053,
              3178
            ],
            [
              3454,
              3608
            ],
            [
              4048,
              4322
            ],
            [
              4674,
              4740
            ],
            [
              5253,
              5340
            ],
            [
              6495,
              6558
            ],
            [
              6714,
              7080
            ],
            [
              7270,
              7545
            ],
            [
              8669,
              8911
            ],
            [
              9105,
              9265
            ],
            [
              9668,
              9861
            ],
            [
              10737,
              10806
            ],
            [
              11989,
              12221
            ],
            [
              12561,
              12627
            ],
            [
              13370,
              13508
            ],
            [
              13739,
              13868
            ],
            [
              14045,
              14109
            ],
            [
              14235,
              14307
            ],
            [
              14622,
              14791
            ],
            [
              15110,
              15534
            ],
            [
              15870,
              15957
            ],
            [
              16456,
              16525
            ],
            [
              17056,
              17173
            ],
            [
              18002,
              18245
            ],
            [
              18936,
              19019
            ],
            [
              20084,
              20360
            ],
            [
              20464,
              20535
            ],
            [
              20751,
              20825
            ],
            [
              21103,
              21289
            ],
            [
              22938,
              23002
            ],
            [
              23116,
              23192
            ],
            [
              23719,
              23829
            ]
          ],
          "spontaneous_activity": [
            [
              3604,
              3678
            ],
            [
              7242,
              7319
            ],
            [
              9075,
              9148
            ],
            [
              10251,
              10317
            ],
            [
              10846,
              10972
            ]
          ]
        },
        "total_matches": 190,
        "key_passages": [
          {
            "source": "absorbent_mind",
            "line": 8600,
            "excerpt": "He must carry them out completely. There is a vital \nurge to carry out certain things, and if the cycle of this \nurge is broken, the result is deviation and lack of purpose. \nThe possibility of carryi"
          },
          {
            "source": "absorbent_mind",
            "line": 8640,
            "excerpt": "cognized that such * help f , which is an interruption of the \nchild's own chosen cycle of activity, is one of the greatest \nrepressions of this age. The deviations of many * diffi- \ncult ' children a"
          },
          {
            "source": "absorbent_mind",
            "line": 10675,
            "excerpt": "of them show strange characteristics, but they are \ncurable. We can briefly consider the familiar types \nof these deviations. \n\nAll these manifestations which are faulty and not"
          },
          {
            "source": "secret_of_childhood",
            "line": 119,
            "excerpt": "TRUE NORMALITY\n\nIV PSYCHIC DEVIATIONS\n\nTHEIR SINGLE CAUSE"
          },
          {
            "source": "secret_of_childhood",
            "line": 2002,
            "excerpt": "development This 1s not an imaginary picture, but\na very present reality. Small causes near the beginn-\nings of Ife may lead to grave deviation , man grows\nand matures under a typical aspect other tha"
          },
          {
            "source": "secret_of_childhood",
            "line": 4811,
            "excerpt": "DISCOVERY OF THE TRUE CHILD\n\nits life, all the fits of temper, struggles, deviations,\ngive no idea of a personality They are merely a sur\nof characteristics. But there must be a personalty"
          },
          {
            "source": "montessori_method",
            "line": 4854,
            "excerpt": "lies the first task of the educator. In such a delicate task, a great\nart must suggest the moment, and limit the intervention, in order that\nwe shall arouse no perturbation, cause no deviation, but ra"
          },
          {
            "source": "montessori_method",
            "line": 8943,
            "excerpt": "their paper, but with some the vertical descends to the right of the\npoint and with others, to the left, to say nothing of those whose hand\ndiverges in all directions. To arrest these various deviatio"
          },
          {
            "source": "montessori_method",
            "line": 8949,
            "excerpt": "child is to join by means of a parallel line half way between the two\nenclosing lines. If these two lines are not enough, I place two rulers\nvertically upon the paper, which arrest the deviations of t"
          },
          {
            "source": "pedagogical_anthropology",
            "line": 568,
            "excerpt": "types. Thus, since the principles of the Lombrosian doctrine spread\nwith a precocious rapidity, it is a matter of common knowledge that\ncriminals present anomalies of form, or rather morphological dev"
          },
          {
            "source": "pedagogical_anthropology",
            "line": 1832,
            "excerpt": "that pays more attention to the man himself than to his environment;\nstriving to perfect him in his physiological functions, or to correct\nany tendency to abnormal and pathological deviations.\n\nIt fol"
          },
          {
            "source": "pedagogical_anthropology",
            "line": 3086,
            "excerpt": "reproduction that the original relations of germs may be altered by\nexternal causes, and the dominant characteristics be made recessive.[6]\nMany deviations are attributable to the influences that act "
          },
          {
            "source": "spontaneous_activity",
            "line": 10877,
            "excerpt": "limits, and the closer we can get to this, the more possible does it\nbecome to have an absolute means of comparison for the consideration\nof deviations. The great artist is thus able to recognize the\n"
          },
          {
            "source": "spontaneous_activity",
            "line": 10940,
            "excerpt": "sense, till it can recognize and at last enjoy \"good,\" up to the very\nlimits of the absolute, and also until it becomes sensitive to the\nvery slightest deviations towards evil. He who feels thus is \"s"
          },
          {
            "source": "spontaneous_activity",
            "line": 3640,
            "excerpt": "her, and making them rest, etc., their restlessness persists, and the\nsubsequent work is not undertaken. The children do not become calm:\nthey remain in an abnormal state. In other words, if they are\n"
          }
        ]
      }
    },
    "discipline": {
      "natural_discipline": {
        "sources": [
          "absorbent_mind",
          "pedagogical_anthropology",
          "secret_of_childhood",
          "montessori_method"
        ],
        "line_ranges": {
          "absorbent_mind": [
            [
              10922,
              10989
            ]
          ],
          "secret_of_childhood": [
            [
              75,
              153
            ],
            [
              5963,
              6046
            ]
          ],
          "montessori_method": [
            [
              10664,
              10743
            ],
            [
              12009,
              12127
            ],
            [
              12238,
              12305
            ]
          ],
          "pedagogical_anthropology": [
            [
              4189,
              4265
            ]
          ]
        },
        "total_matches": 9,
        "key_passages": [
          {
            "source": "absorbent_mind",
            "line": 10952,
            "excerpt": "them calm serenity and joy, and then something else \nappeared that had never yet appeared in a group of \nchildren : a spontaneous discipline. This struck people \neven more than the explosion into writ"
          },
          {
            "source": "secret_of_childhood",
            "line": 6002,
            "excerpt": "dren, “And the stars have given hight m their watches\nand rejoiced they were fullness they have shined forth\nto bim that made them” A natural discipline of this\nkind seems to transcend its ummediate e"
          },
          {
            "source": "secret_of_childhood",
            "line": 6014,
            "excerpt": "way of disciphne they have not known” One has the\nimpression that this natural discipline must provide the\nfoundation for all other forms of discipline determmed\n—like that of social hfe, for stance—b"
          },
          {
            "source": "secret_of_childhood",
            "line": 108,
            "excerpt": "They Refused Sweets\nTheir Sense of Digmty\nSpontaneous Discipline\n“T’ve written ! I’ve written !”\nReading Came Later"
          },
          {
            "source": "montessori_method",
            "line": 12044,
            "excerpt": "effort to establish discipline, we must rigorously apply the principles\nof the method. It is not to be obtained by words; no man learns\nself-discipline \"through hearing another man speak.\" The phenome"
          },
          {
            "source": "montessori_method",
            "line": 12092,
            "excerpt": "command, \"Be quiet! Be still!\" It is not astonishing but very natural\nthat the child by means of such exercises should acquire\nself-discipline, so far as regards the lack of muscular discipline\nnatura"
          },
          {
            "source": "montessori_method",
            "line": 12270,
            "excerpt": "attained this stage, of repeating an exercise, he is on the way to\nself-development, and the external sign of this condition is his\nself-discipline.\n\nThis phenomenon does not always occur. The same ex"
          },
          {
            "source": "pedagogical_anthropology",
            "line": 4230,
            "excerpt": "is ideally normal, no one who is not abnormal in _some one thing_, it\nfollows that this \"some one thing\" must be corrected by the humbling\npractice of self-discipline. At the same time it is rare for "
          }
        ]
      },
      "freedom_limits": {
        "sources": [
          "pedagogical_anthropology",
          "own_handbook",
          "spontaneous_activity",
          "secret_of_childhood",
          "montessori_method",
          "absorbent_mind",
          "elementary_material"
        ],
        "line_ranges": {
          "absorbent_mind": [
            [
              49,
              110
            ],
            [
              3554,
              3626
            ],
            [
              4876,
              4953
            ],
            [
              5085,
              5345
            ],
            [
              6517,
              6587
            ],
            [
              7039,
              7163
            ],
            [
              9322,
              9507
            ],
            [
              9742,
              9802
            ],
            [
              10003,
              10076
            ],
            [
              10196,
              10285
            ],
            [
              10548,
              10619
            ],
            [
              10924,
              11157
            ],
            [
              11821,
              11895
            ],
            [
              12208,
              12446
            ],
            [
              12572,
              12755
            ],
            [
              13686,
              14054
            ],
            [
              14342,
              14408
            ],
            [
              15352,
              15443
            ],
            [
              15854,
              15938
            ]
          ],
          "secret_of_childhood": [
            [
              235,
              300
            ],
            [
              733,
              799
            ],
            [
              2204,
              2271
            ],
            [
              3397,
              3469
            ],
            [
              4319,
              4386
            ],
            [
              5922,
              6073
            ],
            [
              6345,
              6449
            ],
            [
              7090,
              7165
            ],
            [
              7862,
              7942
            ],
            [
              8281,
              8446
            ],
            [
              9610,
              9695
            ]
          ],
          "montessori_method": [
            [
              186,
              339
            ],
            [
              672,
              739
            ],
            [
              866,
              1159
            ],
            [
              1316,
              1387
            ],
            [
              1782,
              2263
            ],
            [
              3124,
              3189
            ],
            [
              3313,
              3389
            ],
            [
              3784,
              4028
            ],
            [
              4216,
              4715
            ],
            [
              4968,
              5047
            ],
            [
              6025,
              6093
            ],
            [
              6246,
              6320
            ],
            [
              7680,
              7752
            ],
            [
              8319,
              8428
            ],
            [
              9162,
              9226
            ],
            [
              10028,
              10120
            ],
            [
              10707,
              10788
            ],
            [
              11767,
              11933
            ],
            [
              12055,
              12271
            ],
            [
              12570,
              12742
            ]
          ],
          "own_handbook": [
            [
              136,
              326
            ],
            [
              1887,
              2026
            ],
            [
              2201,
              2283
            ],
            [
              2652,
              2982
            ]
          ],
          "pedagogical_anthropology": [
            [
              151,
              556
            ],
            [
              728,
              815
            ],
            [
              935,
              1011
            ],
            [
              1236,
              2112
            ],
            [
              3126,
              3232
            ],
            [
              3471,
              3778
            ],
            [
              4241,
              4303
            ],
            [
              4561,
              4948
            ],
            [
              5285,
              5700
            ],
            [
              6400,
              6635
            ],
            [
              6873,
              7173
            ],
            [
              7545,
              7703
            ],
            [
              8338,
              8522
            ],
            [
              9163,
              9480
            ],
            [
              9615,
              9861
            ],
            [
              9983,
              10087
            ],
            [
              10200,
              10285
            ],
            [
              10634,
              10782
            ],
            [
              11169,
              11627
            ],
            [
              11752,
              11823
            ],
            [
              12634,
              12695
            ],
            [
              13571,
              13634
            ],
            [
              14213,
              14309
            ],
            [
              15110,
              15181
            ],
            [
              15631,
              15930
            ],
            [
              17797,
              17873
            ],
            [
              19021,
              19094
            ],
            [
              19820,
              19989
            ],
            [
              20721,
              20784
            ],
            [
              21398,
              21521
            ],
            [
              23217,
              23444
            ],
            [
              23714,
              23778
            ]
          ],
          "spontaneous_activity": [
            [
              50,
              122
            ],
            [
              239,
              301
            ],
            [
              544,
              884
            ],
            [
              1108,
              1288
            ],
            [
              1579,
              1908
            ],
            [
              2547,
              2879
            ],
            [
              3252,
              3321
            ],
            [
              3494,
              3574
            ],
            [
              3866,
              3927
            ],
            [
              4047,
              4114
            ],
            [
              4410,
              4514
            ],
            [
              4725,
              5502
            ],
            [
              5613,
              6112
            ],
            [
              6365,
              6543
            ],
            [
              6926,
              7203
            ],
            [
              7929,
              8090
            ],
            [
              8215,
              8309
            ],
            [
              8524,
              8644
            ],
            [
              9649,
              9725
            ],
            [
              10205,
              10284
            ],
            [
              10602,
              11134
            ],
            [
              11290,
              11358
            ]
          ],
          "elementary_material": [
            [
              402,
              463
            ],
            [
              877,
              955
            ],
            [
              1741,
              1806
            ],
            [
              2282,
              2355
            ],
            [
              5183,
              5245
            ],
            [
              6756,
              6825
            ],
            [
              6947,
              7009
            ],
            [
              7293,
              7353
            ],
            [
              10651,
              10918
            ],
            [
              11838,
              12025
            ],
            [
              12816,
              12883
            ],
            [
              14998,
              15061
            ],
            [
              15956,
              16021
            ]
          ]
        },
        "total_matches": 412,
        "key_passages": [
          {
            "source": "absorbent_mind",
            "line": 3589,
            "excerpt": "choice and that they struggle with others to have the \nupper hand. If we look more closely, we see that their \nfreedom is merely to carry out what is in the behaviour \nof each and each one moves accor"
          },
          {
            "source": "absorbent_mind",
            "line": 4919,
            "excerpt": "pendence. Really, it is nature that is giving to the child \nthe opportunity of growing, gives him independence and \nat the same time leads him to freedom. \n\nThe ' conquest of walking ' is very importa"
          },
          {
            "source": "absorbent_mind",
            "line": 5117,
            "excerpt": "This is not an opinion. These are clear natural facts, \nthey are observed facts. When we say that we must \nrender the freedom of the child complete, when we say \nthat his independence and his normal f"
          },
          {
            "source": "secret_of_childhood",
            "line": 769,
            "excerpt": "absence of fixed and determined guiding instincts such\nas are possessed by the animals, 1s the sign of a fund\nof freedom of action, demanding a special elaboration,\nalmost as though it had to be creat"
          },
          {
            "source": "secret_of_childhood",
            "line": 2237,
            "excerpt": "over, in order to reveal such tendencies, children must\nhave freedom\n\nA considerable public was able to observe such"
          },
          {
            "source": "secret_of_childhood",
            "line": 3429,
            "excerpt": "more restrictive and to leave less and less room for the\n\nfreedom of the child Around the child there are only\nPrisons and emptiness :"
          },
          {
            "source": "montessori_method",
            "line": 953,
            "excerpt": "doubt the inevitable restraint of group teaching is a negligible factor,\nthe fatiguing effects of which any good kindergartner can forestall. But\nfor younger children a regime of complete freedom woul"
          },
          {
            "source": "montessori_method",
            "line": 1071,
            "excerpt": "child's membership in the family community and of the right of elders to\ncommand, but practically it remains true that the common conditions of\nfamily life prohibit any such freedom as is exercised in"
          },
          {
            "source": "montessori_method",
            "line": 1083,
            "excerpt": "through it under compulsion or on interest induced by the teacher? Or to\nput it another way: May not the work be so much less important than the\nchild's freedom that we had better trust to native curi"
          },
          {
            "source": "own_handbook",
            "line": 168,
            "excerpt": "SENSORY EDUCATION                                                  29\n LANGUAGE AND KNOWLEDGE OF THE WORLD                                69\n FREEDOM                                                   "
          },
          {
            "source": "own_handbook",
            "line": 1921,
            "excerpt": "FREEDOM"
          },
          {
            "source": "own_handbook",
            "line": 2916,
            "excerpt": "developed in the child.\n\nFreedom without organization of work would be useless. The child left\n_free_ without means of work would go to waste, just as a new-born\nbaby, if _left free_ without nourishme"
          },
          {
            "source": "pedagogical_anthropology",
            "line": 765,
            "excerpt": "Lombrosian doctrines confront us squarely with the philosophic\nquestion of liberty of action, the controverted question of Stuart\nMill, namely that of \"free will.\" The libertarians admit the freedom\no"
          },
          {
            "source": "pedagogical_anthropology",
            "line": 7137,
            "excerpt": "shown that the son of a tuberculous woman, if entrusted to a wet-nurse\nin the _open country_, and brought up on an abundance of nourishing\nfood until his sixth year in the freedom of the fields, can b"
          },
          {
            "source": "pedagogical_anthropology",
            "line": 19866,
            "excerpt": "_rebellion_ against our own mistakes in educating him. The coercive\n  means which we adopt toward children are what destroy their natural\n  tranquility. A healthy child, in his moments of freedom, suc"
          },
          {
            "source": "spontaneous_activity",
            "line": 270,
            "excerpt": "Free movement.\n\n  Misconceptions of physical freedom\n\n  Action without an aim fatigues"
          },
          {
            "source": "spontaneous_activity",
            "line": 688,
            "excerpt": "to the development of character, intelligence and feeling?--one single\nproblem will present itself as the basis of all education: How are we\nto give the child freedom?\n\nIn according this freedom we mu"
          },
          {
            "source": "spontaneous_activity",
            "line": 690,
            "excerpt": "to give the child freedom?\n\nIn according this freedom we must take account of principles analogous\nto those laid down by science for the forms and functions of the body\nduring its period of growth; it"
          },
          {
            "source": "elementary_material",
            "line": 432,
            "excerpt": "The children working at their various occupations in complete\n     freedom                                                        115\n\n  Interpreted reading: \"Smile and clap your hands\"               "
          },
          {
            "source": "elementary_material",
            "line": 2325,
            "excerpt": "\"make live.\" This will show still more clearly how far from truth is the\nmodern conception of pedagogy which attempts to realize its desire for\nfreedom in the school by saying to the teacher, \"Try to "
          },
          {
            "source": "elementary_material",
            "line": 5214,
            "excerpt": "[Illustration: The children are permitted to work at their various\noccupations in complete freedom. (_The Lenox School, Montessori\nElementary Class, New York._)]"
          }
        ]
      },
      "obedience": {
        "sources": [
          "pedagogical_anthropology",
          "own_handbook",
          "spontaneous_activity",
          "secret_of_childhood",
          "montessori_method",
          "absorbent_mind",
          "elementary_material"
        ],
        "line_ranges": {
          "absorbent_mind": [
            [
              136,
              1451
            ],
            [
              1646,
              2027
            ],
            [
              2230,
              2527
            ],
            [
              2866,
              3091
            ],
            [
              3208,
              3380
            ],
            [
              3524,
              3736
            ],
            [
              3854,
              4499
            ],
            [
              4629,
              5140
            ],
            [
              5295,
              5368
            ],
            [
              5535,
              5879
            ],
            [
              5999,
              6132
            ],
            [
              6239,
              7136
            ],
            [
              7240,
              7509
            ],
            [
              7618,
              7911
            ],
            [
              8044,
              8830
            ],
            [
              8949,
              9095
            ],
            [
              9318,
              9381
            ],
            [
              9595,
              10254
            ],
            [
              10509,
              11023
            ],
            [
              11177,
              11488
            ],
            [
              11639,
              12404
            ],
            [
              12572,
              12873
            ],
            [
              13110,
              13319
            ],
            [
              13497,
              13651
            ],
            [
              13794,
              13935
            ],
            [
              14112,
              15478
            ],
            [
              15678,
              16123
            ]
          ],
          "secret_of_childhood": [
            [
              351,
              1150
            ],
            [
              1317,
              1934
            ],
            [
              2063,
              2136
            ],
            [
              2259,
              2400
            ],
            [
              2529,
              2941
            ],
            [
              3255,
              5437
            ],
            [
              5828,
              5922
            ],
            [
              6073,
              6152
            ],
            [
              6288,
              6525
            ],
            [
              6658,
              6735
            ],
            [
              6896,
              6979
            ],
            [
              7090,
              7451
            ],
            [
              7600,
              7960
            ],
            [
              8066,
              8299
            ],
            [
              8409,
              8563
            ],
            [
              8753,
              9199
            ],
            [
              9344,
              9580
            ],
            [
              9719,
              9788
            ],
            [
              9934,
              10308
            ]
          ],
          "montessori_method": [
            [
              1,
              38
            ],
            [
              571,
              831
            ],
            [
              959,
              2301
            ],
            [
              2423,
              2794
            ],
            [
              2988,
              3416
            ],
            [
              3577,
              5131
            ],
            [
              5305,
              5369
            ],
            [
              5471,
              5802
            ],
            [
              6163,
              6254
            ],
            [
              6391,
              6730
            ],
            [
              6908,
              7017
            ],
            [
              7171,
              9199
            ],
            [
              9470,
              10244
            ],
            [
              10378,
              10998
            ],
            [
              11139,
              11455
            ],
            [
              11781,
              13135
            ]
          ],
          "own_handbook": [
            [
              1,
              759
            ],
            [
              883,
              1382
            ],
            [
              1484,
              1622
            ],
            [
              1814,
              3318
            ]
          ],
          "pedagogical_anthropology": [
            [
              1,
              162
            ],
            [
              599,
              2073
            ],
            [
              2259,
              2865
            ],
            [
              3040,
              3800
            ],
            [
              3941,
              4294
            ],
            [
              4479,
              5053
            ],
            [
              5184,
              5641
            ],
            [
              5927,
              5990
            ],
            [
              6471,
              6647
            ],
            [
              6991,
              7107
            ],
            [
              7344,
              7408
            ],
            [
              7752,
              7819
            ],
            [
              7994,
              8152
            ],
            [
              8351,
              8578
            ],
            [
              8697,
              9201
            ],
            [
              9615,
              9798
            ],
            [
              9930,
              10160
            ],
            [
              10432,
              10548
            ],
            [
              11119,
              11182
            ],
            [
              11283,
              11561
            ],
            [
              11764,
              11970
            ],
            [
              12140,
              12226
            ],
            [
              12463,
              12531
            ],
            [
              12751,
              13092
            ],
            [
              13274,
              13723
            ],
            [
              13890,
              13958
            ],
            [
              14632,
              14766
            ],
            [
              14963,
              15435
            ],
            [
              15691,
              16875
            ],
            [
              17047,
              17128
            ],
            [
              17303,
              17655
            ],
            [
              17760,
              18114
            ],
            [
              18307,
              18393
            ],
            [
              18521,
              19084
            ],
            [
              19242,
              19560
            ],
            [
              19736,
              19991
            ],
            [
              20198,
              20861
            ],
            [
              21059,
              21519
            ],
            [
              23884,
              24215
            ]
          ],
          "spontaneous_activity": [
            [
              1,
              402
            ],
            [
              529,
              2630
            ],
            [
              2743,
              3978
            ],
            [
              4103,
              9267
            ],
            [
              9373,
              11720
            ]
          ],
          "elementary_material": [
            [
              1,
              154
            ],
            [
              583,
              804
            ],
            [
              957,
              1483
            ],
            [
              2045,
              2833
            ],
            [
              2950,
              3066
            ],
            [
              3282,
              3359
            ],
            [
              3498,
              3568
            ],
            [
              3692,
              3766
            ],
            [
              4311,
              4823
            ],
            [
              4962,
              5530
            ],
            [
              5748,
              6119
            ],
            [
              6283,
              6385
            ],
            [
              6538,
              6598
            ],
            [
              6715,
              6945
            ],
            [
              7048,
              7452
            ],
            [
              7691,
              7981
            ],
            [
              8121,
              8187
            ],
            [
              8479,
              8545
            ],
            [
              8736,
              9737
            ],
            [
              9883,
              10969
            ],
            [
              11201,
              11417
            ],
            [
              11605,
              11678
            ],
            [
              11992,
              12070
            ],
            [
              12283,
              12372
            ],
            [
              12512,
              12590
            ],
            [
              12694,
              12816
            ],
            [
              12951,
              13189
            ],
            [
              13300,
              13643
            ],
            [
              13816,
              13880
            ],
            [
              14046,
              14145
            ],
            [
              14420,
              14582
            ],
            [
              14837,
              14916
            ],
            [
              15046,
              15150
            ],
            [
              15330,
              16089
            ],
            [
              16208,
              17482
            ]
          ]
        },
        "total_matches": 2115,
        "key_passages": [
          {
            "source": "absorbent_mind",
            "line": 174,
            "excerpt": "Error and its Control \n\nThe Three Degrees of Obedience \n\nThe Montessori Teacher"
          },
          {
            "source": "absorbent_mind",
            "line": 2330,
            "excerpt": "the body by means of the nervous system, are as nothing. \nAnd if one studies the best organised army, one will never \nfind the obedience that the muscles have, which carry out \nthe commands of one str"
          },
          {
            "source": "absorbent_mind",
            "line": 8233,
            "excerpt": "environment) he cannot use his hands, his character \nremains on a very low level, incapable of obedience, of \ninitiative, lazy and sad, whereas the child who has been \nable to work with his hands show"
          },
          {
            "source": "secret_of_childhood",
            "line": 670,
            "excerpt": "and tissues The germ-cell, therefore, simple, trans-\nparent and devoid of any matenal design, works and\nbuilds in exact obedience to the immaterial order it\n\n20"
          },
          {
            "source": "secret_of_childhood",
            "line": 4260,
            "excerpt": "eagemess to see the fountain, but, though she stretch-\ned out her arm to the tap, at the last moment her hand\ndrew back without tummng it The sense of obedience\nto an order from the absent nurse was s"
          },
          {
            "source": "secret_of_childhood",
            "line": 4610,
            "excerpt": "vanish and the grown-up hve and work in him instead\nThe incident of the child who had put the dirty shoes\non the bed-cover shows an obedience carried to the\npoint of suggestion What the grown-up tells"
          },
          {
            "source": "montessori_method",
            "line": 603,
            "excerpt": "through the exercise of attention, of comparison, of judgment  360\n\n    Obedience is naturally sacrifice                               363\n\n    Obedience develops will-power and the capacity to perfor"
          },
          {
            "source": "montessori_method",
            "line": 605,
            "excerpt": "Obedience is naturally sacrifice                               363\n\n    Obedience develops will-power and the capacity to perform the\n    act it becomes necessary to obey                              "
          },
          {
            "source": "montessori_method",
            "line": 12013,
            "excerpt": "of the phenomenon of conversion, of the superhuman heightening of the\nstrength of martyrs and apostles, of the constancy of missionaries, of\nthe obedience of monks. Nothing else in the world, except s"
          },
          {
            "source": "own_handbook",
            "line": 2818,
            "excerpt": "orderliness in their movements which, surpassing the limits of\ncorrectness have entered into those of \"grace.\" The spontaneous\ndiscipline, and the obedience which is seen in the whole class,\nconstitut"
          },
          {
            "source": "own_handbook",
            "line": 8,
            "excerpt": "of the Project Gutenberg License included with this ebook or online\nat www.gutenberg.org. If you are not located in the United States,\nyou will have to check the laws of the country where you are loca"
          },
          {
            "source": "own_handbook",
            "line": 138,
            "excerpt": "Helen, clasp to your heart these little children, since they, above\nall others, will understand you. They are your younger brothers: when,\nwith bandaged eyes and in silence, they touch with their litt"
          },
          {
            "source": "pedagogical_anthropology",
            "line": 2636,
            "excerpt": "with the original progenitors will continue to be formed, through\nsuccessive disjunction of the hybrids; the sexual phenomenon operating\nin obedience to the laws of probability.\n\nAn effective experime"
          },
          {
            "source": "pedagogical_anthropology",
            "line": 12501,
            "excerpt": "which the wrinkles of the forehead form themselves in parallel lines.\nThe eyes in consequence are stretched to their widest. The oral zone is\nso far relaxed that the lower jaw droops in obedience to g"
          },
          {
            "source": "pedagogical_anthropology",
            "line": 13666,
            "excerpt": "of support (not of protection). The bones are covered with masses\nof striped muscles, which have as their special function voluntary\nmovement, that is to say, obedience to the brain.\n\nThe upper and lo"
          },
          {
            "source": "spontaneous_activity",
            "line": 248,
            "excerpt": "Conduct\n\n  Obedience"
          },
          {
            "source": "spontaneous_activity",
            "line": 2780,
            "excerpt": "the intelligence and develops qualities we consider lofty, and which\nwe supposed were foreign to the nature of the young child, such as\npatience and perseverance in work, and in the moral order, obedi"
          },
          {
            "source": "spontaneous_activity",
            "line": 3793,
            "excerpt": "degree of evolution. This is the period when the child begins to be\n\"master of himself\" and enters upon that characteristic phenomenon I\nhave called the \"phenomenon of obedience.\" He _can obey_, that "
          },
          {
            "source": "elementary_material",
            "line": 7297,
            "excerpt": "more!\n\n      --Silence, obedience, and everybody at work!\n\n      --Enough said; I know exactly what the matter is!"
          },
          {
            "source": "elementary_material",
            "line": 12993,
            "excerpt": "The child comes to be \"possessed\" by the music. He obeys the musical\ncommand with his whole body and becomes more and more perfect in this\nobedience shown by his muscles.\n\nHere is a pretty story which"
          },
          {
            "source": "elementary_material",
            "line": 14868,
            "excerpt": "OBEDIENCE.\n\n      NOTE:"
          }
        ]
      }
    },
    "teacher_role": {
      "observation": {
        "sources": [
          "pedagogical_anthropology",
          "own_handbook",
          "spontaneous_activity",
          "secret_of_childhood",
          "montessori_method",
          "absorbent_mind",
          "elementary_material"
        ],
        "line_ranges": {
          "absorbent_mind": [
            [
              38,
              98
            ],
            [
              314,
              433
            ],
            [
              745,
              814
            ],
            [
              1704,
              1794
            ],
            [
              2498,
              2584
            ],
            [
              3112,
              3258
            ],
            [
              5033,
              5124
            ],
            [
              5573,
              5803
            ],
            [
              5962,
              6040
            ],
            [
              6273,
              6335
            ],
            [
              6704,
              6767
            ],
            [
              7703,
              7776
            ],
            [
              8226,
              8344
            ],
            [
              9013,
              9146
            ],
            [
              9965,
              10134
            ],
            [
              12677,
              12755
            ],
            [
              14417,
              14480
            ],
            [
              15459,
              15522
            ],
            [
              15697,
              15776
            ]
          ],
          "secret_of_childhood": [
            [
              174,
              250
            ],
            [
              351,
              413
            ],
            [
              597,
              671
            ],
            [
              2040,
              2136
            ],
            [
              3342,
              3415
            ],
            [
              8835,
              8899
            ]
          ],
          "montessori_method": [
            [
              258,
              529
            ],
            [
              896,
              959
            ],
            [
              1689,
              1913
            ],
            [
              2161,
              2346
            ],
            [
              3482,
              3559
            ],
            [
              3729,
              3843
            ],
            [
              3997,
              4061
            ],
            [
              4197,
              4280
            ],
            [
              4644,
              4715
            ],
            [
              5538,
              5616
            ],
            [
              6061,
              6143
            ],
            [
              7349,
              7414
            ],
            [
              7956,
              8180
            ],
            [
              8308,
              8494
            ],
            [
              8652,
              8752
            ],
            [
              8998,
              9342
            ],
            [
              9958,
              10028
            ],
            [
              12204,
              12317
            ],
            [
              12723,
              12794
            ]
          ],
          "own_handbook": [
            [
              332,
              397
            ],
            [
              715,
              787
            ],
            [
              978,
              1040
            ],
            [
              1838,
              1938
            ],
            [
              2189,
              2254
            ]
          ],
          "pedagogical_anthropology": [
            [
              79,
              151
            ],
            [
              514,
              584
            ],
            [
              815,
              924
            ],
            [
              1218,
              1543
            ],
            [
              1841,
              1904
            ],
            [
              2625,
              2687
            ],
            [
              2821,
              2934
            ],
            [
              6278,
              6342
            ],
            [
              6696,
              6766
            ],
            [
              7799,
              7874
            ],
            [
              8714,
              8781
            ],
            [
              9448,
              9575
            ],
            [
              9920,
              10006
            ],
            [
              10821,
              10892
            ],
            [
              12147,
              12221
            ],
            [
              13281,
              13353
            ],
            [
              14636,
              14708
            ],
            [
              15142,
              15231
            ],
            [
              15683,
              15753
            ],
            [
              15908,
              15989
            ],
            [
              16410,
              16493
            ],
            [
              17047,
              17150
            ],
            [
              17892,
              17968
            ],
            [
              18521,
              18834
            ],
            [
              20541,
              20610
            ],
            [
              20898,
              21009
            ],
            [
              21424,
              21504
            ]
          ],
          "spontaneous_activity": [
            [
              212,
              273
            ],
            [
              1528,
              1590
            ],
            [
              2653,
              2715
            ],
            [
              2844,
              2908
            ],
            [
              3095,
              3167
            ],
            [
              3747,
              5071
            ],
            [
              5288,
              5361
            ],
            [
              5554,
              5631
            ],
            [
              7242,
              7314
            ],
            [
              7635,
              7722
            ],
            [
              7882,
              8272
            ],
            [
              10185,
              10251
            ],
            [
              11242,
              11315
            ]
          ],
          "elementary_material": [
            [
              2257,
              2339
            ],
            [
              10942,
              11009
            ],
            [
              11838,
              11935
            ],
            [
              12120,
              12188
            ],
            [
              12539,
              12600
            ],
            [
              13625,
              13700
            ],
            [
              14783,
              14843
            ],
            [
              16599,
              16673
            ]
          ]
        },
        "total_matches": 194,
        "key_passages": [
          {
            "source": "absorbent_mind",
            "line": 68,
            "excerpt": "indeed one of the greatest mysteries of life. In the present \nvolume Dr. Montessori not only sheds the light of her \npenetrating insight, based on close observation and just \nappreciation, on the phen"
          },
          {
            "source": "absorbent_mind",
            "line": 346,
            "excerpt": "Unexploited Riches \n\nObservation, very general and wide-spread, has \nshown that small children are endowed with a special \npsychic nature. This shows us a new way of imparting"
          },
          {
            "source": "absorbent_mind",
            "line": 387,
            "excerpt": "go somewhat more into detail : the child has a type of \nmind that absorbs knowledge and instructs himself. A \nsuperficial observation will be sufficient to show this. \nThe child of two speaks the lang"
          },
          {
            "source": "secret_of_childhood",
            "line": 383,
            "excerpt": "ronment. It 1s clear that this approach will lead us\naway from psycho-analytic theories and technique,\ninto a new field of observation of the child m his\nsocial existence It is not a case of the tortu"
          },
          {
            "source": "secret_of_childhood",
            "line": 627,
            "excerpt": "develop if brought mto a favourable environment was\nalready formed, albeit imperfectly and in infinitesimal\nProportions This idea came from the observation of\nthe seed of a plant, which contams, hidde"
          },
          {
            "source": "secret_of_childhood",
            "line": 2076,
            "excerpt": "Organs of speech , prior to the act, there was an ami-\nmating psychic factor Such sensibihties are subjects\nfor observation but not for experiment Indeed such\nexperiments as have been attempted by the"
          },
          {
            "source": "montessori_method",
            "line": 289,
            "excerpt": "Child psychology can be established only through the method of\n    external observation                                            72\n\n    Anthropological consideration                                "
          },
          {
            "source": "montessori_method",
            "line": 317,
            "excerpt": "Characteristics of the individual lessons                      107\n\n    Method of observation the fundamental guide                    108\n\n    Difference between the scientific and unscientific metho"
          },
          {
            "source": "montessori_method",
            "line": 382,
            "excerpt": "of children                                                    155\n\n    The child initiated into observation of the phenomena of life\n    and into foresight by way of auto-education                   "
          },
          {
            "source": "own_handbook",
            "line": 364,
            "excerpt": "functions through which, receiving sensations from his environment,\nhe lays the foundations of his intelligence by a continual exercise\nof observation, comparison and judgment. In this way he graduall"
          },
          {
            "source": "own_handbook",
            "line": 1009,
            "excerpt": "beneath one that is larger, are caused by his own lack of education,\nand it is the _repetition of the exercise_ which, by refining his\npowers of observation, will lead him sooner or later to _correct_"
          },
          {
            "source": "own_handbook",
            "line": 1868,
            "excerpt": "made comparisons, reasoned, and formed judgments, until he has\nacquired a power of discrimination which he did not possess before. In\na word, he has _refined his senses_; his observation of things has"
          },
          {
            "source": "pedagogical_anthropology",
            "line": 111,
            "excerpt": "amelioration of man, founded upon the positive knowledge of the laws\nof human life. In contrast to general anthropology which, starting\nfrom a basis of positive data founded on observation, mounts tow"
          },
          {
            "source": "pedagogical_anthropology",
            "line": 113,
            "excerpt": "from a basis of positive data founded on observation, mounts toward\nphilosophic problems regarding the _origin of man_, pedagogic\nanthropology, starting from an analogous basis of observation and\nrese"
          },
          {
            "source": "pedagogical_anthropology",
            "line": 547,
            "excerpt": "anthropological method first to the study of the insane, and then\nto that of criminals, having perceived a similarity or relationship\nbetween these two categories of abnormal individuals. The observat"
          },
          {
            "source": "spontaneous_activity",
            "line": 242,
            "excerpt": "Polarization of the internal personality\n\nGuide to psychological observation.\n\n  Work"
          },
          {
            "source": "spontaneous_activity",
            "line": 1558,
            "excerpt": "For instance:\n\n_Moral education derived from the observation of actions_.\n\n(N.B.--The actions are all invented and narrated.)"
          },
          {
            "source": "spontaneous_activity",
            "line": 2876,
            "excerpt": "to antique speculations, although it is not directly based on the\npurely metric studies of \"positive psychology.\" But the \"method,\"\nwhich informs it--namely, experiment, observation, evidence or proof"
          },
          {
            "source": "elementary_material",
            "line": 2309,
            "excerpt": "of the various parts of speech. This will give her the necessary\n\"lightness of touch,\" perhaps even the opportunity of making some\nbrilliant little explanation, some casual observation, which may\nsudd"
          },
          {
            "source": "elementary_material",
            "line": 10972,
            "excerpt": "[Illustration]\n\nThis exercise in observation is repeated in a like manner with all the\nother insets, which are divided successively into four, eight, and\nsixteen parts. The small square which is a fou"
          },
          {
            "source": "elementary_material",
            "line": 11871,
            "excerpt": "The decorated motif is selected or else invented by the child himself.\nHe is allowed the same freedom of choice in his backgrounds as he enjoys\nfor his inks or water-colors. The observation of nature "
          }
        ]
      },
      "intervention": {
        "sources": [
          "pedagogical_anthropology",
          "own_handbook",
          "spontaneous_activity",
          "secret_of_childhood",
          "montessori_method",
          "absorbent_mind",
          "elementary_material"
        ],
        "line_ranges": {
          "absorbent_mind": [
            [
              1037,
              1107
            ],
            [
              1643,
              1704
            ],
            [
              2178,
              2276
            ],
            [
              4326,
              4389
            ],
            [
              5528,
              5653
            ],
            [
              6051,
              6122
            ],
            [
              6635,
              6699
            ],
            [
              8072,
              8143
            ],
            [
              8263,
              8414
            ],
            [
              9481,
              9683
            ],
            [
              10003,
              10102
            ],
            [
              10915,
              11203
            ],
            [
              11456,
              11560
            ],
            [
              12017,
              12126
            ],
            [
              12683,
              12773
            ],
            [
              13668,
              13815
            ],
            [
              13939,
              14025
            ],
            [
              14989,
              15085
            ],
            [
              15749,
              15823
            ]
          ],
          "secret_of_childhood": [
            [
              548,
              633
            ],
            [
              1709,
              1773
            ],
            [
              1994,
              2063
            ],
            [
              2326,
              2386
            ],
            [
              3263,
              3328
            ],
            [
              4329,
              4414
            ],
            [
              4529,
              4631
            ],
            [
              5604,
              5789
            ],
            [
              7016,
              7193
            ],
            [
              7990,
              8053
            ],
            [
              9008,
              9069
            ],
            [
              9453,
              9518
            ],
            [
              9698,
              9770
            ]
          ],
          "montessori_method": [
            [
              287,
              347
            ],
            [
              739,
              926
            ],
            [
              1193,
              1268
            ],
            [
              2482,
              2542
            ],
            [
              3129,
              3559
            ],
            [
              3729,
              4294
            ],
            [
              4622,
              4913
            ],
            [
              5032,
              5127
            ],
            [
              5763,
              5834
            ],
            [
              6081,
              6155
            ],
            [
              6547,
              6779
            ],
            [
              7010,
              7276
            ],
            [
              7494,
              7831
            ],
            [
              8134,
              8552
            ],
            [
              8707,
              8871
            ],
            [
              9042,
              9118
            ],
            [
              9346,
              10008
            ],
            [
              10182,
              10562
            ],
            [
              10664,
              10788
            ],
            [
              11243,
              11585
            ],
            [
              11715,
              11915
            ],
            [
              12595,
              12768
            ]
          ],
          "own_handbook": [
            [
              695,
              1048
            ],
            [
              1177,
              1371
            ],
            [
              1535,
              1603
            ],
            [
              1794,
              2106
            ],
            [
              2848,
              2915
            ]
          ],
          "pedagogical_anthropology": [
            [
              461,
              527
            ],
            [
              876,
              1236
            ],
            [
              1407,
              1495
            ],
            [
              2259,
              2477
            ],
            [
              3471,
              3534
            ],
            [
              4128,
              4212
            ],
            [
              4333,
              4402
            ],
            [
              4694,
              4810
            ],
            [
              5150,
              5220
            ],
            [
              6288,
              6353
            ],
            [
              6504,
              6565
            ],
            [
              7344,
              7408
            ],
            [
              7785,
              8034
            ],
            [
              8835,
              8899
            ],
            [
              9134,
              9201
            ],
            [
              10432,
              10548
            ],
            [
              13528,
              13596
            ],
            [
              13922,
              13995
            ],
            [
              15880,
              15957
            ],
            [
              16119,
              16343
            ],
            [
              17226,
              17287
            ],
            [
              18054,
              18159
            ],
            [
              18546,
              18608
            ],
            [
              18841,
              18934
            ],
            [
              19276,
              19343
            ],
            [
              19747,
              19820
            ],
            [
              20228,
              20308
            ]
          ],
          "spontaneous_activity": [
            [
              212,
              273
            ],
            [
              584,
              853
            ],
            [
              1865,
              1950
            ],
            [
              2547,
              2615
            ],
            [
              2758,
              2838
            ],
            [
              3209,
              3291
            ],
            [
              3604,
              3667
            ],
            [
              4252,
              4376
            ],
            [
              5139,
              5227
            ],
            [
              5835,
              5898
            ],
            [
              6790,
              6860
            ],
            [
              7364,
              7436
            ],
            [
              8623,
              8696
            ],
            [
              8865,
              9094
            ],
            [
              9426,
              9562
            ],
            [
              10535,
              10618
            ]
          ],
          "elementary_material": [
            [
              602,
              670
            ],
            [
              1040,
              1113
            ],
            [
              1306,
              1502
            ],
            [
              2162,
              2257
            ],
            [
              4811,
              4877
            ],
            [
              7209,
              7270
            ],
            [
              7727,
              7809
            ],
            [
              8903,
              8964
            ],
            [
              10833,
              10918
            ],
            [
              11117,
              11182
            ],
            [
              12229,
              12316
            ],
            [
              12845,
              12926
            ],
            [
              13055,
              13121
            ],
            [
              14783,
              14843
            ],
            [
              15542,
              15608
            ]
          ]
        },
        "total_matches": 290,
        "key_passages": [
          {
            "source": "absorbent_mind",
            "line": 1673,
            "excerpt": "in the environment, when we realise that the child's \nmind is different from ours, that we cannot reach it and \nteach him things, that we cannot directly intervene in \nthis process of passing from the"
          },
          {
            "source": "absorbent_mind",
            "line": 2243,
            "excerpt": "life of the West has deprived most children of their \nmother's milk and the children would have starved if \nscience had not intervened and supplied the child with \nsome other sort of physical nourishm"
          },
          {
            "source": "absorbent_mind",
            "line": 9649,
            "excerpt": "work.\" It brings into actual fact a great truth : \"Self- \nrenunciation can bring great truths.\" Our task is to teach \nthe teacher where he or she intervened needlessly. We call \nthis part of our work "
          },
          {
            "source": "secret_of_childhood",
            "line": 5635,
            "excerpt": "Though the school contamed some really wonder-\nful toys, the children never chose them This surprised\nme so much that I myself intervened, to show them\nhow to use such toys, teaching them how to handl"
          },
          {
            "source": "secret_of_childhood",
            "line": 589,
            "excerpt": "being, which the adult must fill by his own endeavours,\nas an mert and mcapable being for whom everything\ntaust be done, as a bemg without an inner guide,\nwhom the adult must guide step by step from w"
          },
          {
            "source": "secret_of_childhood",
            "line": 590,
            "excerpt": "as an mert and mcapable being for whom everything\ntaust be done, as a bemg without an inner guide,\nwhom the adult must guide step by step from without\nFinally, the adult acts as though he were the chi"
          },
          {
            "source": "montessori_method",
            "line": 3525,
            "excerpt": "recorded observation of the subject.\"\n\nTreating of children, another factor must necessarily intervene: the\nstudy of the development. Here too, I retained the same general\ncriterion, but without cling"
          },
          {
            "source": "montessori_method",
            "line": 4041,
            "excerpt": "acts of itself_, and that in order to study it, to divine its secrets or\nto direct its activity, it is necessary to observe it and to understand\nit without intervening--this idea, I say, is very diffi"
          },
          {
            "source": "montessori_method",
            "line": 4175,
            "excerpt": "When the teachers were weary of my observations, they began to allow the\nchildren to do whatever they pleased. I saw children with their feet on\nthe tables, or with their fingers in their noses, and n"
          },
          {
            "source": "own_handbook",
            "line": 735,
            "excerpt": "In the same way for the teaching of the other and larger movements,\nsuch as washing, setting the table, etc., the directress must at the\nbeginning intervene, teaching the child with few or no words at"
          },
          {
            "source": "own_handbook",
            "line": 893,
            "excerpt": "place.\n\nIn these exercises the teacher may, in the first instance, intervene,\nmerely taking out the cylinders, mixing them carefully on the table\nand then showing the child that he is to put them back"
          },
          {
            "source": "own_handbook",
            "line": 896,
            "excerpt": "merely taking out the cylinders, mixing them carefully on the table\nand then showing the child that he is to put them back, but without\nperforming the action herself. Such intervention, however, is al"
          },
          {
            "source": "pedagogical_anthropology",
            "line": 2300,
            "excerpt": "The most modern theory of evolution is that of De Vries, who, after\nhaving witnessed the spontaneous and unforeseen transformations of a\ncertain plant, the OEnohtera Lamarckiana, without the intervent"
          },
          {
            "source": "pedagogical_anthropology",
            "line": 3504,
            "excerpt": "the limbs_ and is _subject to less variation_.\n\nBut notwithstanding this general fact, other conditions intervene to\ndetermine the comparative relations between the two portions of the\nstature. Indeed"
          },
          {
            "source": "pedagogical_anthropology",
            "line": 4165,
            "excerpt": "There exist, besides, certain individuals in rebellion against society,\noutcasts whose lives depend upon the succor of the strong, or may be\ndestroyed by their adverse intervention, but in any case ha"
          },
          {
            "source": "spontaneous_activity",
            "line": 636,
            "excerpt": "without having the membrane of the tongue cut; and further, that legs\nwill grow straight and that the function of walking will come\nnaturally, and requires no intervention.\n\nHence it follows that we s"
          },
          {
            "source": "spontaneous_activity",
            "line": 723,
            "excerpt": "reality, the question of infant welfare was not concerned with the\nmore or less perfect forms of the body. The real infantile question\nwhich called for the intervention of science was the alarming\nmor"
          },
          {
            "source": "spontaneous_activity",
            "line": 2790,
            "excerpt": "that the spontaneous development of the child should be accorded\n_perfect liberty_; that is to say, that its calm and peaceful\nexpansion should not be disturbed by the intervention of an untimely\nand "
          },
          {
            "source": "elementary_material",
            "line": 2206,
            "excerpt": "She pushes, so to speak, a button and here a bell rings, there a light\ngoes on, there a machine begins to buzz. Very often the teacher sees a\nwhole week go by without any need of intervention on her p"
          },
          {
            "source": "elementary_material",
            "line": 2217,
            "excerpt": "with the colored cards, the teacher shifts about, as if in play, one of\nthe little slips, not only must she be possessed of the psychological\ninsight necessary for intervening in this child's work at "
          },
          {
            "source": "elementary_material",
            "line": 12895,
            "excerpt": "a military march was played; she would frown and walk heavily.\n\nOn the other hand, the intervention of the teacher to give some apposite\nlesson, tending to perfect certain movements, is something whic"
          }
        ]
      },
      "preparation": {
        "sources": [
          "pedagogical_anthropology",
          "own_handbook",
          "spontaneous_activity",
          "secret_of_childhood",
          "montessori_method",
          "absorbent_mind",
          "elementary_material"
        ],
        "line_ranges": {
          "absorbent_mind": [
            [
              473,
              541
            ],
            [
              1429,
              1503
            ],
            [
              8700,
              8796
            ],
            [
              9126,
              9192
            ],
            [
              10929,
              11023
            ],
            [
              11456,
              11560
            ],
            [
              12274,
              12446
            ],
            [
              13344,
              13414
            ],
            [
              13690,
              13783
            ]
          ],
          "secret_of_childhood": [
            [
              2040,
              2113
            ],
            [
              3080,
              3214
            ],
            [
              3447,
              3517
            ],
            [
              3960,
              4062
            ],
            [
              6194,
              6256
            ],
            [
              7197,
              7376
            ]
          ],
          "montessori_method": [
            [
              1657,
              1725
            ],
            [
              2282,
              2346
            ],
            [
              2525,
              2586
            ],
            [
              2794,
              2912
            ],
            [
              3584,
              3658
            ],
            [
              4606,
              4676
            ],
            [
              4968,
              5181
            ],
            [
              5436,
              5511
            ],
            [
              6040,
              6115
            ],
            [
              6937,
              7007
            ],
            [
              7722,
              7789
            ],
            [
              7970,
              8040
            ],
            [
              8767,
              8832
            ],
            [
              9090,
              9192
            ],
            [
              10101,
              10298
            ],
            [
              12127,
              12204
            ]
          ],
          "own_handbook": [
            [
              1320,
              1484
            ],
            [
              2060,
              2268
            ]
          ],
          "pedagogical_anthropology": [
            [
              1188,
              1269
            ],
            [
              4036,
              4108
            ],
            [
              5194,
              5276
            ],
            [
              15890,
              15957
            ],
            [
              20255,
              20340
            ],
            [
              21107,
              21181
            ]
          ],
          "spontaneous_activity": [
            [
              3014,
              3090
            ],
            [
              3580,
              3812
            ],
            [
              4410,
              4483
            ],
            [
              4811,
              4880
            ],
            [
              5326,
              5421
            ],
            [
              6112,
              6204
            ],
            [
              6359,
              6430
            ],
            [
              7304,
              7378
            ],
            [
              7557,
              7622
            ]
          ],
          "elementary_material": [
            [
              126,
              214
            ],
            [
              2282,
              2352
            ],
            [
              8840,
              8908
            ],
            [
              15457,
              15528
            ],
            [
              16070,
              16140
            ]
          ]
        },
        "total_matches": 68,
        "key_passages": [
          {
            "source": "absorbent_mind",
            "line": 504,
            "excerpt": "ment. The task of the teacher then becomes not one of \ntalking, but one of preparing a series of motives of cultural \nactivity spread in a specially prepared environment."
          },
          {
            "source": "absorbent_mind",
            "line": 10985,
            "excerpt": "so that if there was a lazy child, we did not urge him to \nwork. We merely facilitated contact with the means of \ndevelopment in the prepared environment. As soon as \nhe found work all his trouble dis"
          },
          {
            "source": "absorbent_mind",
            "line": 12305,
            "excerpt": "first elements of character may be formed and acquire their \nparticular importance. That is why the question of the \nprepared environment in education, when first proclaimed \nto the world, gave rise t"
          },
          {
            "source": "secret_of_childhood",
            "line": 2073,
            "excerpt": "a syllable Thus before the earhest articulate utter-\nance, there existed in the child a sensible interest, stor-\ning up sounds, secretly preparing the animation of the\nOrgans of speech , prior to the "
          },
          {
            "source": "secret_of_childhood",
            "line": 3110,
            "excerpt": "But this time he only made a kind of grunt, as if to say,\n“ Get on, ” and his little face showed no sign of interest\nWhile I was preparing to turn over the page, he\ntouched a little medallion that he "
          },
          {
            "source": "secret_of_childhood",
            "line": 3182,
            "excerpt": "his parents have given him all sorts of things, an um-\nbrella, a pair of trousers, shoes, stockings and a colour-\ned jacket, and they are preparing a fine dinner for hm\nMeanwhile Sambo, who wants to s"
          },
          {
            "source": "montessori_method",
            "line": 1690,
            "excerpt": "But let us put aside the difficulty of preparing scientific masters in\nthe accepted sense of the word. We will not even attempt to outline a\nprogramme of such preparation, since this would lead us int"
          },
          {
            "source": "montessori_method",
            "line": 2315,
            "excerpt": "insane asylums in Rome.\n\nI spent these two years with the help of my colleagues in preparing the\nteachers of Rome for a special method of observation and education of\nfeeble-minded children. Not only "
          },
          {
            "source": "montessori_method",
            "line": 2556,
            "excerpt": "In fact, the words--\"I will cause breath to enter into you, and ye shall\nlive,\" seem to me to refer to the direct individual work of the master\nwho encourages, calls to, and helps his pupil, preparing"
          },
          {
            "source": "own_handbook",
            "line": 1355,
            "excerpt": "for drawing. It is certainly the preparation of the hand to _trace an\nenclosed form_. The little hand which touches, feels, and knows how to\nfollow a determined outline is preparing itself, without kn"
          },
          {
            "source": "own_handbook",
            "line": 1452,
            "excerpt": "these biscuits were made in geometrical shapes.\n\nIn one of the people's dwellings at Milan, a mother, preparing the\ndinner in the kitchen, took from a packet a slice of bread and butter.\nHer little fo"
          },
          {
            "source": "own_handbook",
            "line": 2096,
            "excerpt": "*       *       *       *       *\n\nOur children have long been preparing the hand for writing.\nThroughout all the sensory exercises the hand, whilst cooperating\nwith the mind in its attainments and in"
          },
          {
            "source": "pedagogical_anthropology",
            "line": 1224,
            "excerpt": "first treatise on philosophic anthropology. While the experimental\nsciences, by collecting and recording separate phenomena, were\ngradually preparing, throughout the nineteenth century, a great mass o"
          },
          {
            "source": "pedagogical_anthropology",
            "line": 4072,
            "excerpt": "labour requires the short, robust arm of the brachyscele. Such\nconsiderations ought not to escape the notice of the teacher, who sees\nin the boy the future man. He has the high mission of preparing th"
          },
          {
            "source": "pedagogical_anthropology",
            "line": 5228,
            "excerpt": "period of _evolution_, during which the organism shows that it has not\nyet matured; and before the commencement of involution, in which period\nthe organism is slowly preparing for departure--that is t"
          },
          {
            "source": "spontaneous_activity",
            "line": 3060,
            "excerpt": "Hence, to establish systematic tests for a certain purpose, such as\nthat of preparing children to write, without taking their ages into\naccount, is valueless. For example, my system of writing is base"
          },
          {
            "source": "spontaneous_activity",
            "line": 3610,
            "excerpt": "agitation, moves about, and walks, but does not disturb the others. It\nmay be said that he is in search of the maximum satisfaction for his\ninterest, and is preparing for his \"great work.\"\n\nBut, on th"
          },
          {
            "source": "spontaneous_activity",
            "line": 3768,
            "excerpt": "to the serious work. The finale is a spell of rest full of thought;\nthe child ceases to work, but contemplates his finished task for a\nlong time in silence; before preparing to put it away, or, after\n"
          },
          {
            "source": "elementary_material",
            "line": 2320,
            "excerpt": "in detail. The teacher should be relieved as much as possible of the\nlabor of preparation and research: for her delicate work of\n_intervention_ is a task hard enough in itself. In preparing this\nmater"
          },
          {
            "source": "elementary_material",
            "line": 8874,
            "excerpt": "events, which they took down in their copy-books. This whole experience\ncorrected many of my own ideas on the teaching of history. I had thought\nof preparing moving-picture films and giving historical"
          },
          {
            "source": "elementary_material",
            "line": 15497,
            "excerpt": "It prepares: for exercise; for the activities of\n      domestic service (washing, dressing, preparing food,\n      setting and clearing the table, etc.); for manual\n      labor (trades); for language ("
          }
        ]
      }
    },
    "materials": {
      "practical_life": {
        "sources": [
          "pedagogical_anthropology",
          "own_handbook",
          "spontaneous_activity",
          "secret_of_childhood",
          "montessori_method",
          "absorbent_mind",
          "elementary_material"
        ],
        "line_ranges": {
          "absorbent_mind": [
            [
              7973,
              8044
            ],
            [
              9703,
              9777
            ],
            [
              11129,
              11354
            ],
            [
              13947,
              14054
            ],
            [
              15041,
              15116
            ]
          ],
          "secret_of_childhood": [
            [
              2219,
              2288
            ],
            [
              6856,
              6928
            ]
          ],
          "montessori_method": [
            [
              297,
              489
            ],
            [
              604,
              664
            ],
            [
              979,
              1047
            ],
            [
              2122,
              2199
            ],
            [
              3189,
              3260
            ],
            [
              4896,
              5145
            ],
            [
              5436,
              5511
            ],
            [
              5661,
              5780
            ],
            [
              6934,
              7001
            ],
            [
              7142,
              7220
            ],
            [
              7979,
              8210
            ],
            [
              8445,
              8506
            ],
            [
              9463,
              9527
            ],
            [
              9641,
              9711
            ],
            [
              11213,
              11291
            ],
            [
              11602,
              11827
            ],
            [
              12641,
              12711
            ]
          ],
          "own_handbook": [
            [
              666,
              948
            ],
            [
              1195,
              1351
            ],
            [
              2095,
              2166
            ]
          ],
          "pedagogical_anthropology": [
            [
              16985,
              17056
            ],
            [
              17157,
              17224
            ],
            [
              20348,
              20422
            ]
          ],
          "spontaneous_activity": [
            [
              3494,
              3561
            ],
            [
              5126,
              5196
            ],
            [
              5579,
              5654
            ],
            [
              8549,
              8615
            ]
          ],
          "elementary_material": [
            [
              2162,
              2237
            ],
            [
              2818,
              2879
            ],
            [
              3173,
              3234
            ],
            [
              7485,
              7555
            ],
            [
              11748,
              11809
            ],
            [
              15528,
              15932
            ],
            [
              16599,
              16673
            ],
            [
              16795,
              16881
            ]
          ]
        },
        "total_matches": 76,
        "key_passages": [
          {
            "source": "absorbent_mind",
            "line": 8004,
            "excerpt": "speak about * behaviour ', the behaviour of men and \nanimals, we refer to their purposeful movements. This \nbehaviour is the centre of their practical life. It is not \n\n210"
          },
          {
            "source": "absorbent_mind",
            "line": 8014,
            "excerpt": "confined to the practical life in a house, cleaning the \nrooms, washing clothes, etc. This is important of course, \nbut everyone in the world must move with a larger pur-"
          },
          {
            "source": "absorbent_mind",
            "line": 9733,
            "excerpt": "to the children, it will influence the parents. In my first \nexperimental 4 House of Children f when they had started \ndoing exercises of practical life and were interested in \nthe details of them, th"
          },
          {
            "source": "secret_of_childhood",
            "line": 2252,
            "excerpt": "Another time, a bigger child, of about four, m\npouring water from one receptacle to another, let some\ndrops fall on the floor without noticmg it. A tiny child\ntook a rag, sat down on the floor and wip"
          },
          {
            "source": "secret_of_childhood",
            "line": 6888,
            "excerpt": "objects themselves. While his mind was thus dis-\ntracted he was incapable of any precise action, such\nas doing up even one button. All at once something\nmarvellous began to work in him “I saw,” she sa"
          },
          {
            "source": "montessori_method",
            "line": 328,
            "excerpt": "CHAPTER VII\n\nEXERCISES OF PRACTICAL LIFE\n\n    Suggested schedule for the \"Children's Houses\"                 119"
          },
          {
            "source": "montessori_method",
            "line": 459,
            "excerpt": "Education of the senses makes men observers and prepares them\n    directly for practical life                                    218"
          },
          {
            "source": "montessori_method",
            "line": 3220,
            "excerpt": "studied from the anthropological standpoint. Linguistic exercises, a\nsystematic sense-training, and exercises which directly fit the child\nfor the duties of practical life, form the basis of the work "
          },
          {
            "source": "own_handbook",
            "line": 710,
            "excerpt": "together touch one another from top to bottom. Then, if it is a\nbuttoning-frame, the teacher will show the child the different stages\nof the action. She will take hold of the button, set it opposite t"
          },
          {
            "source": "own_handbook",
            "line": 869,
            "excerpt": "years old are three solid pieces of wood, in each of which is inserted\na row of ten small cylinders, or sometimes discs, all furnished with a\nbutton for a handle. In the first case there is a row of c"
          },
          {
            "source": "own_handbook",
            "line": 887,
            "excerpt": "putting them back in the right place. It is performed by the child as\nhe sits in a comfortable position at a little table. He exercises his\nhands in the delicate act of taking hold of the button with "
          },
          {
            "source": "pedagogical_anthropology",
            "line": 20388,
            "excerpt": "course of the secondary schools, because it would contain, in compact\nand methodical form, the history of his physical and mental life, and\nhe would find it of inestimable advantage both in practical "
          },
          {
            "source": "pedagogical_anthropology",
            "line": 17023,
            "excerpt": "with the aid of Broca's _goniometer_; the transverse branch passes\nacross the subnasal point; the two antero-posterior branches are\ninserted, with the buttons with which they terminate, into the exter"
          },
          {
            "source": "pedagogical_anthropology",
            "line": 17189,
            "excerpt": "_Biacromial Diameter._--This is taken by means of special calipers\ncalled a _thoracimeter_ or _pelvimeter_, because it is used to obtain\nthe big measurements of the body (thorax and pelvis). The two b"
          },
          {
            "source": "spontaneous_activity",
            "line": 5160,
            "excerpt": "\"exercise themselves in order to learn to coordinate their movements.\"\n\nIt consists of the so-called exercises of practical life which\ncorrespond to the psychical principle of \"liberty of movement.\" F"
          },
          {
            "source": "spontaneous_activity",
            "line": 5612,
            "excerpt": "I am prepared for the objections of \"experts.\" Children must be\naccustomed to pay attention to everything, even to things which are\ndistasteful to them, because practical life demands such efforts.\n\nT"
          },
          {
            "source": "spontaneous_activity",
            "line": 8583,
            "excerpt": "_imagining_ that he is living among possessions of his own. Some\nteachers in charge of a model orphanage once said to me: \"We too make\nour children perform the exercises of practical life which you\nde"
          },
          {
            "source": "elementary_material",
            "line": 15722,
            "excerpt": "(3) Movements relating: (a) to the simpler forms of\n      manual labor (exercises of practical life: washing,\n      dressing, picking up and laying down various objects,\n      opening and closing draw"
          },
          {
            "source": "elementary_material",
            "line": 15879,
            "excerpt": "Odors of burning { Straw           }\n    substances       { Paper           } Various applications\n                   { Wool              } to practical life.\n    Guessing games { Cotton            }\n"
          },
          {
            "source": "elementary_material",
            "line": 15883,
            "excerpt": "{ Edibles           }\n\n      Odors of foods (practical life): fresh milk, sour\n      milk, fresh meat, stale meat, rancid butter, fresh\n      butter, etc."
          }
        ]
      },
      "sensorial": {
        "sources": [
          "pedagogical_anthropology",
          "spontaneous_activity",
          "own_handbook",
          "montessori_method",
          "absorbent_mind",
          "elementary_material"
        ],
        "line_ranges": {
          "absorbent_mind": [
            [
              7725,
              7807
            ],
            [
              8625,
              8721
            ],
            [
              8855,
              8936
            ],
            [
              10078,
              10285
            ],
            [
              11075,
              11203
            ],
            [
              12319,
              12384
            ],
            [
              13646,
              13718
            ]
          ],
          "montessori_method": [
            [
              398,
              513
            ],
            [
              615,
              689
            ],
            [
              3910,
              3970
            ],
            [
              4742,
              4858
            ],
            [
              6460,
              6521
            ],
            [
              6784,
              7511
            ],
            [
              8030,
              8337
            ],
            [
              8467,
              8792
            ],
            [
              8897,
              9076
            ],
            [
              9281,
              9405
            ],
            [
              9580,
              9672
            ],
            [
              9924,
              10265
            ],
            [
              11408,
              11858
            ],
            [
              12338,
              12421
            ]
          ],
          "own_handbook": [
            [
              156,
              229
            ],
            [
              466,
              652
            ],
            [
              944,
              1081
            ],
            [
              1371,
              1436
            ],
            [
              1826,
              1887
            ],
            [
              2379,
              2442
            ],
            [
              2561,
              2634
            ]
          ],
          "pedagogical_anthropology": [
            [
              9182,
              9265
            ],
            [
              12489,
              12551
            ],
            [
              14095,
              14195
            ],
            [
              15757,
              15870
            ],
            [
              18936,
              19061
            ],
            [
              23778,
              23839
            ]
          ],
          "spontaneous_activity": [
            [
              1809,
              1885
            ],
            [
              2844,
              2929
            ],
            [
              3514,
              3587
            ],
            [
              5471,
              5543
            ],
            [
              7947,
              8183
            ],
            [
              10656,
              10742
            ]
          ],
          "elementary_material": [
            [
              332,
              510
            ],
            [
              2843,
              2907
            ],
            [
              3947,
              4008
            ],
            [
              4356,
              4549
            ],
            [
              5330,
              5391
            ],
            [
              7988,
              8052
            ],
            [
              10712,
              10951
            ],
            [
              11201,
              11262
            ],
            [
              11475,
              12283
            ],
            [
              13208,
              13270
            ]
          ]
        },
        "total_matches": 180,
        "key_passages": [
          {
            "source": "absorbent_mind",
            "line": 7760,
            "excerpt": "action. So it is a cycle, because both psyche and move- \nment belong to the same unity. The senses also help. \nWithout opportunity for sensorial activity the child is less \nintelligent. That is why th"
          },
          {
            "source": "absorbent_mind",
            "line": 8893,
            "excerpt": "lopments which come separately and independently, \nsuch as language, the movement of the arms, the move- \nment of the legs, etc., and there are certain sensorial \ndevelopments like that of the eye in "
          },
          {
            "source": "absorbent_mind",
            "line": 10129,
            "excerpt": "geometrical figures they had been handling in the \n\nsensorial apparatus, polygons, trapezium, trapezoid, etc. \n\nThe children took them all in one day ! So we went to"
          },
          {
            "source": "montessori_method",
            "line": 7150,
            "excerpt": "_Copyright, 1912, by Carl R. Byoir_]\n\n[Illustration: (A) BROAD STAIR. (B) LONG STAIR. (C) TOWER. Blocks by\nwhich children are taught thickness, length, size."
          },
          {
            "source": "montessori_method",
            "line": 11448,
            "excerpt": "in such a way as to form tens. The most simple way of doing this is to\ntake successively the shortest rods, from one up, and place them at the\nend of the corresponding long rods from nine down. This m"
          },
          {
            "source": "montessori_method",
            "line": 11479,
            "excerpt": "In regard to the remaining five, it is the half of ten, and by cutting\nthe long rod in two, that is dividing ten by two, we would have five;\nten divided by two equals five. The written record of all t"
          },
          {
            "source": "own_handbook",
            "line": 2409,
            "excerpt": "name of the note on the rectangular base of the corresponding bell,\nwhose sound he has already learned to recognize by ear in the\nsensorial exercise described above.\n\n[Illustration: FIG. 39.--DUMB KEY"
          },
          {
            "source": "own_handbook",
            "line": 196,
            "excerpt": "9.  The Tower                                                     31\n 10.  Child Playing with Tower                                      31\n 11.  The Broad Stair                                       "
          },
          {
            "source": "own_handbook",
            "line": 975,
            "excerpt": "HAWKER'S SCHOOL AT RUNTON.)]\n\n[Illustration: FIG. 11.--THE BROAD STAIR.]\n\n[Illustration: FIG. 12.--THE LONG STAIR.]"
          },
          {
            "source": "pedagogical_anthropology",
            "line": 12519,
            "excerpt": "special consideration to the expression of _external_ or sensory\n_attention_, and _internal attention_ (reflection, meditation). The\nyoung child is capable of intense sensorial attention, which is\nman"
          },
          {
            "source": "pedagogical_anthropology",
            "line": 18995,
            "excerpt": "Attention.\n  Sensorial perception.\n  Intellectual perception.\n  Deduction."
          },
          {
            "source": "pedagogical_anthropology",
            "line": 9228,
            "excerpt": "In order to demonstrate that the cephalic index does not determine the\nform of the cranium, Sergi makes use of a number of different geometric\nfigures, such as a triangle, an ellipse, a trapezoid insc"
          },
          {
            "source": "spontaneous_activity",
            "line": 7986,
            "excerpt": "descriptions of delicious music, imagine the classic beauty of a\npainted picture. The temperaments of poets and artists are\npre-eminently sensorial. And all the senses do not contribute in equal\nmeasu"
          },
          {
            "source": "spontaneous_activity",
            "line": 8000,
            "excerpt": "in whom the tactile and muscular sensations predominate.\n\nThere are persons who have had non-sensorial impressions, and they are\npersons whose spiritual life was of very great intensity. They have\n_in"
          },
          {
            "source": "spontaneous_activity",
            "line": 8011,
            "excerpt": "persons wish to describe these impressions which do not penetrate by\nmeans of the senses, they are obliged to borrow the language of\nsensorial impression. \"I heard a voice,\" says the Blessed Raymond o"
          },
          {
            "source": "elementary_material",
            "line": 10751,
            "excerpt": "jewels, gives a profound notion of the relations of quantity. By this\ntime these cubes are no longer recognized superficially through\nsensorial impressions, but their minutest details are known to the"
          },
          {
            "source": "elementary_material",
            "line": 10769,
            "excerpt": "The geometric insets used for sensorial exercises in the \"Children's\nHouse\" made it possible for the child to become familiar with many\nfigures of plane geometry: the square, rectangle, triangle, poly"
          },
          {
            "source": "elementary_material",
            "line": 12197,
            "excerpt": "consists of a series of bells representing the whole tones and\nsemi-tones of one octave. The material follows the general\ncharacteristics of that used in the sensorial method, that is, the\nobjects dif"
          }
        ]
      },
      "math": {
        "sources": [
          "spontaneous_activity",
          "own_handbook",
          "montessori_method",
          "pedagogical_anthropology",
          "elementary_material"
        ],
        "line_ranges": {
          "montessori_method": [
            [
              525,
              926
            ],
            [
              4688,
              4774
            ],
            [
              7202,
              7276
            ],
            [
              11213,
              11275
            ],
            [
              11408,
              11564
            ],
            [
              11790,
              11878
            ]
          ],
          "own_handbook": [
            [
              129,
              263
            ],
            [
              2041,
              2121
            ],
            [
              2482,
              2802
            ]
          ],
          "pedagogical_anthropology": [
            [
              18936,
              19061
            ],
            [
              19630,
              19694
            ]
          ],
          "spontaneous_activity": [
            [
              3175,
              3250
            ],
            [
              5968,
              6049
            ],
            [
              6702,
              6769
            ],
            [
              8749,
              8821
            ],
            [
              11333,
              11399
            ]
          ],
          "elementary_material": [
            [
              154,
              491
            ],
            [
              8887,
              9463
            ],
            [
              9613,
              9755
            ],
            [
              9901,
              10159
            ],
            [
              10780,
              10854
            ],
            [
              11134,
              11258
            ],
            [
              11565,
              11807
            ],
            [
              16533,
              16612
            ],
            [
              16783,
              16881
            ]
          ]
        },
        "total_matches": 76,
        "key_passages": [
          {
            "source": "montessori_method",
            "line": 565,
            "excerpt": "and division                                                   332\n\n    Lessons on decimals: arithmetical calculations beyond ten      335"
          },
          {
            "source": "montessori_method",
            "line": 7241,
            "excerpt": "arithmetic, as we shall see. With it, one may count from one to ten and\nmay construct the addition and other tables, and it may constitute the\nfirst steps in the study of the decimal and metric system"
          },
          {
            "source": "montessori_method",
            "line": 11439,
            "excerpt": "arithmetical operations is the same already used for numeration; that\nis, the rods graduated as to length which, arranged on the scale of the\nmetre, contain the first idea of the decimal system.\n\nThe "
          },
          {
            "source": "own_handbook",
            "line": 164,
            "excerpt": "Didactic Material for the Education of the Senses              18\n     Didactic Material for the Preparation of Writing\n         and Arithmetic                                             19\n MOTOR ED"
          },
          {
            "source": "own_handbook",
            "line": 174,
            "excerpt": "Exercises for the Writing of Alphabetical Signs                92\n THE READING OF MUSIC                                               98\n ARITHMETIC                                                    "
          },
          {
            "source": "own_handbook",
            "line": 228,
            "excerpt": "40.  Diagram Illustrating Use of Numerical Rods                   107\n 41.  Counting Boxes                                               110\n 42.  Arithmetic Frame                                     "
          },
          {
            "source": "pedagogical_anthropology",
            "line": 19012,
            "excerpt": "Reflection.\n  Have the ordinary rudiments, such as the alphabet, reading,\n    writing, drawing, arithmetic, been taught to the pupil or not, and\n    can they be taught in his present state?\n  Have his"
          },
          {
            "source": "pedagogical_anthropology",
            "line": 19661,
            "excerpt": "_June._--Hand-writing, far from improving, seems to be growing\n      worse. On the contrary, it is noticed that he has made\n      progress in arithmetic. Can perform all four primary operations\n      "
          },
          {
            "source": "spontaneous_activity",
            "line": 6733,
            "excerpt": "tablets which show the various degrees of intensity of the same\nchromatic tone; the bells which produce the notes of an octave, the\nobjects which represent length in decimal proportions, or thickness "
          },
          {
            "source": "spontaneous_activity",
            "line": 3213,
            "excerpt": "psychological necessities, but also upon those factors which take into\naccount the cultural aspect itself. Each subject of study, as, for\ninstance, arithmetic, grammar, geometry, natural science, musi"
          },
          {
            "source": "spontaneous_activity",
            "line": 6009,
            "excerpt": "He who interrupts the children in their occupations in order to make\nthem learn some pre-determined thing; he who makes them cease the\nstudy of arithmetic to pass on to that of geography and the like,"
          },
          {
            "source": "elementary_material",
            "line": 447,
            "excerpt": "Exercises in interpreted reading and in arithmetic                201\n\n  The bead material used for addition and subtraction               214\n\n  Counting and calculating by means of the bead chains  "
          },
          {
            "source": "elementary_material",
            "line": 9093,
            "excerpt": "joyfully announces his transition to the higher plane, exclaiming, \"I\ncan count in my head and I can do it more quickly!\" This declaration\nindicates that he has conquered the first bead material."
          },
          {
            "source": "elementary_material",
            "line": 9288,
            "excerpt": "units place and the 1 would be in the tens position.\n\n[Illustration: The bead material used for addition and subtraction. Each\nof the nine numbers is of different colored beads.]"
          }
        ]
      },
      "language_materials": {
        "sources": [
          "pedagogical_anthropology",
          "own_handbook",
          "spontaneous_activity",
          "secret_of_childhood",
          "montessori_method",
          "absorbent_mind",
          "elementary_material"
        ],
        "line_ranges": {
          "absorbent_mind": [
            [
              183,
              252
            ],
            [
              448,
              541
            ],
            [
              6144,
              6218
            ],
            [
              6635,
              6733
            ],
            [
              7053,
              7182
            ],
            [
              8107,
              8171
            ],
            [
              8830,
              8897
            ],
            [
              9566,
              9662
            ],
            [
              9793,
              10112
            ],
            [
              10922,
              10989
            ],
            [
              12827,
              12909
            ],
            [
              14068,
              14149
            ],
            [
              15749,
              15823
            ]
          ],
          "secret_of_childhood": [
            [
              75,
              153
            ],
            [
              3099,
              3166
            ],
            [
              3879,
              3949
            ],
            [
              6135,
              6286
            ],
            [
              6422,
              6505
            ],
            [
              6758,
              6820
            ],
            [
              7215,
              7303
            ]
          ],
          "montessori_method": [
            [
              460,
              926
            ],
            [
              1166,
              1407
            ],
            [
              1551,
              1630
            ],
            [
              2322,
              2596
            ],
            [
              3341,
              3416
            ],
            [
              8009,
              8195
            ],
            [
              8671,
              10864
            ],
            [
              10973,
              11210
            ],
            [
              11703,
              12022
            ],
            [
              12317,
              12416
            ],
            [
              12755,
              13093
            ]
          ],
          "own_handbook": [
            [
              129,
              263
            ],
            [
              603,
              682
            ],
            [
              1320,
              1390
            ],
            [
              1826,
              2530
            ],
            [
              2661,
              2802
            ],
            [
              3021,
              3276
            ]
          ],
          "pedagogical_anthropology": [
            [
              1398,
              1489
            ],
            [
              1625,
              1698
            ],
            [
              6061,
              6125
            ],
            [
              6609,
              6680
            ],
            [
              12869,
              13080
            ],
            [
              17562,
              17631
            ],
            [
              18936,
              19061
            ],
            [
              19467,
              19694
            ],
            [
              21155,
              21233
            ],
            [
              23849,
              24173
            ]
          ],
          "spontaneous_activity": [
            [
              539,
              619
            ],
            [
              2098,
              2438
            ],
            [
              3031,
              3250
            ],
            [
              3567,
              3771
            ],
            [
              3889,
              3952
            ],
            [
              5423,
              5492
            ],
            [
              6292,
              6359
            ],
            [
              6750,
              6860
            ],
            [
              6967,
              7054
            ],
            [
              9541,
              9607
            ],
            [
              11423,
              11678
            ]
          ],
          "elementary_material": [
            [
              72,
              955
            ],
            [
              1281,
              1492
            ],
            [
              1778,
              1848
            ],
            [
              2019,
              2349
            ],
            [
              2580,
              2670
            ],
            [
              2974,
              3038
            ],
            [
              3527,
              3666
            ],
            [
              3901,
              3962
            ],
            [
              4311,
              4389
            ],
            [
              4673,
              4733
            ],
            [
              5080,
              5192
            ],
            [
              5434,
              5829
            ],
            [
              6303,
              6418
            ],
            [
              7048,
              7130
            ],
            [
              7355,
              7480
            ],
            [
              7655,
              8308
            ],
            [
              8506,
              8567
            ],
            [
              8749,
              9031
            ],
            [
              9277,
              9501
            ],
            [
              9693,
              10059
            ],
            [
              10746,
              10817
            ],
            [
              11706,
              12510
            ],
            [
              12838,
              12908
            ],
            [
              13208,
              13325
            ],
            [
              13584,
              13710
            ],
            [
              14020,
              14086
            ],
            [
              14425,
              14486
            ],
            [
              15457,
              15525
            ],
            [
              15981,
              16548
            ],
            [
              16729,
              16795
            ],
            [
              17185,
              17440
            ]
          ]
        },
        "total_matches": 686,
        "key_passages": [
          {
            "source": "absorbent_mind",
            "line": 479,
            "excerpt": "Yet these children at 4 years knew how to read and \nwrite. Nobody had taught them. Visitors were surprised \nto see children of so tender an age writing and reading. \n\" Who has taught you how to write "
          },
          {
            "source": "absorbent_mind",
            "line": 494,
            "excerpt": "fatigue then let us put different items of culture for them \nto absorb. So the children absorbed much more than \nreading and writing, subjects like botany, zoology, mathe- \nmatics, geography and so on"
          },
          {
            "source": "absorbent_mind",
            "line": 8137,
            "excerpt": "Middle Ages in Europe there was an epoch of great \nintellectual awakening and at the same time they covered \nwith beautiful illuminations the writing that conveyed the \nnew thoughts. Even the life of "
          },
          {
            "source": "secret_of_childhood",
            "line": 6790,
            "excerpt": "and learned to count and to do simple additions Then\nhe began to work backwards, the simpler objects, the\ncylinders, the metal insets, and came to take mterest\nin every part of the system."
          },
          {
            "source": "secret_of_childhood",
            "line": 3911,
            "excerpt": "too alluring objects which are so eminently tabooed\nbecause they belong to mamma’s dressing-table or\ndaddy’s writing-desk, or the drawing room furniture\n\n104"
          },
          {
            "source": "secret_of_childhood",
            "line": 110,
            "excerpt": "Spontaneous Discipline\n“T’ve written ! I’ve written !”\nReading Came Later\n“New Children”"
          },
          {
            "source": "montessori_method",
            "line": 9738,
            "excerpt": "letters.\n\nThe cards upon which the sandpaper letters are mounted are adapted in\nsize and shape to each letter. The vowels are in light-coloured\nsandpaper and are mounted upon dark cards, the consonant"
          },
          {
            "source": "montessori_method",
            "line": 9765,
            "excerpt": "o!\" As soon as we have given the sound of a letter, we have the child\ntrace it, taking care to show him _how_ to trace it, and if necessary\nguiding the index finger of his right hand over the sandpape"
          },
          {
            "source": "montessori_method",
            "line": 10236,
            "excerpt": "maturity in this respect are: the _regularity_ of the _parallel_ lines\nwhich fill in the geometric figures; the recognition with closed eyes of\nthe sandpaper letters; the security and readiness shown "
          },
          {
            "source": "own_handbook",
            "line": 215,
            "excerpt": "27.  Musical Bells                                                 60\n 28.  Sloping Boards to Display Set of Metal Insets                 90\n 29.  Single Sandpaper Letter                              "
          },
          {
            "source": "own_handbook",
            "line": 216,
            "excerpt": "28.  Sloping Boards to Display Set of Metal Insets                 90\n 29.  Single Sandpaper Letter                                       90\n 30.  Groups of Sandpaper Letters                          "
          },
          {
            "source": "own_handbook",
            "line": 638,
            "excerpt": "(_m_) Two sloping desks and various iron insets.\n  (_n_) Cards on which are pasted sandpaper letters.\n  (_o_) Two alphabets of colored cardboard and\n          of different sizes."
          },
          {
            "source": "pedagogical_anthropology",
            "line": 6094,
            "excerpt": "We must not forget this great principle when, by planning home work\nfor the pupils, we practically keep them housed during the entire day,\nkeeping them for the most part employed in writing or reading"
          },
          {
            "source": "pedagogical_anthropology",
            "line": 13041,
            "excerpt": "the minimum among university students and in general among those who\nhave grown up in an inclosed environment, with the thorax artificially\ncramped by the position assumed while writing or reading at "
          },
          {
            "source": "pedagogical_anthropology",
            "line": 19012,
            "excerpt": "Reflection.\n  Have the ordinary rudiments, such as the alphabet, reading,\n    writing, drawing, arithmetic, been taught to the pupil or not, and\n    can they be taught in his present state?\n  Have his"
          },
          {
            "source": "spontaneous_activity",
            "line": 3921,
            "excerpt": "the child creates and seeks for things organized in themselves; for\ninstance, he desires to compose a design by means of combinations of\ngeometrical figures with the metal insets, and devotes himself "
          },
          {
            "source": "spontaneous_activity",
            "line": 7009,
            "excerpt": "such a selection which makes reasoning possible. When, for example, in\nthe demonstration of the theorem of Pythagoras, children handle the\nvarious pieces of the metal insets, they should start from th"
          },
          {
            "source": "spontaneous_activity",
            "line": 2137,
            "excerpt": "school. The most prevalent of these maladies are spinal curvature and\nmyopia. The first is caused by excessive sitting, and by the injurious\nposition of the shoulders in writing. The second arises fro"
          },
          {
            "source": "elementary_material",
            "line": 2272,
            "excerpt": "cards the sentence which is printed on his slip. He composes this\nsentence in the same way in which he has already composed words with the\nmoveable alphabet. But here the exercise is even more simple "
          },
          {
            "source": "elementary_material",
            "line": 11737,
            "excerpt": "The twenty centimeter ruler divided into millimeters they use constantly\nin design; and they love to calculate the area of the geometric figures\nthey have designed or of the metal insets. Often they c"
          },
          {
            "source": "elementary_material",
            "line": 376,
            "excerpt": "I. THE SCALE                                                    319\n\n  II. THE READING AND WRITING OF MUSIC                            326\n    Treble and Bass Clefs                                    "
          }
        ]
      }
    },
    "development_stages": {
      "absorbent_mind": {
        "sources": [
          "absorbent_mind",
          "secret_of_childhood"
        ],
        "line_ranges": {
          "absorbent_mind": [
            [
              1,
              75
            ],
            [
              259,
              15947
            ]
          ],
          "secret_of_childhood": [
            [
              1994,
              2063
            ]
          ]
        },
        "total_matches": 418,
        "key_passages": [
          {
            "source": "absorbent_mind",
            "line": 23,
            "excerpt": "THE ABSORBENT MIND"
          },
          {
            "source": "absorbent_mind",
            "line": 289,
            "excerpt": "THE ABSORBENT MIND"
          },
          {
            "source": "absorbent_mind",
            "line": 326,
            "excerpt": "THE ABSORBENT MIND"
          },
          {
            "source": "secret_of_childhood",
            "line": 2029,
            "excerpt": "what it needs for its making and could not procure for\nitself In short, the adult must continue to provide a\nsuitable environment for the psychic embryo, just as\nnature, in the guide of the mother, pr"
          }
        ]
      },
      "planes": {
        "sources": [
          "pedagogical_anthropology",
          "spontaneous_activity",
          "own_handbook"
        ],
        "line_ranges": {
          "own_handbook": [
            [
              1399,
              1464
            ]
          ],
          "pedagogical_anthropology": [
            [
              5034,
              5107
            ],
            [
              6635,
              6708
            ],
            [
              7207,
              7280
            ]
          ],
          "spontaneous_activity": [
            [
              2168,
              2231
            ]
          ]
        },
        "total_matches": 5,
        "key_passages": [
          {
            "source": "own_handbook",
            "line": 1433,
            "excerpt": "difficult, such as trapezium, and decagon. They also show great\npleasure in listening to the exact pronunciation of new words and in\ntheir repetition. Early childhood is, in fact, the age in which\nlan"
          },
          {
            "source": "pedagogical_anthropology",
            "line": 5070,
            "excerpt": "This increase is not regular, but proceeds by periodic impulses that in\nearly childhood seem to recur at intervals of three years.\n\nThus for example the increase"
          },
          {
            "source": "pedagogical_anthropology",
            "line": 6676,
            "excerpt": "developed normally up to the age of nine, after which period an arrest\nof development occurred, both physical and psychic. An arrest of the\ngenital organs dates back also to early childhood. His intel"
          },
          {
            "source": "pedagogical_anthropology",
            "line": 7245,
            "excerpt": "There are cases, however, in which the arrest of development is not to\nbe attributed to some wasting disease, or to the denutrition resulting\nfrom it; but rather to some acute illness occurring in ear"
          },
          {
            "source": "spontaneous_activity",
            "line": 2198,
            "excerpt": "usually appears is that of second infancy, hence its name of\n    spinal curvature of the adolescent; spinal curvature caused\n    by rickets, which appears in early childhood, is rarer, and\n    is of l"
          }
        ]
      },
      "nebulae": {
        "sources": [
          "absorbent_mind",
          "spontaneous_activity",
          "pedagogical_anthropology"
        ],
        "line_ranges": {
          "absorbent_mind": [
            [
              32,
              95
            ],
            [
              279,
              343
            ],
            [
              1046,
              1107
            ],
            [
              3056,
              3130
            ],
            [
              13497,
              13569
            ],
            [
              15736,
              15799
            ]
          ],
          "pedagogical_anthropology": [
            [
              2637,
              3145
            ],
            [
              5513,
              5583
            ],
            [
              6163,
              6228
            ],
            [
              8629,
              8695
            ],
            [
              23255,
              23319
            ]
          ],
          "spontaneous_activity": [
            [
              824,
              913
            ],
            [
              3889,
              4058
            ]
          ]
        },
        "total_matches": 24,
        "key_passages": [
          {
            "source": "absorbent_mind",
            "line": 13539,
            "excerpt": "ignorance of us who look for pearls in oyster shells, for \ngold in rocks, for coal in the very entrails of the earth, \nbut ignore the spiritual germs, the nebulae of creation, \nwhich the child hides w"
          },
          {
            "source": "absorbent_mind",
            "line": 62,
            "excerpt": "obstructed, all the characteristics of the human per^bnal- \nity. This achievement by a being, weak in its physical \npowers, who is born with great potentialities, but prac- \ntically without any of the"
          },
          {
            "source": "absorbent_mind",
            "line": 312,
            "excerpt": "ledge only ; it must take a different path. The con- \nsideration of personality, the development of human \npotentialities must become the centre of education. When \nto begin such education ?"
          },
          {
            "source": "pedagogical_anthropology",
            "line": 2671,
            "excerpt": "According to Mendel's hypothesis, all these hybrids with round seed and\nyellow cotyledons, contain sexual cells of opposite potentialities,\nnumerically equal and corresponding to the antagonistic char"
          },
          {
            "source": "pedagogical_anthropology",
            "line": 2675,
            "excerpt": "the parent plants. That is, they must have in their pollen grains and\ntheir ovarian cells all the possible combinations of their different\npotentialities.\n\nThey should produce in equal quantities:"
          },
          {
            "source": "pedagogical_anthropology",
            "line": 2747,
            "excerpt": "the acceptance of Mendel's hypothesis as the true interpretation of\nthe phenomena that are shown to take place within the sexual cells;\nthe germinal cells of the hybrid contain potentialities belongin"
          },
          {
            "source": "spontaneous_activity",
            "line": 872,
            "excerpt": "carried on for a few months by their mothers, but their task is a more\nlaborious, complex, and difficult one. When they are born they possess\nnothing but potentialities; they have to do everything in "
          },
          {
            "source": "spontaneous_activity",
            "line": 3924,
            "excerpt": "work with the greatest intensity until he has completed it. Again, we\nsee a child occupied for seven or eight consecutive days with the same\nwork. Another child becomes interested in the potentialitie"
          },
          {
            "source": "spontaneous_activity",
            "line": 4020,
            "excerpt": "same conditions as the first child, the second would recognize the\nsixty-four colors. The judgment we should give in such a case would be\nbased upon an external factor, not upon internal potentialitie"
          }
        ]
      }
    },
    "child_psychology": {
      "independence": {
        "sources": [
          "pedagogical_anthropology",
          "own_handbook",
          "spontaneous_activity",
          "secret_of_childhood",
          "montessori_method",
          "absorbent_mind",
          "elementary_material"
        ],
        "line_ranges": {
          "absorbent_mind": [
            [
              79,
              252
            ],
            [
              2706,
              2768
            ],
            [
              3098,
              3168
            ],
            [
              4689,
              5266
            ],
            [
              5487,
              5553
            ],
            [
              6822,
              6913
            ],
            [
              7039,
              7116
            ],
            [
              7665,
              7740
            ],
            [
              8327,
              8416
            ],
            [
              9250,
              9324
            ],
            [
              10541,
              10613
            ],
            [
              11092,
              11157
            ],
            [
              11259,
              11386
            ],
            [
              12017,
              12099
            ],
            [
              12966,
              13035
            ],
            [
              13257,
              13319
            ],
            [
              13911,
              13981
            ],
            [
              14865,
              14930
            ],
            [
              15129,
              15209
            ]
          ],
          "secret_of_childhood": [
            [
              8150,
              8247
            ],
            [
              8362,
              8446
            ],
            [
              8865,
              8935
            ]
          ],
          "montessori_method": [
            [
              274,
              334
            ],
            [
              1181,
              1366
            ],
            [
              2988,
              3057
            ],
            [
              3489,
              3577
            ],
            [
              4233,
              4469
            ],
            [
              9315,
              9391
            ],
            [
              10770,
              10834
            ],
            [
              12669,
              12788
            ]
          ],
          "own_handbook": [
            [
              1991,
              2054
            ]
          ],
          "pedagogical_anthropology": [
            [
              1448,
              1522
            ],
            [
              1939,
              1999
            ],
            [
              2147,
              2232
            ],
            [
              2360,
              2468
            ],
            [
              2723,
              2794
            ],
            [
              4605,
              4686
            ],
            [
              9167,
              9237
            ],
            [
              9405,
              9468
            ],
            [
              11726,
              11814
            ],
            [
              13620,
              13689
            ],
            [
              20806,
              20874
            ]
          ],
          "spontaneous_activity": [
            [
              3344,
              3408
            ],
            [
              4520,
              4592
            ],
            [
              6031,
              6204
            ],
            [
              6391,
              6471
            ],
            [
              7359,
              7562
            ],
            [
              10509,
              10602
            ]
          ],
          "elementary_material": [
            [
              6137,
              6208
            ],
            [
              8792,
              8887
            ],
            [
              14976,
              15037
            ]
          ]
        },
        "total_matches": 120,
        "key_passages": [
          {
            "source": "absorbent_mind",
            "line": 122,
            "excerpt": "VII. The Psycho-embryonic Life . . .107 \n\nVIII. The Conquest of Independence . .122 \n\nIX. Care to be taken at Life's Beginning . 1 38"
          },
          {
            "source": "absorbent_mind",
            "line": 215,
            "excerpt": "The Cerebellum at the base of the brain \n\nDiagram. Tendencies towards Independence \n\nDevelopment of Language"
          },
          {
            "source": "absorbent_mind",
            "line": 4720,
            "excerpt": "CHAPTER VIII \nTHE CONQUEST OF INDEPENDENCE \n\nTHE characteristics of regression are developed when the"
          },
          {
            "source": "secret_of_childhood",
            "line": 8402,
            "excerpt": "ment of individuality, and of what 1s called the free-\ndom of the child, can be nothmg else than his pro-\ngressive independence of the adult, realised by means\nof a suitable environment im which he ca"
          },
          {
            "source": "secret_of_childhood",
            "line": 8412,
            "excerpt": "The absurd mistake m envisaging the freedom of\nthe child in education has Jam in imaging his hypo-\nthetical independence of the adult without correspond-\nimg preparation of the environment. This prepa"
          },
          {
            "source": "secret_of_childhood",
            "line": 8199,
            "excerpt": "particular consequences are considered as separate\ndefects, to be studied and dealt with separately as\nthough they were actually independent of each other.\n\nOne of the chief of such particular consequ"
          },
          {
            "source": "montessori_method",
            "line": 304,
            "excerpt": "Discipline through liberty                                      86\n\n    Independence                                                    95\n\n    Abolition of prizes and external forms of punishment    "
          },
          {
            "source": "montessori_method",
            "line": 4263,
            "excerpt": "of truth_, revealing his nature. For all these reasons, the first form\nof educational intervention must tend to lead the child toward\nindependence."
          },
          {
            "source": "montessori_method",
            "line": 4266,
            "excerpt": "INDEPENDENCE\n\nNo one can be free unless he is independent: therefore, the first,"
          },
          {
            "source": "own_handbook",
            "line": 2022,
            "excerpt": "fundamental type which is common to all. They have _coordinated_ their\nmovements in various kinds of manual work about the house, and so have\nacquired a characteristic independence of action, and init"
          },
          {
            "source": "pedagogical_anthropology",
            "line": 2754,
            "excerpt": "But in the phenomena of hybridism, we have seen the results of\nanother fact which determines Mendel's third law; the _Law of_ _the\nIndependence of Characteristics_.\n\nThat is, that while the original p"
          },
          {
            "source": "pedagogical_anthropology",
            "line": 11774,
            "excerpt": "The man, or rather the beardless youth who is just beginning to feel\nhimself a man, and therefore hopes for independence, holds his head\nproudly level; but the very pretty woman seated beside him hold"
          },
          {
            "source": "pedagogical_anthropology",
            "line": 13650,
            "excerpt": "One characteristic of man, equally with that of standing in an erect\nposition, supported only on the lower limbs, is the independence of\nthe upper limbs, which are raised from the ground and relieved "
          },
          {
            "source": "spontaneous_activity",
            "line": 3374,
            "excerpt": "the objects they had at first despised as silly playthings,\n    they began to discover a novel interest, and, as a result of\n    this new interest, they began to act as independent\n    individuals.\" M"
          },
          {
            "source": "spontaneous_activity",
            "line": 4559,
            "excerpt": "which are necessary in the presence of science.\n\nAmong its devotees we find \"characteristics\" independent of the\ncontent of thought; in short, physicists, chemists, astronomers,\nbotanists, and zoologi"
          },
          {
            "source": "spontaneous_activity",
            "line": 6070,
            "excerpt": "out and walk away from it.\n\nThe stronger we are in such exercises, the more independent we shall\nbe of others. Clarity of ideas, the mechanism of the habit of\ndecision, give us a sense of liberty. The"
          },
          {
            "source": "elementary_material",
            "line": 8835,
            "excerpt": "the _Cuore_ of De Amicis, episodes of the life of Jesus, _Uncle Tom's\nCabin_, _The Betrothed_ (_I promessi sposi_ of Manzoni), _Fabiola_,\nstories from the Italian wars for independence (Nineteenth Cen"
          },
          {
            "source": "elementary_material",
            "line": 15007,
            "excerpt": "patriotism, or their opposites, affectionateness,\n     honesty, modest, neatness, generosity, kindness,\n     independence, etc. The social relationships between\n     husband and wife (rights, privileg"
          },
          {
            "source": "elementary_material",
            "line": 6177,
            "excerpt": "(Compound Sentences)\n\nThe clauses are independent of each other. Each contains a complete\nmeaning, and each therefore could stand alone. It is a question of\nsimple sentences _coordinated_ with each ot"
          }
        ]
      },
      "will": {
        "sources": [
          "pedagogical_anthropology",
          "own_handbook",
          "spontaneous_activity",
          "secret_of_childhood",
          "montessori_method",
          "absorbent_mind",
          "elementary_material"
        ],
        "line_ranges": {
          "absorbent_mind": [
            [
              252,
              1237
            ],
            [
              1342,
              1451
            ],
            [
              1646,
              2027
            ],
            [
              2230,
              2527
            ],
            [
              2866,
              3091
            ],
            [
              3208,
              3439
            ],
            [
              3554,
              3736
            ],
            [
              3854,
              4499
            ],
            [
              4629,
              5140
            ],
            [
              5295,
              5368
            ],
            [
              5535,
              5879
            ],
            [
              5999,
              6132
            ],
            [
              6239,
              7136
            ],
            [
              7240,
              7509
            ],
            [
              7618,
              7911
            ],
            [
              8044,
              8830
            ],
            [
              8949,
              9095
            ],
            [
              9318,
              9381
            ],
            [
              9595,
              10254
            ],
            [
              10509,
              11023
            ],
            [
              11209,
              11488
            ],
            [
              11639,
              12404
            ],
            [
              12572,
              12873
            ],
            [
              13110,
              13278
            ],
            [
              13497,
              13651
            ],
            [
              13794,
              13935
            ],
            [
              14127,
              15478
            ],
            [
              15678,
              16123
            ]
          ],
          "secret_of_childhood": [
            [
              68,
              153
            ],
            [
              351,
              1150
            ],
            [
              1317,
              1934
            ],
            [
              2063,
              2136
            ],
            [
              2259,
              2400
            ],
            [
              2529,
              2941
            ],
            [
              3073,
              3135
            ],
            [
              3255,
              5437
            ],
            [
              5572,
              5692
            ],
            [
              5828,
              5922
            ],
            [
              6073,
              6152
            ],
            [
              6288,
              6525
            ],
            [
              6658,
              6735
            ],
            [
              6896,
              6979
            ],
            [
              7090,
              7451
            ],
            [
              7600,
              7960
            ],
            [
              8066,
              8299
            ],
            [
              8409,
              8563
            ],
            [
              8753,
              9199
            ],
            [
              9344,
              9580
            ],
            [
              9719,
              9788
            ],
            [
              9987,
              10308
            ]
          ],
          "montessori_method": [
            [
              1,
              127
            ],
            [
              574,
              831
            ],
            [
              959,
              2301
            ],
            [
              2423,
              2794
            ],
            [
              2988,
              3416
            ],
            [
              3577,
              5131
            ],
            [
              5305,
              5369
            ],
            [
              5471,
              5802
            ],
            [
              6163,
              6254
            ],
            [
              6391,
              6730
            ],
            [
              6908,
              7017
            ],
            [
              7171,
              9199
            ],
            [
              9470,
              10244
            ],
            [
              10378,
              10998
            ],
            [
              11139,
              11455
            ],
            [
              11781,
              13135
            ]
          ],
          "own_handbook": [
            [
              1,
              759
            ],
            [
              883,
              1622
            ],
            [
              1814,
              3318
            ]
          ],
          "pedagogical_anthropology": [
            [
              1,
              162
            ],
            [
              599,
              2066
            ],
            [
              2259,
              2865
            ],
            [
              3040,
              3800
            ],
            [
              3941,
              4212
            ],
            [
              4479,
              5053
            ],
            [
              5184,
              5641
            ],
            [
              5927,
              5990
            ],
            [
              6471,
              6647
            ],
            [
              6991,
              7107
            ],
            [
              7344,
              7408
            ],
            [
              7752,
              7819
            ],
            [
              7994,
              8152
            ],
            [
              8351,
              8578
            ],
            [
              8697,
              9201
            ],
            [
              9615,
              9798
            ],
            [
              9930,
              10160
            ],
            [
              10432,
              10548
            ],
            [
              11119,
              11182
            ],
            [
              11283,
              11561
            ],
            [
              11764,
              11970
            ],
            [
              12140,
              12226
            ],
            [
              12751,
              13092
            ],
            [
              13452,
              13596
            ],
            [
              13890,
              13958
            ],
            [
              14632,
              14766
            ],
            [
              14963,
              15435
            ],
            [
              15691,
              16875
            ],
            [
              17047,
              17128
            ],
            [
              17303,
              17655
            ],
            [
              17760,
              18114
            ],
            [
              18521,
              19084
            ],
            [
              19284,
              19560
            ],
            [
              19736,
              19991
            ],
            [
              20198,
              20861
            ],
            [
              21059,
              21519
            ],
            [
              23884,
              24215
            ]
          ],
          "spontaneous_activity": [
            [
              1,
              165
            ],
            [
              277,
              402
            ],
            [
              529,
              2630
            ],
            [
              2770,
              9267
            ],
            [
              9373,
              11720
            ]
          ],
          "elementary_material": [
            [
              1,
              154
            ],
            [
              583,
              804
            ],
            [
              957,
              1483
            ],
            [
              2045,
              2833
            ],
            [
              2950,
              3066
            ],
            [
              3282,
              3359
            ],
            [
              3498,
              3568
            ],
            [
              3692,
              3766
            ],
            [
              4311,
              4823
            ],
            [
              4962,
              5530
            ],
            [
              5748,
              6119
            ],
            [
              6283,
              6385
            ],
            [
              6538,
              6598
            ],
            [
              6715,
              6945
            ],
            [
              7048,
              7452
            ],
            [
              7691,
              8008
            ],
            [
              8121,
              8187
            ],
            [
              8479,
              8545
            ],
            [
              8736,
              9737
            ],
            [
              9883,
              10969
            ],
            [
              11201,
              11417
            ],
            [
              11605,
              11678
            ],
            [
              11838,
              12070
            ],
            [
              12283,
              12372
            ],
            [
              12512,
              12590
            ],
            [
              12694,
              13189
            ],
            [
              13300,
              13643
            ],
            [
              13816,
              13880
            ],
            [
              14046,
              14145
            ],
            [
              14420,
              14582
            ],
            [
              15046,
              15150
            ],
            [
              15330,
              16089
            ],
            [
              16208,
              17482
            ]
          ]
        },
        "total_matches": 2014,
        "key_passages": [
          {
            "source": "absorbent_mind",
            "line": 283,
            "excerpt": "bution, it may be true, but how many philosophers are \nthere in the ultra -civilised world of today and how many \nhave there been before and how many more will there be \n\nI"
          },
          {
            "source": "absorbent_mind",
            "line": 384,
            "excerpt": "applies psychology to children, it is the children them- \nselves who teach psychology to the professor. This may \nseem obscure but it will become immediately clear if we \ngo somewhat more into detail "
          },
          {
            "source": "absorbent_mind",
            "line": 387,
            "excerpt": "go somewhat more into detail : the child has a type of \nmind that absorbs knowledge and instructs himself. A \nsuperficial observation will be sufficient to show this. \nThe child of two speaks the lang"
          },
          {
            "source": "secret_of_childhood",
            "line": 381,
            "excerpt": "tain the conflict through which he passes in tus rela-\ntions with grown-up persons and with his social envi-\nronment. It 1s clear that this approach will lead us\naway from psycho-analytic theories and"
          },
          {
            "source": "secret_of_childhood",
            "line": 406,
            "excerpt": "disease and remedial treatment The problem of the\nchild psyche contains a prophylactic where psycho-\nanalysis 1s concerned, for it will affect the normal and\ngeneral treatment of mfant humanity, a tre"
          },
          {
            "source": "secret_of_childhood",
            "line": 521,
            "excerpt": "conflicts endangermg its psychic life, there 1s a first\nfundamental, essential step to be taken, from which\nall will depend—the modification of the adult In-\ndeed .f the adult 1s already doing all he "
          },
          {
            "source": "montessori_method",
            "line": 8,
            "excerpt": "of the Project Gutenberg License included with this ebook or online\nat www.gutenberg.org. If you are not located in the United States,\nyou will have to check the laws of the country where you are loca"
          },
          {
            "source": "montessori_method",
            "line": 605,
            "excerpt": "Obedience is naturally sacrifice                               363\n\n    Obedience develops will-power and the capacity to perform the\n    act it becomes necessary to obey                              "
          },
          {
            "source": "montessori_method",
            "line": 712,
            "excerpt": "highly formal training of separate sensory, motor, and mental\ncapacities; and it leads to rapid, easy, and substantial mastery of the\nelements of reading, writing, and arithmetic. All this will be app"
          },
          {
            "source": "own_handbook",
            "line": 8,
            "excerpt": "of the Project Gutenberg License included with this ebook or online\nat www.gutenberg.org. If you are not located in the United States,\nyou will have to check the laws of the country where you are loca"
          },
          {
            "source": "own_handbook",
            "line": 138,
            "excerpt": "Helen, clasp to your heart these little children, since they, above\nall others, will understand you. They are your younger brothers: when,\nwith bandaged eyes and in silence, they touch with their litt"
          },
          {
            "source": "own_handbook",
            "line": 251,
            "excerpt": "In this way what is practically a new race is coming into being, a\nrace more highly developed, finer and more robust; a race which will\nbe capable of offering resistance to insidious disease."
          },
          {
            "source": "pedagogical_anthropology",
            "line": 8,
            "excerpt": "of the Project Gutenberg License included with this ebook or online\nat www.gutenberg.org. If you are not located in the United States,\nyou will have to check the laws of the country where you are loca"
          },
          {
            "source": "pedagogical_anthropology",
            "line": 124,
            "excerpt": "regeneration of mankind.\n\nIf in the future a scientific pedagogy is destined to rise, it will\ndevote itself to the education of men already rendered physically\nbetter through the agency of the allied "
          },
          {
            "source": "pedagogical_anthropology",
            "line": 631,
            "excerpt": "to be of interest to us. The Lombrosian theories, by raising these\nproblems, have not only shaken the foundations of penal law, but have\neven brought about a moral renovation of conscience. We will le"
          },
          {
            "source": "spontaneous_activity",
            "line": 8,
            "excerpt": "of the Project Gutenberg License included with this ebook or online\nat www.gutenberg.org. If you are not located in the United States,\nyou will have to check the laws of the country where you are loca"
          },
          {
            "source": "spontaneous_activity",
            "line": 135,
            "excerpt": "of development\n\n  Domination of the child's will the basis of education\n\nIt is the teacher who forms the child's mind. How he teaches."
          },
          {
            "source": "spontaneous_activity",
            "line": 307,
            "excerpt": "CHAPTER VII\n\nWILL\n\n  Its relation to attention"
          },
          {
            "source": "elementary_material",
            "line": 8,
            "excerpt": "of the Project Gutenberg License included with this ebook or online\nat www.gutenberg.org. If you are not located in the United States,\nyou will have to check the laws of the country where you are loca"
          },
          {
            "source": "elementary_material",
            "line": 47,
            "excerpt": "[Transcriber's Notes: Bold text is surrounded by =equal signs= and\nitalic text by _underscores_. Superscripted text will be precede by a ^\nand surrounded by {braces}."
          },
          {
            "source": "elementary_material",
            "line": 117,
            "excerpt": "faithful rendition of her work. But it is only in these respects that\nthe chapters devoted to these subjects are to be considered a\ntranslation. It will be observed that Dr. Montessori's text is not o"
          }
        ]
      },
      "character": {
        "sources": [
          "pedagogical_anthropology",
          "own_handbook",
          "spontaneous_activity",
          "secret_of_childhood",
          "montessori_method",
          "absorbent_mind",
          "elementary_material"
        ],
        "line_ranges": {
          "absorbent_mind": [
            [
              110,
              560
            ],
            [
              695,
              927
            ],
            [
              1203,
              1393
            ],
            [
              1577,
              1786
            ],
            [
              3110,
              3171
            ],
            [
              3836,
              4140
            ],
            [
              4586,
              4689
            ],
            [
              5624,
              5691
            ],
            [
              7064,
              7318
            ],
            [
              7450,
              7510
            ],
            [
              7944,
              8029
            ],
            [
              8187,
              8278
            ],
            [
              8875,
              8939
            ],
            [
              9097,
              9334
            ],
            [
              9926,
              10070
            ],
            [
              10410,
              11068
            ],
            [
              11177,
              12640
            ],
            [
              13078,
              13524
            ],
            [
              13668,
              13738
            ],
            [
              13911,
              13996
            ],
            [
              14127,
              14320
            ],
            [
              14423,
              14664
            ],
            [
              14816,
              14886
            ],
            [
              15763,
              15823
            ]
          ],
          "secret_of_childhood": [
            [
              174,
              376
            ],
            [
              564,
              635
            ],
            [
              1534,
              1633
            ],
            [
              3447,
              3531
            ],
            [
              3960,
              4637
            ],
            [
              4779,
              4843
            ],
            [
              5212,
              5276
            ],
            [
              6345,
              6422
            ],
            [
              6896,
              7122
            ],
            [
              7504,
              7913
            ],
            [
              8200,
              8281
            ],
            [
              8396,
              8507
            ],
            [
              8861,
              8935
            ],
            [
              9306,
              9443
            ]
          ],
          "montessori_method": [
            [
              1047,
              1137
            ],
            [
              1283,
              1366
            ],
            [
              1672,
              1859
            ],
            [
              2301,
              2478
            ],
            [
              2669,
              2741
            ],
            [
              3966,
              4027
            ],
            [
              4622,
              4688
            ],
            [
              8009,
              8085
            ],
            [
              8346,
              8428
            ],
            [
              10725,
              10788
            ],
            [
              11381,
              11444
            ],
            [
              11751,
              11816
            ],
            [
              12000,
              12102
            ],
            [
              12416,
              12583
            ]
          ],
          "own_handbook": [
            [
              276,
              446
            ],
            [
              1904,
              1979
            ],
            [
              2081,
              2159
            ]
          ],
          "pedagogical_anthropology": [
            [
              106,
              1207
            ],
            [
              1319,
              1386
            ],
            [
              1616,
              1893
            ],
            [
              2038,
              2112
            ],
            [
              2468,
              2899
            ],
            [
              3008,
              3198
            ],
            [
              4002,
              4265
            ],
            [
              4379,
              4537
            ],
            [
              4641,
              4717
            ],
            [
              6278,
              6772
            ],
            [
              6991,
              7080
            ],
            [
              7280,
              7830
            ],
            [
              8608,
              8674
            ],
            [
              9157,
              9222
            ],
            [
              11119,
              11195
            ],
            [
              11544,
              11606
            ],
            [
              12291,
              12358
            ],
            [
              13043,
              13128
            ],
            [
              13809,
              14145
            ],
            [
              15101,
              15289
            ],
            [
              15711,
              16080
            ],
            [
              16406,
              16470
            ],
            [
              17917,
              18128
            ],
            [
              18497,
              18578
            ],
            [
              18883,
              18991
            ],
            [
              19101,
              19430
            ],
            [
              19639,
              19721
            ],
            [
              19906,
              20535
            ],
            [
              23062,
              23144
            ],
            [
              23367,
              23429
            ]
          ],
          "spontaneous_activity": [
            [
              209,
              363
            ],
            [
              627,
              853
            ],
            [
              1321,
              1436
            ],
            [
              1654,
              1719
            ],
            [
              1831,
              1908
            ],
            [
              2034,
              2098
            ],
            [
              2737,
              2972
            ],
            [
              3175,
              3529
            ],
            [
              3687,
              4080
            ],
            [
              4196,
              4318
            ],
            [
              4457,
              4648
            ],
            [
              5139,
              5604
            ],
            [
              5746,
              6955
            ],
            [
              7188,
              7262
            ],
            [
              7965,
              8063
            ]
          ],
          "elementary_material": [
            [
              126,
              219
            ],
            [
              704,
              782
            ],
            [
              2225,
              2300
            ],
            [
              5595,
              5661
            ],
            [
              7913,
              7981
            ],
            [
              10421,
              10487
            ],
            [
              10790,
              10854
            ],
            [
              11992,
              12063
            ],
            [
              12229,
              12449
            ],
            [
              12658,
              12719
            ],
            [
              13231,
              13309
            ],
            [
              16958,
              17073
            ]
          ]
        },
        "total_matches": 438,
        "key_passages": [
          {
            "source": "absorbent_mind",
            "line": 141,
            "excerpt": "XVIII. Further Elaboration through Culture and Imagi- \nnation . . . .261 \nXIX. Character and its Defects in Young Children . 276 \nXX. A Social Contribution of the Child : Normal- \nization. .... 288"
          },
          {
            "source": "absorbent_mind",
            "line": 144,
            "excerpt": "XX. A Social Contribution of the Child : Normal- \nization. .... 288 \nXXI. Character- building a Conquest, not a Defence . 302 \nXXII. The Sublimation of Possessiveness . .315"
          },
          {
            "source": "absorbent_mind",
            "line": 227,
            "excerpt": "Normal and deviated features of the child's \nCharacter .... \n\nCircles of attraction towards superior and"
          },
          {
            "source": "secret_of_childhood",
            "line": 6391,
            "excerpt": "of “intellectual calm” It has always been recoguised\nthat a teacher must be calm, but the calm demanded\nwas one of character and nerves Here was a deeper\ncalm , a state of emptmess or better of freedo"
          },
          {
            "source": "secret_of_childhood",
            "line": 6929,
            "excerpt": "play itself in outward act\n\nThere is an explosive character in facts that anse\nsuddenly, as sure heralds of a development that will\nfollow after It is the same as when one day, of a"
          },
          {
            "source": "secret_of_childhood",
            "line": 7003,
            "excerpt": "OpseRVING the features that disappear with normal-\nasation, we find to our surprise that these embrace\nnearly the whole of what are considered as character-\nistics of childhood. Not only untidiness, d"
          },
          {
            "source": "montessori_method",
            "line": 1313,
            "excerpt": "for impressing the letters--especially because of its novel use of the\nsense of touch--that the children learn how to make the whole alphabet\nbefore the abstract and formal character of the material l"
          },
          {
            "source": "montessori_method",
            "line": 1322,
            "excerpt": "knows how to pronounce. It is at just this point that the teaching of\nEnglish reading by the Montessori method will find its greatest\nobstacle. Indeed, it is the unphonetic character of English spelli"
          },
          {
            "source": "montessori_method",
            "line": 1715,
            "excerpt": "toward the light, while others fly from it. He investigates these and\nlike phenomena; having always in mind this question: whether the fleeing\nfrom or running to the stimulus be of the same character "
          },
          {
            "source": "own_handbook",
            "line": 310,
            "excerpt": "future to benefit and to reenforce their inner life, which is the real\n_human life_. On the same positive lines science will proceed to\ndirect the development of the intelligence, of character, and of"
          },
          {
            "source": "own_handbook",
            "line": 401,
            "excerpt": "is for this reason that certain principles which it enunciates,\ntogether with that part which deals with the technique of their\npractical application, are not of a general character, but have\nspecial "
          },
          {
            "source": "own_handbook",
            "line": 414,
            "excerpt": "If to-day we possessed statistics respecting the nervous debility,\ndefects of speech, errors of perception and of reasoning, and lack of\ncharacter in normal children, it would perhaps be interesting t"
          },
          {
            "source": "pedagogical_anthropology",
            "line": 136,
            "excerpt": "century, must result in a correspondingly _transformed man_; or else\ncivilisation must come to a halt before the obstacle offered by a human\nrace lacking in organic strength and character.\n\nThe presen"
          },
          {
            "source": "pedagogical_anthropology",
            "line": 248,
            "excerpt": "of the Brain(247)--Human Intelligence(252)--Influence of\n    Mental Exercise(254)--Pretended Cerebral Inferiority of\n    Woman(256)--Limits of the Face(259)--Human Character of the\n    Face(260)--Norm"
          },
          {
            "source": "pedagogical_anthropology",
            "line": 398,
            "excerpt": "Zoology consequently includes a vast but well-defined field.\nFundamentally, it is a _descriptive_ science, and when the general\ncharacter of the individual living creatures has been determined, it\npro"
          },
          {
            "source": "spontaneous_activity",
            "line": 332,
            "excerpt": "Fallacy of educating the child's will by \"breaking it\"\n\n  \"Character\" the result of established will, not\n  of emulation"
          },
          {
            "source": "spontaneous_activity",
            "line": 664,
            "excerpt": "Something analogous has been happening with regard to the inner life\nof the child. We are beset by such anxieties as these: it is necessary\nto form character, to develop the intelligence, to aid the u"
          },
          {
            "source": "spontaneous_activity",
            "line": 670,
            "excerpt": "their babies or strap down their ears. And we conceal our anxiety\nbeneath a certain mediocre success, for it is a fact that men do grow\nup possessing character, intelligence and feeling. But when all "
          },
          {
            "source": "elementary_material",
            "line": 171,
            "excerpt": "new. In cases where it proved impossible to utilize any of the Italian\nmaterial, an attempt has been made to find sentences illustrating the\nsame pedagogical principle and involving the same number an"
          },
          {
            "source": "elementary_material",
            "line": 186,
            "excerpt": "metrics has been translated entire as an illustration of method; whereas\nthe portion relating to English is, as explained below, entirely of\nspeculative character.\n\nTo Miss Helen Parkhurst and Miss Em"
          },
          {
            "source": "elementary_material",
            "line": 745,
            "excerpt": "provide for the study of two or more parts of speech. However, our\nexperiments have enabled us to make the exercises very specific in\ncharacter; so that the teacher has at her disposal not only a thor"
          }
        ]
      },
      "emotions": {
        "sources": [
          "pedagogical_anthropology",
          "own_handbook",
          "spontaneous_activity",
          "secret_of_childhood",
          "montessori_method",
          "absorbent_mind",
          "elementary_material"
        ],
        "line_ranges": {
          "absorbent_mind": [
            [
              521,
              587
            ],
            [
              1323,
              1503
            ],
            [
              1732,
              1914
            ],
            [
              3656,
              3736
            ],
            [
              3891,
              3951
            ],
            [
              4620,
              4805
            ],
            [
              5266,
              5345
            ],
            [
              7284,
              7358
            ],
            [
              8152,
              8223
            ],
            [
              8619,
              8830
            ],
            [
              9167,
              9334
            ],
            [
              9683,
              9785
            ],
            [
              9965,
              10039
            ],
            [
              10658,
              10989
            ],
            [
              11127,
              11223
            ],
            [
              11365,
              11448
            ],
            [
              11643,
              11874
            ],
            [
              12197,
              12265
            ],
            [
              12624,
              12699
            ],
            [
              12827,
              12918
            ],
            [
              14164,
              14237
            ],
            [
              14338,
              14400
            ],
            [
              14602,
              14816
            ],
            [
              15158,
              15339
            ],
            [
              15478,
              15724
            ],
            [
              16082,
              16144
            ]
          ],
          "secret_of_childhood": [
            [
              130,
              200
            ],
            [
              950,
              1046
            ],
            [
              1153,
              1241
            ],
            [
              1725,
              1908
            ],
            [
              2121,
              2311
            ],
            [
              2412,
              2608
            ],
            [
              2871,
              3044
            ],
            [
              3231,
              3342
            ],
            [
              3517,
              3598
            ],
            [
              3741,
              4059
            ],
            [
              4194,
              4264
            ],
            [
              4541,
              4737
            ],
            [
              4926,
              5227
            ],
            [
              5366,
              5575
            ],
            [
              5899,
              6123
            ],
            [
              6402,
              6468
            ],
            [
              6573,
              6661
            ],
            [
              7278,
              7412
            ],
            [
              7779,
              7957
            ],
            [
              8753,
              8824
            ],
            [
              9897,
              9970
            ],
            [
              10241,
              10303
            ]
          ],
          "montessori_method": [
            [
              1819,
              1889
            ],
            [
              2006,
              2180
            ],
            [
              2749,
              2961
            ],
            [
              3376,
              3441
            ],
            [
              4071,
              4205
            ],
            [
              4379,
              4450
            ],
            [
              4804,
              4913
            ],
            [
              5864,
              6014
            ],
            [
              6115,
              6187
            ],
            [
              6551,
              6616
            ],
            [
              6800,
              6957
            ],
            [
              7593,
              7705
            ],
            [
              7812,
              7910
            ],
            [
              8268,
              8337
            ],
            [
              9743,
              9808
            ],
            [
              10081,
              10255
            ],
            [
              10592,
              10664
            ],
            [
              10864,
              10934
            ],
            [
              11882,
              11960
            ],
            [
              12172,
              12811
            ]
          ],
          "own_handbook": [
            [
              111,
              176
            ],
            [
              636,
              715
            ],
            [
              864,
              1048
            ],
            [
              1671,
              1734
            ],
            [
              1878,
              1979
            ],
            [
              2915,
              2978
            ]
          ],
          "pedagogical_anthropology": [
            [
              180,
              251
            ],
            [
              1236,
              1319
            ],
            [
              3493,
              3563
            ],
            [
              4048,
              4184
            ],
            [
              4349,
              4488
            ],
            [
              5487,
              5571
            ],
            [
              6216,
              6288
            ],
            [
              6389,
              6516
            ],
            [
              6714,
              6778
            ],
            [
              10023,
              10094
            ],
            [
              11724,
              11788
            ],
            [
              12291,
              12546
            ],
            [
              12658,
              12899
            ],
            [
              14058,
              14128
            ],
            [
              14416,
              14486
            ],
            [
              18002,
              18069
            ],
            [
              18427,
              18497
            ],
            [
              18768,
              18830
            ],
            [
              19101,
              19612
            ],
            [
              19919,
              20163
            ],
            [
              20884,
              20946
            ],
            [
              21107,
              21181
            ],
            [
              21424,
              21513
            ],
            [
              22953,
              23013
            ]
          ],
          "spontaneous_activity": [
            [
              90,
              254
            ],
            [
              619,
              817
            ],
            [
              1218,
              1692
            ],
            [
              2034,
              2098
            ],
            [
              2490,
              2558
            ],
            [
              2946,
              3167
            ],
            [
              3431,
              3514
            ],
            [
              4161,
              4223
            ],
            [
              4347,
              4409
            ],
            [
              4514,
              4592
            ],
            [
              4697,
              4919
            ],
            [
              5159,
              5227
            ],
            [
              5613,
              5764
            ],
            [
              5955,
              6112
            ],
            [
              6721,
              6790
            ],
            [
              7032,
              7188
            ],
            [
              7862,
              7925
            ],
            [
              9248,
              9316
            ],
            [
              9564,
              10185
            ],
            [
              10377,
              10476
            ],
            [
              10719,
              10784
            ],
            [
              11134,
              11358
            ]
          ],
          "elementary_material": [
            [
              633,
              704
            ],
            [
              2567,
              2670
            ],
            [
              4935,
              5080
            ],
            [
              6137,
              6242
            ],
            [
              6726,
              6956
            ],
            [
              7328,
              7391
            ],
            [
              8123,
              8230
            ],
            [
              8462,
              8532
            ],
            [
              8960,
              9031
            ],
            [
              11900,
              11965
            ],
            [
              12101,
              12163
            ],
            [
              13231,
              13371
            ],
            [
              13768,
              13834
            ],
            [
              14829,
              14891
            ],
            [
              15553,
              15621
            ],
            [
              17055,
              17134
            ]
          ]
        },
        "total_matches": 357,
        "key_passages": [
          {
            "source": "absorbent_mind",
            "line": 1355,
            "excerpt": "child ; upon the new-born, and the one year old, who \ncreate the personality of man ; and they feel the same \nemotion, the same deep impression as those who in olden \ntimes used to meditate upon death"
          },
          {
            "source": "absorbent_mind",
            "line": 1473,
            "excerpt": "that tremble and of the cheeks, everything vibrating and \nbecoming tense, preparing in silence to reproduce those \nsounds that have caused so much emotion in the un- \nconscious mind. And how is it tha"
          },
          {
            "source": "absorbent_mind",
            "line": 8182,
            "excerpt": "race \". How do we know ? No man of them is left, \nbut the works of man tell us. So that we can see that \nthe hand has followed the intelligence, spirit and emotions, \nand touching all these, has left "
          },
          {
            "source": "secret_of_childhood",
            "line": 1814,
            "excerpt": "We may unagine this marvellous creative activity as\na series of keen emotions, rising up from the subcon-\nscious, and which, by contact with the outer world,\nbuild up human consciousness Starting from"
          },
          {
            "source": "secret_of_childhood",
            "line": 5399,
            "excerpt": "holy angels who are mspiring these children’\n\n“One day, m great emotion, I took my heart m\nmy two hands as though to encourage it to mse to\nthe heights of faith, and I stood respectfully before."
          },
          {
            "source": "secret_of_childhood",
            "line": 5959,
            "excerpt": "head against her, then he took her hand and held it\nbetween his own She said afterwards with much\nemotion that no one had given her such comfort as\nthat child"
          },
          {
            "source": "montessori_method",
            "line": 2104,
            "excerpt": "There does exist, however, an external prize for man; when, for example,\nthe orator sees the faces of his listeners change with the emotions he\nhas awakened, he experiences something so great that it "
          },
          {
            "source": "montessori_method",
            "line": 2791,
            "excerpt": "destroyed. They go to meet the time when the dark dens of vice and\nwretchedness shall have become things of the past, and when no trace of\nthem shall be found among the living.\" What a change of emoti"
          },
          {
            "source": "montessori_method",
            "line": 4101,
            "excerpt": "which had filled his heart, put his arms around her neck, and, still\nsilent and sobbing, kissed her in return. At last, sighing deeply, he\nwiped from his face and eyes the damp traces of his emotion, "
          },
          {
            "source": "own_handbook",
            "line": 1701,
            "excerpt": "impressions of the day, the brightness and clamor, are silenced? It is\nnot that we miss the day, but that our spirit expands. It becomes more\nsensitive to the inner play of emotions, strong and persis"
          },
          {
            "source": "own_handbook",
            "line": 677,
            "excerpt": "direction is given to them, the child's movements are made towards a\ndefinite end, so that he himself grows quiet and contented, and\nbecomes an active worker, a being calm and full of joy. This educat"
          },
          {
            "source": "own_handbook",
            "line": 1017,
            "excerpt": "One day the child will arrange all the rods in their right order, and\nthen, full of joy, he will call the teacher to come and admire them.\nThe object of the exercise will thus be achieved."
          },
          {
            "source": "pedagogical_anthropology",
            "line": 210,
            "excerpt": "Training(91)--Macroscelia and Brachyscelia in Pathological\n    Individuals (De Giovanni's Hyposthenic and Hypersthenic\n    Types)(95)--Types of Stature in Emotional Criminals and in\n    Parasites(101)"
          },
          {
            "source": "pedagogical_anthropology",
            "line": 4083,
            "excerpt": "training.--Macroscelia and brachyscelia in pathologic\n      individuals (DE GIOVANNI'S hyposthenic and hypersthenic\n      types).--Types of stature in emotional criminals and in\n      parasites.--Extr"
          },
          {
            "source": "pedagogical_anthropology",
            "line": 6252,
            "excerpt": "Without reverting to the basic physiological explanations of the\nemotions, as given by Lange and James, we may nevertheless assert that\nsensations of pleasure stimulate the renewal of bodily tissues a"
          },
          {
            "source": "spontaneous_activity",
            "line": 121,
            "excerpt": "With man the life of the body depends on the life of the spirit.\n\n  Reflex action of the emotions on the body functions\n\n  Child's body requires joy as much as food and air"
          },
          {
            "source": "spontaneous_activity",
            "line": 224,
            "excerpt": "Birth of individuality\n\n  Intellectual crises are accompanied by emotion\n\n  Older child beginning in system, chooses materials in"
          },
          {
            "source": "spontaneous_activity",
            "line": 665,
            "excerpt": "of the child. We are beset by such anxieties as these: it is necessary\nto form character, to develop the intelligence, to aid the unfolding\nand ordering of the emotions. And we ask ourselves how we ar"
          },
          {
            "source": "elementary_material",
            "line": 2600,
            "excerpt": "the placing of the adjective before the noun renders the meaning vague,\nfigurative, emotional, or generic, whereas it would be clearly\ndescriptive and precise were the adjective in its normal position"
          },
          {
            "source": "elementary_material",
            "line": 7360,
            "excerpt": "In this series should be given dialogues, interesting stories, passages\nwhich express emotional states of mind vividly portrayed. Such\nselections, as is true also of our shorter passages, ought to be "
          },
          {
            "source": "elementary_material",
            "line": 8156,
            "excerpt": "knees before him_ there will not be a simple act of kneeling, but\nsomething more dramatic. The child will assume the kneeling posture with\nsome indication of emotion. The children take no end of inter"
          }
        ]
      }
    },
    "environment": {
      "prepared": {
        "sources": [
          "spontaneous_activity",
          "own_handbook",
          "secret_of_childhood",
          "montessori_method",
          "absorbent_mind",
          "elementary_material"
        ],
        "line_ranges": {
          "absorbent_mind": [
            [
              474,
              541
            ],
            [
              10929,
              11023
            ],
            [
              11223,
              11318
            ],
            [
              12274,
              12446
            ],
            [
              13690,
              13783
            ]
          ],
          "secret_of_childhood": [
            [
              2554,
              2636
            ],
            [
              7779,
              7862
            ]
          ],
          "montessori_method": [
            [
              240,
              305
            ],
            [
              1725,
              1793
            ],
            [
              2617,
              2794
            ],
            [
              3117,
              3524
            ],
            [
              3789,
              3852
            ],
            [
              3966,
              4027
            ],
            [
              4164,
              4233
            ],
            [
              4964,
              5047
            ],
            [
              5376,
              5443
            ],
            [
              6199,
              6260
            ],
            [
              6659,
              6741
            ],
            [
              7564,
              7737
            ],
            [
              10012,
              10081
            ],
            [
              10182,
              10255
            ],
            [
              11890,
              11960
            ],
            [
              12762,
              12825
            ]
          ],
          "own_handbook": [
            [
              129,
              229
            ],
            [
              392,
              573
            ],
            [
              732,
              874
            ],
            [
              2759,
              2820
            ]
          ],
          "spontaneous_activity": [
            [
              3494,
              3561
            ],
            [
              4869,
              5012
            ]
          ],
          "elementary_material": [
            [
              529,
              616
            ],
            [
              734,
              797
            ],
            [
              2152,
              2282
            ],
            [
              2396,
              2456
            ],
            [
              5080,
              5272
            ],
            [
              7666,
              7809
            ],
            [
              7951,
              8140
            ],
            [
              8856,
              8940
            ],
            [
              9247,
              9325
            ],
            [
              10746,
              10817
            ],
            [
              11503,
              11756
            ],
            [
              12053,
              12120
            ],
            [
              12254,
              12398
            ],
            [
              12985,
              13049
            ],
            [
              13585,
              13645
            ],
            [
              16465,
              16596
            ]
          ]
        },
        "total_matches": 95,
        "key_passages": [
          {
            "source": "absorbent_mind",
            "line": 504,
            "excerpt": "ment. The task of the teacher then becomes not one of \ntalking, but one of preparing a series of motives of cultural \nactivity spread in a specially prepared environment."
          },
          {
            "source": "absorbent_mind",
            "line": 10985,
            "excerpt": "so that if there was a lazy child, we did not urge him to \nwork. We merely facilitated contact with the means of \ndevelopment in the prepared environment. As soon as \nhe found work all his trouble dis"
          },
          {
            "source": "absorbent_mind",
            "line": 12305,
            "excerpt": "first elements of character may be formed and acquire their \nparticular importance. That is why the question of the \nprepared environment in education, when first proclaimed \nto the world, gave rise t"
          },
          {
            "source": "secret_of_childhood",
            "line": 2602,
            "excerpt": "sensitive period of order, nature gives the first lesson,\nin the same way as a teacher will show a child a plan of\nthe classroom, to prepare him for the study of geogra-\nphical maps Or we may say that"
          },
          {
            "source": "secret_of_childhood",
            "line": 7832,
            "excerpt": "surety of action While the little boy at San Lorenzo\nshowed the disappomted visitors that though it was a\nholiday the children could open the classroom and\nwork even in the absence of their teacher, h"
          },
          {
            "source": "montessori_method",
            "line": 270,
            "excerpt": "importance of their reforms                                     56\n\n    The \"Children's House\" earned by the parents through their\n    care of the building                                            6"
          },
          {
            "source": "montessori_method",
            "line": 273,
            "excerpt": "care of the building                                            60\n\n    Pedagogical organization of the \"Children's House\"              62\n\n    The \"Children's House\" the first step toward the sociali"
          },
          {
            "source": "montessori_method",
            "line": 275,
            "excerpt": "Pedagogical organization of the \"Children's House\"              62\n\n    The \"Children's House\" the first step toward the socialisation\n    of the house                                                 "
          },
          {
            "source": "own_handbook",
            "line": 160,
            "excerpt": "PREFACE                                                           vii\n INTRODUCTORY REMARKS                                                1\n A \"CHILDREN'S HOUSE\"                                      "
          },
          {
            "source": "own_handbook",
            "line": 425,
            "excerpt": "A \"CHILDREN'S HOUSE\""
          },
          {
            "source": "own_handbook",
            "line": 428,
            "excerpt": "The \"Children's House\" is the _environment_ which is offered to the\nchild that he may be given the opportunity of developing his\nactivities. This kind of school is not of a fixed type, but may vary"
          },
          {
            "source": "spontaneous_activity",
            "line": 3531,
            "excerpt": "I will choose from various individual studies made by two mistresses\nof a Children's House at Rome for well-to-do children, those of two\nchildren of very different characters. One of these children ca"
          },
          {
            "source": "spontaneous_activity",
            "line": 4980,
            "excerpt": "furniture.\n\nIn a \"Children's House\" in the country, at Palidano, built to\ncommemorate the Marchese Carlo Guerrieri Gonzaga, we initiated the\nstudy of \"artistic\" furnishing. It is well known that every"
          },
          {
            "source": "spontaneous_activity",
            "line": 4899,
            "excerpt": "Not only must the teacher be transformed, but the school environment\nmust be changed. The introduction of the \"material of development\"\ninto an ordinary school cannot constitute the entire external"
          },
          {
            "source": "elementary_material",
            "line": 564,
            "excerpt": "This only proves, however, that on beginning elementary grade work we\ndid not depart from the \"Children's House\" idea; on the contrary we\nreturned to it to give distinct realization to the nebulous ho"
          },
          {
            "source": "elementary_material",
            "line": 566,
            "excerpt": "did not depart from the \"Children's House\" idea; on the contrary we\nreturned to it to give distinct realization to the nebulous hopes with\nwhich our first course concluded. Hence the \"Children's House"
          },
          {
            "source": "elementary_material",
            "line": 571,
            "excerpt": "the same thing, the continuation of an identical process.\n\nLet us return then to the \"Children's House\" and consider the child of\nfive and one-half years. To-day in those \"Children's Houses\" which hav"
          }
        ]
      },
      "home": {
        "sources": [
          "pedagogical_anthropology",
          "own_handbook",
          "spontaneous_activity",
          "secret_of_childhood",
          "montessori_method",
          "absorbent_mind",
          "elementary_material"
        ],
        "line_ranges": {
          "absorbent_mind": [
            [
              345,
              1037
            ],
            [
              1429,
              1511
            ],
            [
              1768,
              1953
            ],
            [
              2178,
              2527
            ],
            [
              3721,
              3987
            ],
            [
              4239,
              4314
            ],
            [
              4495,
              4903
            ],
            [
              5154,
              5542
            ],
            [
              5697,
              6014
            ],
            [
              6132,
              6277
            ],
            [
              6635,
              6700
            ],
            [
              6859,
              7136
            ],
            [
              7264,
              7404
            ],
            [
              8327,
              8392
            ],
            [
              8594,
              8658
            ],
            [
              9053,
              9455
            ],
            [
              9595,
              9780
            ],
            [
              10180,
              10956
            ],
            [
              11078,
              11560
            ],
            [
              11727,
              11797
            ],
            [
              12458,
              12561
            ],
            [
              13064,
              13262
            ],
            [
              13756,
              13826
            ],
            [
              13973,
              14054
            ],
            [
              14237,
              14400
            ],
            [
              14621,
              14773
            ],
            [
              14902,
              15018
            ],
            [
              15186,
              15263
            ],
            [
              15835,
              15906
            ],
            [
              16024,
              16123
            ]
          ],
          "secret_of_childhood": [
            [
              17,
              471
            ],
            [
              638,
              733
            ],
            [
              905,
              1412
            ],
            [
              1534,
              1669
            ],
            [
              1994,
              2767
            ],
            [
              2981,
              4287
            ],
            [
              4582,
              4749
            ],
            [
              5219,
              5407
            ],
            [
              5724,
              5859
            ],
            [
              5976,
              6416
            ],
            [
              6799,
              6869
            ],
            [
              7322,
              7412
            ],
            [
              7534,
              8099
            ],
            [
              8200,
              8446
            ],
            [
              8671,
              8817
            ],
            [
              9127,
              10298
            ]
          ],
          "montessori_method": [
            [
              240,
              309
            ],
            [
              739,
              1316
            ],
            [
              1664,
              1769
            ],
            [
              2713,
              3524
            ],
            [
              3729,
              3924
            ],
            [
              4092,
              4450
            ],
            [
              5047,
              5181
            ],
            [
              5396,
              5471
            ],
            [
              5943,
              6177
            ],
            [
              7823,
              7930
            ],
            [
              8544,
              8767
            ],
            [
              9808,
              9871
            ],
            [
              10089,
              10214
            ],
            [
              10510,
              10583
            ],
            [
              10855,
              10981
            ],
            [
              11213,
              11291
            ],
            [
              12152,
              12788
            ]
          ],
          "own_handbook": [
            [
              253,
              489
            ],
            [
              732,
              798
            ],
            [
              1421,
              1499
            ],
            [
              2844,
              2907
            ]
          ],
          "pedagogical_anthropology": [
            [
              54,
              123
            ],
            [
              622,
              701
            ],
            [
              1101,
              1207
            ],
            [
              1803,
              1876
            ],
            [
              2271,
              2865
            ],
            [
              3677,
              3743
            ],
            [
              4424,
              4582
            ],
            [
              5205,
              5464
            ],
            [
              5600,
              5672
            ],
            [
              5927,
              6451
            ],
            [
              6667,
              6734
            ],
            [
              6937,
              7344
            ],
            [
              7638,
              7920
            ],
            [
              8695,
              8777
            ],
            [
              9145,
              9208
            ],
            [
              10021,
              10087
            ],
            [
              12140,
              12205
            ],
            [
              12817,
              12890
            ],
            [
              13946,
              14015
            ],
            [
              15550,
              16080
            ],
            [
              16654,
              16716
            ],
            [
              17797,
              18677
            ],
            [
              18814,
              18908
            ],
            [
              19021,
              20513
            ],
            [
              20926,
              21009
            ],
            [
              21282,
              21468
            ],
            [
              23227,
              23289
            ],
            [
              23484,
              23544
            ],
            [
              23831,
              23893
            ]
          ],
          "spontaneous_activity": [
            [
              77,
              138
            ],
            [
              422,
              1061
            ],
            [
              1288,
              1831
            ],
            [
              2765,
              2838
            ],
            [
              3412,
              3494
            ],
            [
              3646,
              3714
            ],
            [
              4114,
              4209
            ],
            [
              4892,
              5126
            ],
            [
              5252,
              5323
            ],
            [
              5584,
              5654
            ],
            [
              5906,
              6138
            ],
            [
              6365,
              6588
            ],
            [
              6822,
              6901
            ],
            [
              7032,
              7188
            ],
            [
              8032,
              8183
            ],
            [
              8289,
              8521
            ],
            [
              8824,
              8891
            ],
            [
              8996,
              9071
            ],
            [
              9183,
              9695
            ],
            [
              9839,
              10185
            ],
            [
              10509,
              11121
            ],
            [
              11242,
              11420
            ]
          ],
          "elementary_material": [
            [
              1042,
              1113
            ],
            [
              1265,
              1327
            ],
            [
              1492,
              1738
            ],
            [
              2009,
              2116
            ],
            [
              2670,
              2818
            ],
            [
              4448,
              4510
            ],
            [
              5091,
              5153
            ],
            [
              5740,
              6339
            ],
            [
              6665,
              6895
            ],
            [
              7094,
              7375
            ],
            [
              8104,
              9000
            ],
            [
              9433,
              9533
            ],
            [
              10033,
              10244
            ],
            [
              11813,
              11935
            ],
            [
              12283,
              12359
            ],
            [
              12967,
              13032
            ],
            [
              13757,
              13828
            ],
            [
              14479,
              14643
            ],
            [
              14891,
              15073
            ],
            [
              15426,
              15515
            ],
            [
              16465,
              16551
            ]
          ]
        },
        "total_matches": 1037,
        "key_passages": [
          {
            "source": "absorbent_mind",
            "line": 3933,
            "excerpt": "other way, the doctor said to the relatives : \" I think \nyou had better send this person to get a breath of his \nnative air \". And the person was sent to his home \ntown, or the farm, or wherever he wa"
          },
          {
            "source": "absorbent_mind",
            "line": 4662,
            "excerpt": "preferably. He is not happy to go out, but would always \nlike to remain at home isolated from the world. Every- \nthing in the world that should make him happy frightens \nhim, he feels repugnance from "
          },
          {
            "source": "absorbent_mind",
            "line": 5951,
            "excerpt": "missionaries who witnessed the ceremony, the queen \nhad her child along with her. It never entered her head \nto leave the child at home. Another curious fact with \nthese people is that the period of b"
          },
          {
            "source": "secret_of_childhood",
            "line": 2280,
            "excerpt": "nurse who noticed that as she was wheeling a five-\nmonths-old baby in its perambulator slowly through the\ngrounds of its home, it showed special interest and joy\nat the sight of a white marble tablet "
          },
          {
            "source": "secret_of_childhood",
            "line": 3189,
            "excerpt": "piece by piece, so that the giraffe has the umbrella, the\ntiger the shoes, and so on, till poor little Sambo goes\nhome naked and crying But his parents forgive him\nand all ends happily in a grand feas"
          },
          {
            "source": "secret_of_childhood",
            "line": 3368,
            "excerpt": "must not talk or shout, must spend a lot of time lying\ndown, must eat and sleep ” Or else to decide that it\n“as best” for the child to be sent away from home,\neven among persons without affection and "
          },
          {
            "source": "montessori_method",
            "line": 278,
            "excerpt": "of the house                                                    65\n\n    The communised house in its relation to the home and to the\n    spiritual evolution of women                                    "
          },
          {
            "source": "montessori_method",
            "line": 780,
            "excerpt": "One such combination this Introduction will suggest, and it will discuss\nalso the possible uses of the Montessori apparatus in the home; but it\nmay be helpful first to present the outstanding characte"
          },
          {
            "source": "montessori_method",
            "line": 879,
            "excerpt": "their own experiences, sing songs, and recite verses, all in a company\nof friendly but fairly critical listeners, which does even more to\nstimulate and guide expression than does the circle at home. B"
          },
          {
            "source": "own_handbook",
            "line": 768,
            "excerpt": "older children in the progress of their little companions. It is\nenough just to set a child in these peaceful surroundings for him to\nfeel perfectly at home. In the cinematograph pictures the actual w"
          },
          {
            "source": "own_handbook",
            "line": 451,
            "excerpt": "material specially fitted for the intellectual development of the\nchild, but also a complete equipment for the management of the\nminiature family. The furniture is light so that the children can move\n"
          },
          {
            "source": "own_handbook",
            "line": 2874,
            "excerpt": "the inner activities of the child, is not a question which concerns\nmerely the school or the teachers; it is a universal question which\nconcerns the family, and is of vital interest to mothers.\n\nTo go"
          },
          {
            "source": "pedagogical_anthropology",
            "line": 1170,
            "excerpt": "equilibrium, by living in an environment that contains so many defects.\nThe child of luxury, living continually indoors, diligently studying in\nhis well-warmed home, under his mother's vigilant eye, i"
          },
          {
            "source": "pedagogical_anthropology",
            "line": 4550,
            "excerpt": "action. Suffers from chronic bronchial catarrh. Cranial nodules\n      very prominent. Began as a small child to steal in his own\n      home, and since then has received sentence after sentence for\n   "
          },
          {
            "source": "pedagogical_anthropology",
            "line": 5429,
            "excerpt": "and flexion of the trunk involve the whole vertebral column, while the\npelvis remains practically motionless. \"At the end of the day they rise\nfrom their task bowed over and they walk home bowed over,"
          },
          {
            "source": "spontaneous_activity",
            "line": 108,
            "excerpt": "How we receive the infants that come into the world.\n\n  Home has no furnishings adapted to their small size\n\n  Society prepares a mockery for their reception in the shape"
          },
          {
            "source": "spontaneous_activity",
            "line": 1566,
            "excerpt": "go there. I thought I had arrived, and I was so pleased. I have come a\nlong way, and I am so very, very tired.\" \"Indeed,\" replied the girl,\nwho was standing at the gate of her home, \"you are still a k"
          },
          {
            "source": "spontaneous_activity",
            "line": 1797,
            "excerpt": "people! How fortunate we are, on the other hand! We have so many\ngarments (they have learned this word) to cover ourselves with; we\nhave a stove at home and one at school, to warm us. How lucky we are"
          },
          {
            "source": "elementary_material",
            "line": 2047,
            "excerpt": "All these groups of words in their order are reproduced in special\nbooklets which the children may take home and read. In actual practise\nsuch books have proved both convenient and necessary. The chil"
          },
          {
            "source": "elementary_material",
            "line": 2057,
            "excerpt": "observe what great differences of meaning are sometimes caused by a very\nslight change in the word. At the same time these simple exercises, so\nfruitful in results, may be used for work at home and we"
          },
          {
            "source": "elementary_material",
            "line": 5122,
            "excerpt": "The exercises both of working out the conjugation of the verb and of\nwriting out new verbs may be performed at home."
          }
        ]
      },
      "nature": {
        "sources": [
          "pedagogical_anthropology",
          "own_handbook",
          "spontaneous_activity",
          "secret_of_childhood",
          "montessori_method",
          "absorbent_mind",
          "elementary_material"
        ],
        "line_ranges": {
          "absorbent_mind": [
            [
              51,
              121
            ],
            [
              314,
              587
            ],
            [
              1323,
              1511
            ],
            [
              1615,
              2589
            ],
            [
              2695,
              2763
            ],
            [
              2894,
              5671
            ],
            [
              5845,
              6271
            ],
            [
              6471,
              6876
            ],
            [
              7228,
              7318
            ],
            [
              7514,
              8130
            ],
            [
              8353,
              10070
            ],
            [
              10176,
              10251
            ],
            [
              10466,
              10527
            ],
            [
              10676,
              11001
            ],
            [
              11259,
              11682
            ],
            [
              11837,
              12294
            ],
            [
              12532,
              12900
            ],
            [
              13004,
              13435
            ],
            [
              13608,
              13738
            ],
            [
              13979,
              14247
            ],
            [
              14384,
              14886
            ],
            [
              15006,
              15116
            ],
            [
              15389,
              15629
            ],
            [
              15785,
              15916
            ],
            [
              16020,
              16165
            ]
          ],
          "secret_of_childhood": [
            [
              35,
              112
            ],
            [
              340,
              433
            ],
            [
              597,
              3092
            ],
            [
              3311,
              3598
            ],
            [
              3999,
              4098
            ],
            [
              4329,
              4618
            ],
            [
              4810,
              4923
            ],
            [
              5248,
              5353
            ],
            [
              5761,
              5825
            ],
            [
              5963,
              6158
            ],
            [
              6309,
              6735
            ],
            [
              6912,
              7322
            ],
            [
              7440,
              10295
            ]
          ],
          "montessori_method": [
            [
              113,
              421
            ],
            [
              564,
              662
            ],
            [
              803,
              1181
            ],
            [
              1295,
              1819
            ],
            [
              1963,
              2364
            ],
            [
              2794,
              3162
            ],
            [
              3287,
              3372
            ],
            [
              3784,
              4715
            ],
            [
              4869,
              6426
            ],
            [
              6656,
              6730
            ],
            [
              7002,
              7074
            ],
            [
              7593,
              7705
            ],
            [
              7868,
              7986
            ],
            [
              8096,
              8165
            ],
            [
              8288,
              8361
            ],
            [
              8638,
              9311
            ],
            [
              9470,
              9543
            ],
            [
              10101,
              10265
            ],
            [
              10395,
              10476
            ],
            [
              10600,
              10880
            ],
            [
              10991,
              11177
            ],
            [
              11835,
              11902
            ],
            [
              12039,
              12491
            ],
            [
              12621,
              12857
            ]
          ],
          "own_handbook": [
            [
              96,
              633
            ],
            [
              741,
              878
            ],
            [
              1499,
              1734
            ],
            [
              1858,
              2397
            ],
            [
              2514,
              2860
            ]
          ],
          "pedagogical_anthropology": [
            [
              106,
              175
            ],
            [
              335,
              935
            ],
            [
              1112,
              1522
            ],
            [
              1685,
              1767
            ],
            [
              1911,
              2851
            ],
            [
              2994,
              3642
            ],
            [
              3899,
              4167
            ],
            [
              4394,
              4479
            ],
            [
              4771,
              4982
            ],
            [
              5133,
              5194
            ],
            [
              5513,
              5693
            ],
            [
              5820,
              6495
            ],
            [
              6778,
              7080
            ],
            [
              7248,
              7327
            ],
            [
              7430,
              7513
            ],
            [
              8307,
              8591
            ],
            [
              10006,
              10094
            ],
            [
              10792,
              11584
            ],
            [
              11800,
              11867
            ],
            [
              12043,
              12177
            ],
            [
              12351,
              12420
            ],
            [
              12817,
              12887
            ],
            [
              13105,
              13165
            ],
            [
              13438,
              13508
            ],
            [
              13623,
              13689
            ],
            [
              13809,
              13874
            ],
            [
              14085,
              14204
            ],
            [
              14444,
              14511
            ],
            [
              14761,
              14930
            ],
            [
              15074,
              15348
            ],
            [
              15631,
              15711
            ],
            [
              15908,
              16091
            ],
            [
              16397,
              16465
            ],
            [
              17677,
              17889
            ],
            [
              18278,
              18497
            ],
            [
              18640,
              18737
            ],
            [
              18936,
              19061
            ],
            [
              19256,
              19680
            ],
            [
              19834,
              20610
            ],
            [
              20909,
              21009
            ],
            [
              21220,
              21424
            ],
            [
              23033,
              23148
            ],
            [
              23575,
              23638
            ]
          ],
          "spontaneous_activity": [
            [
              157,
              373
            ],
            [
              584,
              1144
            ],
            [
              1256,
              1348
            ],
            [
              1885,
              1950
            ],
            [
              2193,
              2277
            ],
            [
              2440,
              2521
            ],
            [
              2715,
              2861
            ],
            [
              3058,
              3384
            ],
            [
              3866,
              4023
            ],
            [
              4209,
              4919
            ],
            [
              5089,
              5156
            ],
            [
              5267,
              5906
            ],
            [
              6015,
              6638
            ],
            [
              6750,
              7999
            ],
            [
              8132,
              8390
            ],
            [
              8615,
              8702
            ],
            [
              9009,
              9085
            ],
            [
              9439,
              9867
            ],
            [
              10105,
              11169
            ],
            [
              11290,
              11358
            ]
          ],
          "elementary_material": [
            [
              100,
              207
            ],
            [
              452,
              725
            ],
            [
              1328,
              1416
            ],
            [
              2081,
              2152
            ],
            [
              3391,
              3571
            ],
            [
              5969,
              6031
            ],
            [
              7353,
              7560
            ],
            [
              7689,
              8025
            ],
            [
              8140,
              8206
            ],
            [
              8554,
              8949
            ],
            [
              11838,
              12188
            ],
            [
              12400,
              12472
            ],
            [
              12816,
              12883
            ],
            [
              13037,
              13100
            ],
            [
              13992,
              14145
            ],
            [
              14323,
              14384
            ],
            [
              14822,
              14888
            ],
            [
              15216,
              15330
            ],
            [
              16247,
              16347
            ],
            [
              16465,
              16549
            ],
            [
              16839,
              16950
            ]
          ]
        },
        "total_matches": 1309,
        "key_passages": [
          {
            "source": "absorbent_mind",
            "line": 90,
            "excerpt": "made on scientific foundations, but it is the plea also of \none who has witnessed and helped the manifestations of \nchild-nature all over the world, manifestations of mental \nand spiritual grandeur, w"
          },
          {
            "source": "absorbent_mind",
            "line": 348,
            "excerpt": "Observation, very general and wide-spread, has \nshown that small children are endowed with a special \npsychic nature. This shows us a new way of imparting \neducation ! A different form which concerns "
          },
          {
            "source": "absorbent_mind",
            "line": 406,
            "excerpt": "period of life. It is as if he had a particular time-table* \nIndeed, he follows faithfully a severe syllabus which has \nbeen imposed by nature and with such exactitude that \neven the most pains-taking"
          },
          {
            "source": "secret_of_childhood",
            "line": 66,
            "excerpt": "BIOLOGICAL PRELUDE\nTHE NEW-BORN BABE\nNATURE’S TEACHING\nTHE ACHIEVEMENT OF INCARNATION"
          },
          {
            "source": "secret_of_childhood",
            "line": 371,
            "excerpt": "scious that allows discoveries to be made an the cases\nof adults, becomes an obstacle in the case of the child\nThe child, who by nature 15 not a fit subject for such\ntechnique, has not to remember his"
          },
          {
            "source": "secret_of_childhood",
            "line": 400,
            "excerpt": "sufferings that convulse the intact and delicate spiritual\nexistence of the child, organismg in his subconscious\na lower man, different from what nature had intended\n\nThis complex question psycho-anal"
          },
          {
            "source": "montessori_method",
            "line": 148,
            "excerpt": "the _Case dei Bambini_ offers, it seems to me, an experimental field for\nthe study of man, and promises, perhaps, the development of a science\nthat shall disclose other secrets of nature.\n\nIn the peri"
          },
          {
            "source": "montessori_method",
            "line": 342,
            "excerpt": "REFECTION--THE CHILD'S DIET\n\n    Diet must be adapted to the child's physical nature            125\n\n    Foods and their preparation                                    126"
          },
          {
            "source": "montessori_method",
            "line": 371,
            "excerpt": "CHAPTER X\n\nNATURE IN EDUCATION--AGRICULTURAL LABOUR: CULTURE OF PLANTS\nAND ANIMALS"
          },
          {
            "source": "own_handbook",
            "line": 342,
            "excerpt": "Man will always be able to avoid \"external work\" by making use of the\nlabor of others, but there is no possibility of shirking that inner\nwork. Together with birth and death it has been imposed by nat"
          },
          {
            "source": "own_handbook",
            "line": 415,
            "excerpt": "defects of speech, errors of perception and of reasoning, and lack of\ncharacter in normal children, it would perhaps be interesting to\ncompare them with statistics of the same nature, but compiled fro"
          },
          {
            "source": "own_handbook",
            "line": 1533,
            "excerpt": "When these cases are shaken they produce sounds varying in intensity\nfrom loud to almost imperceptible sounds, according to the nature of\nthe objects inside the cylinder."
          },
          {
            "source": "pedagogical_anthropology",
            "line": 374,
            "excerpt": "of man\"; because the greater part of acquirable knowledge has for\nits subject the human race or the individual human being; philosophy\nstudies his origin, his essential nature, his characteristics;\nli"
          },
          {
            "source": "pedagogical_anthropology",
            "line": 385,
            "excerpt": "applies to the study of animals, anthropology must apply to the study\nof man; and by doing so it enrolls itself as a science in the field of\nnature.\n\nZoology has a well-defined point of departure, tha"
          },
          {
            "source": "pedagogical_anthropology",
            "line": 459,
            "excerpt": "epoch of materialistic philosophy and analytical investigation could\nnaturally hardly be expected to prove a field of victory for _man_,\nthe intelligent animal, and nature's most splendid achievement "
          },
          {
            "source": "spontaneous_activity",
            "line": 188,
            "excerpt": "which may be determined experimentally.\n\n  Tendency to develop his latent powers exists in the child's nature\n\n  Environment should contain the means of auto-education"
          },
          {
            "source": "spontaneous_activity",
            "line": 220,
            "excerpt": "Initial disorder in Montessori schools\n\n  Psychical progress not systematic but \"explosive in nature\"\n\n  Birth of individuality"
          },
          {
            "source": "spontaneous_activity",
            "line": 235,
            "excerpt": "Problems of psychical measurement\n\n  Observing the child's moral nature\n\n  Transformation of a \"violent\" child and of a \"spying\" child"
          },
          {
            "source": "elementary_material",
            "line": 133,
            "excerpt": "languages. The immediate result is that the Montessori material offers\nmuch that is inapplicable and fails to touch on much that is essential\nto the teaching of English grammar. The nature and extent "
          },
          {
            "source": "elementary_material",
            "line": 177,
            "excerpt": "is due simply to the peculiar conditions surrounding the teaching of\nlanguage in Italy, where general concepts of the national language are\naffected by the existence of powerful dialects and the unsta"
          },
          {
            "source": "elementary_material",
            "line": 482,
            "excerpt": "Making decorative designs with the aid of geometric insets        312\n\n  Water-color paintings from nature                                 313\n\n  The monocord                                          "
          }
        ]
      }
    },
    "social_development": {
      "grace_courtesy": {
        "sources": [
          "pedagogical_anthropology",
          "spontaneous_activity",
          "secret_of_childhood",
          "montessori_method",
          "absorbent_mind",
          "elementary_material"
        ],
        "line_ranges": {
          "absorbent_mind": [
            [
              11280,
              11354
            ],
            [
              12245,
              12446
            ],
            [
              12710,
              12775
            ]
          ],
          "secret_of_childhood": [
            [
              6422,
              6604
            ],
            [
              7743,
              7827
            ],
            [
              10061,
              10129
            ]
          ],
          "montessori_method": [
            [
              10440,
              10516
            ]
          ],
          "pedagogical_anthropology": [
            [
              395,
              461
            ],
            [
              1101,
              1182
            ],
            [
              6579,
              6647
            ],
            [
              15116,
              15195
            ]
          ],
          "spontaneous_activity": [
            [
              1528,
              1597
            ],
            [
              2034,
              2108
            ],
            [
              5746,
              5815
            ],
            [
              9026,
              9094
            ]
          ],
          "elementary_material": [
            [
              2628,
              2718
            ],
            [
              3173,
              3234
            ],
            [
              4764,
              4827
            ],
            [
              6137,
              6228
            ],
            [
              7913,
              7981
            ],
            [
              16381,
              16530
            ]
          ]
        },
        "total_matches": 25,
        "key_passages": [
          {
            "source": "absorbent_mind",
            "line": 11311,
            "excerpt": "exactness of detail. Among the people helping them were \naristocrats who taught them many refined details of social \nmanners that were not known outside aristocratic circles, \nand these details and th"
          },
          {
            "source": "absorbent_mind",
            "line": 12744,
            "excerpt": "discrimination in determining when to help. They help each \nother frequently when it is not necessary. A gentleman \nwill often (as a matter of good manners) adjust a chair \nat a table to help a young "
          },
          {
            "source": "absorbent_mind",
            "line": 12277,
            "excerpt": "THE first work the child has to do is to find the way and \nthe means to concentration which lays the foundations \nof the character and prepares social behaviour. This im- \nmediately shows the importan"
          },
          {
            "source": "secret_of_childhood",
            "line": 6463,
            "excerpt": "of the exercise Free choice Control by error\nAnalysts of movements Silence exercises Good\nmanners in social contacts Order m the environ-\nment Meticulous personal cleanlmess Sense edu-\ncation Wnitng i"
          },
          {
            "source": "secret_of_childhood",
            "line": 6574,
            "excerpt": "tie in their long veils, moved in calm and silence\n\nThey taught the children good manners, with in-\ncreasing insistence on detail Many came from the\nanstocracy, and these put into practice the most me"
          },
          {
            "source": "secret_of_childhood",
            "line": 7797,
            "excerpt": "bumself with umpedmg the child m his actions, but\ntells hum “You can't do that, it 1s no use trymg,” or\nif it is someone of rougher manners, it will be, “You\nsilly, why d’you want to do that, don’t yo"
          },
          {
            "source": "montessori_method",
            "line": 10483,
            "excerpt": "The child who had read the name then offered to his little friend the\ntoy with which he had been playing. We taught the children to present\nthese toys in a gracious and polite way, accompanying the ac"
          },
          {
            "source": "pedagogical_anthropology",
            "line": 425,
            "excerpt": "zoology, it is extended to include the _habits_ of the individual\nliving being; that is to say, in the case of man, the language, the\nmanners and customs (data that determine the _level of civilisatio"
          },
          {
            "source": "pedagogical_anthropology",
            "line": 1137,
            "excerpt": "This child, weak in mind and in muscular force, when compared with\nthe child of wealth, grown up in a favorable environment, shows less\nattractive manners, because he has been reared in an atmosphere "
          },
          {
            "source": "pedagogical_anthropology",
            "line": 1140,
            "excerpt": "social inferiority, and in school is classed as a pariah. Less good\nlooking and less refined, he fails to enlist the sympathy which the\nteacher so readily concedes to the courteous manners of more for"
          },
          {
            "source": "spontaneous_activity",
            "line": 1562,
            "excerpt": "(N.B.--The actions are all invented and narrated.)\n\n_Agreeable manners. Incident_.--\"Is it true, Miss, that the village\nchurch is more than a kilometer from here? My mother has ordered me to\ngo there."
          },
          {
            "source": "spontaneous_activity",
            "line": 2078,
            "excerpt": "feel for him, the good opinion we have of him?--Honor ...\n    reputation.--Well, this honor, this reputation, Paul acquired\n    by good conduct and good manners. These are things which\n    belong to h"
          },
          {
            "source": "spontaneous_activity",
            "line": 5778,
            "excerpt": "the vigilant and immediate control of the consciousness; and such a\nperpetual effort cannot certainly compete with the \"habit\" of\ndistinguished manners. The will stores up its prolonged efforts\noutsid"
          },
          {
            "source": "elementary_material",
            "line": 2686,
            "excerpt": "grazioso              graziosa           graceful\n  grande                grande             large\n  garbati               garbate            polite\n  gentili               gentili            kind\n  i"
          },
          {
            "source": "elementary_material",
            "line": 7948,
            "excerpt": "thus becoming correctional in character! While the child is telling his\nstory, there is a constant suppression of interruptions: \"Hush, I did\nnot call on you,\" \"Wait till you are called on,\" \"It is no"
          },
          {
            "source": "elementary_material",
            "line": 16437,
            "excerpt": "chair? It is hard, it is brown, it is wooden. What\n      about your school-mates, the children? Are they good,\n      are they pretty, are they polite, are they obedient,\n      or are they naughty, imp"
          }
        ]
      },
      "social_interaction": {
        "sources": [
          "pedagogical_anthropology",
          "own_handbook",
          "spontaneous_activity",
          "secret_of_childhood",
          "montessori_method",
          "absorbent_mind",
          "elementary_material"
        ],
        "line_ranges": {
          "absorbent_mind": [
            [
              112,
              343
            ],
            [
              521,
              1072
            ],
            [
              1685,
              1991
            ],
            [
              2866,
              2932
            ],
            [
              3914,
              3987
            ],
            [
              4656,
              4717
            ],
            [
              5104,
              5519
            ],
            [
              5689,
              5999
            ],
            [
              6344,
              6411
            ],
            [
              6876,
              6966
            ],
            [
              7887,
              8062
            ],
            [
              8922,
              9013
            ],
            [
              9170,
              9548
            ],
            [
              9695,
              9793
            ],
            [
              10488,
              10572
            ],
            [
              10858,
              10921
            ],
            [
              11280,
              11699
            ],
            [
              12243,
              13641
            ],
            [
              14789,
              14856
            ],
            [
              15157,
              15233
            ],
            [
              15854,
              15938
            ]
          ],
          "secret_of_childhood": [
            [
              130,
              416
            ],
            [
              691,
              755
            ],
            [
              1683,
              1763
            ],
            [
              2378,
              2447
            ],
            [
              2725,
              2795
            ],
            [
              3214,
              3433
            ],
            [
              3705,
              4059
            ],
            [
              4309,
              4474
            ],
            [
              4595,
              4724
            ],
            [
              4940,
              5075
            ],
            [
              5792,
              6046
            ],
            [
              6422,
              6698
            ],
            [
              6909,
              6979
            ],
            [
              7322,
              7412
            ],
            [
              7534,
              7676
            ],
            [
              7779,
              7851
            ],
            [
              8257,
              8785
            ],
            [
              9138,
              10295
            ]
          ],
          "montessori_method": [
            [
              217,
              486
            ],
            [
              667,
              1222
            ],
            [
              1407,
              1481
            ],
            [
              1782,
              2161
            ],
            [
              2546,
              3034
            ],
            [
              3168,
              3444
            ],
            [
              3836,
              4027
            ],
            [
              4216,
              4396
            ],
            [
              4968,
              5208
            ],
            [
              5864,
              6040
            ],
            [
              6300,
              6376
            ],
            [
              7900,
              7970
            ],
            [
              8125,
              8192
            ],
            [
              10255,
              10476
            ],
            [
              10750,
              10874
            ],
            [
              12397,
              12469
            ],
            [
              12772,
              12939
            ]
          ],
          "own_handbook": [
            [
              184,
              405
            ],
            [
              531,
              593
            ],
            [
              1703,
              1794
            ],
            [
              2004,
              2128
            ],
            [
              3057,
              3122
            ]
          ],
          "pedagogical_anthropology": [
            [
              82,
              1236
            ],
            [
              1718,
              1924
            ],
            [
              2347,
              2438
            ],
            [
              3389,
              3743
            ],
            [
              3912,
              4265
            ],
            [
              4561,
              4686
            ],
            [
              4793,
              4897
            ],
            [
              5491,
              5785
            ],
            [
              5969,
              6310
            ],
            [
              6953,
              7261
            ],
            [
              7430,
              7603
            ],
            [
              7722,
              7884
            ],
            [
              8152,
              8370
            ],
            [
              8551,
              8777
            ],
            [
              8956,
              9021
            ],
            [
              10996,
              11584
            ],
            [
              11752,
              11838
            ],
            [
              12268,
              12340
            ],
            [
              13011,
              13144
            ],
            [
              13838,
              13937
            ],
            [
              14309,
              14371
            ],
            [
              15181,
              15614
            ],
            [
              15757,
              16125
            ],
            [
              17408,
              17469
            ],
            [
              17753,
              18039
            ],
            [
              18270,
              18336
            ],
            [
              18451,
              18515
            ],
            [
              18993,
              19084
            ],
            [
              19276,
              19340
            ],
            [
              19762,
              19834
            ],
            [
              20129,
              20535
            ],
            [
              21222,
              21562
            ],
            [
              23116,
              23267
            ],
            [
              23533,
              23596
            ],
            [
              23719,
              23812
            ],
            [
              23954,
              24019
            ]
          ],
          "spontaneous_activity": [
            [
              66,
              129
            ],
            [
              445,
              507
            ],
            [
              824,
              1090
            ],
            [
              2152,
              2223
            ],
            [
              2727,
              2794
            ],
            [
              3460,
              3644
            ],
            [
              4442,
              4543
            ],
            [
              4654,
              4740
            ],
            [
              4880,
              4944
            ],
            [
              5045,
              5213
            ],
            [
              5326,
              5410
            ],
            [
              5613,
              6138
            ],
            [
              6447,
              6694
            ],
            [
              7238,
              7299
            ],
            [
              7551,
              7622
            ],
            [
              8448,
              8521
            ],
            [
              8907,
              9511
            ],
            [
              9814,
              10112
            ],
            [
              10304,
              10535
            ],
            [
              10794,
              10882
            ],
            [
              11459,
              11524
            ]
          ],
          "elementary_material": [
            [
              11992,
              12229
            ],
            [
              13336,
              13411
            ],
            [
              14926,
              15037
            ],
            [
              16729,
              16950
            ],
            [
              17221,
              17286
            ]
          ]
        },
        "total_matches": 601,
        "key_passages": [
          {
            "source": "absorbent_mind",
            "line": 142,
            "excerpt": "nation . . . .261 \nXIX. Character and its Defects in Young Children . 276 \nXX. A Social Contribution of the Child : Normal- \nization. .... 288 \nXXI. Character- building a Conquest, not a Defence . 302"
          },
          {
            "source": "absorbent_mind",
            "line": 168,
            "excerpt": "Social Development \n\nSociety by Cohesion"
          },
          {
            "source": "absorbent_mind",
            "line": 301,
            "excerpt": "of knowledge that is required, the consideration of the \nhuman personality alone can lead us to salvation. And \nwe hold in front of our eyes a psychic entity, a social \npersonality, immense in multitu"
          },
          {
            "source": "secret_of_childhood",
            "line": 247,
            "excerpt": "that he represented an unknown quantity, the discovery\nof which might enable the adult to solve his individual\nand social problems This aspect may prove the\nfoundation of a new science of child study,"
          },
          {
            "source": "secret_of_childhood",
            "line": 249,
            "excerpt": "and social problems This aspect may prove the\nfoundation of a new science of child study, capable of\ninfluencing the whole social hfe of man\n\nTHE CHILD AND PSYCHO-ANALYSIS"
          },
          {
            "source": "secret_of_childhood",
            "line": 312,
            "excerpt": "of treatnmg the sick been wholly satisfactory, for it\nhas not always led to a healing of “sickness of the\nsoul” As a result, social traditions, which are the\ndeposit of ancient experience, have risen "
          },
          {
            "source": "montessori_method",
            "line": 248,
            "excerpt": "children                                                        42\n\n    Social and pedagogic importance of the \"Children's Houses\"      44"
          },
          {
            "source": "montessori_method",
            "line": 332,
            "excerpt": "Suggested schedule for the \"Children's Houses\"                 119\n\n    The child must be prepared for the forms of social life and\n    his attention attracted to these forms                         1"
          },
          {
            "source": "montessori_method",
            "line": 456,
            "excerpt": "GENERAL NOTES ON THE EDUCATION OF THE SENSES\n\n    Aim in education biological and social                         215\n\n    Education of the senses makes men observers and prepares them"
          },
          {
            "source": "own_handbook",
            "line": 246,
            "excerpt": "advantages. Mothers have learned to welcome the dictates of modern\nhygiene and to put them into practice in bringing up their children.\nMany new social institutions have sprung up and have been perfec"
          },
          {
            "source": "own_handbook",
            "line": 328,
            "excerpt": "These exertions are very different from those put forth by mankind in\nso-called _external work_, that is to say, in \"social production,\"\nwhether in the schools where man is taught, or in the world whe"
          },
          {
            "source": "own_handbook",
            "line": 374,
            "excerpt": "If we think of an emigrant who goes to a new country ignorant of its\nproducts, ignorant of its natural appearance and social order,\nentirely ignorant of its language, we realize that there is an immen"
          },
          {
            "source": "pedagogical_anthropology",
            "line": 116,
            "excerpt": "research, must rise to philosophic conceptions regarding the _future\ndestiny_ of man from the biological point of view. The study of\ncongenital anomalies and of their biological and social origin, mus"
          },
          {
            "source": "pedagogical_anthropology",
            "line": 131,
            "excerpt": "The present-day importance assumed by all the sciences calculated to\nregenerate education and its environment, the school, has profound\nsocial roots and is forced upon us as the necessary path toward "
          },
          {
            "source": "pedagogical_anthropology",
            "line": 155,
            "excerpt": "system: namely, that each chapter is complete in itself--for example,\nthe first chapter, which is very long, contains an outline of general\nbiology, and at the same time biological and social generali"
          },
          {
            "source": "spontaneous_activity",
            "line": 98,
            "excerpt": "Supplying the child's physical needs is not sufficient\n\n  Child's social rights overlooked in the administration of\n  orphan asylums"
          },
          {
            "source": "spontaneous_activity",
            "line": 476,
            "excerpt": "Surveillance for vicious habits originating in the school\n\n  Developing the \"social sentiment\" in the school\n\n  \"A moral with every lesson\" the teacher's aim"
          },
          {
            "source": "spontaneous_activity",
            "line": 867,
            "excerpt": "What are the rights of children? Let us consider them for a moment as\na social class, as a class of workers, for as a fact they are laboring\nto produce men. They are the future generation. They work, "
          },
          {
            "source": "elementary_material",
            "line": 14956,
            "excerpt": "SCHOOL YEAR 191..-191..\n\n  SOCIAL HISTORY\n\n  FATHER:"
          },
          {
            "source": "elementary_material",
            "line": 15007,
            "excerpt": "patriotism, or their opposites, affectionateness,\n     honesty, modest, neatness, generosity, kindness,\n     independence, etc. The social relationships between\n     husband and wife (rights, privileg"
          },
          {
            "source": "elementary_material",
            "line": 16910,
            "excerpt": "By the expression \"moral education\" we mean an\n      education which tends to make a social being of an\n      individual who is by nature extra- or anti-social. It\n      presents two aspects which may"
          }
        ]
      },
      "mixed_ages": {
        "sources": [
          "pedagogical_anthropology",
          "own_handbook",
          "spontaneous_activity",
          "secret_of_childhood",
          "montessori_method",
          "absorbent_mind",
          "elementary_material"
        ],
        "line_ranges": {
          "absorbent_mind": [
            [
              7377,
              7448
            ],
            [
              9965,
              10040
            ],
            [
              10166,
              10369
            ],
            [
              11942,
              12046
            ],
            [
              12452,
              12699
            ],
            [
              13163,
              13413
            ]
          ],
          "secret_of_childhood": [
            [
              2386,
              2458
            ]
          ],
          "montessori_method": [
            [
              896,
              1159
            ],
            [
              4924,
              5101
            ],
            [
              7325,
              7409
            ],
            [
              7544,
              7759
            ],
            [
              12392,
              12469
            ]
          ],
          "own_handbook": [
            [
              732,
              798
            ],
            [
              2746,
              2813
            ]
          ],
          "pedagogical_anthropology": [
            [
              10411,
              10548
            ]
          ],
          "spontaneous_activity": [
            [
              406,
              467
            ],
            [
              3468,
              3561
            ],
            [
              5073,
              5156
            ],
            [
              5574,
              5638
            ],
            [
              8675,
              8749
            ]
          ],
          "elementary_material": [
            [
              2336,
              2396
            ],
            [
              12254,
              12340
            ],
            [
              12826,
              12891
            ],
            [
              13591,
              13664
            ],
            [
              15029,
              15091
            ],
            [
              15258,
              15319
            ]
          ]
        },
        "total_matches": 37,
        "key_passages": [
          {
            "source": "absorbent_mind",
            "line": 7408,
            "excerpt": "penetrate into the mind of the child. From the example \ngiven one can see that the little child tries to carry out \nthe activities followed by older children. If one intro- \nduces the child of three y"
          },
          {
            "source": "absorbent_mind",
            "line": 10010,
            "excerpt": "five and a half to six years, it was clear that writing \ncould be achieved with such joy and enthusiasm only \nbefore this age, while older children of six or seven were \nnot capable of doing this and "
          },
          {
            "source": "absorbent_mind",
            "line": 10197,
            "excerpt": "was which. \n\nIn Kodaikanal I once saw older children of 14 years \nof age, who were studying in the ordinary school, puzzled \nover the name of a part of the flower, a tiny child of"
          },
          {
            "source": "secret_of_childhood",
            "line": 2426,
            "excerpt": "back He still feels small details of disorder, which\nadults or even older children do not notice If, for\nsstance, a piece of soap is left on the wash-stand in-\nstead of in the soap-dish, or a chair 1s"
          },
          {
            "source": "montessori_method",
            "line": 950,
            "excerpt": "fatigue by watching carefully for the first signs of weariness and\nstopping the work promptly on their appearance. For small groups of the\nolder children, who can do work of this sort with ease and en"
          },
          {
            "source": "montessori_method",
            "line": 1127,
            "excerpt": "ordinary supply of cards is exhausted; and the wholly sensory appeal of\nthrowing stones into the water gives satisfaction enough to absorb for a\nlong time the attention of older children--to say nothi"
          },
          {
            "source": "montessori_method",
            "line": 4954,
            "excerpt": "1-2. Directed games, if possible, in the open air. During this\n    period the older children in turn go through with the\n    exercises of practical life, cleaning the room, dusting,\n    putting the ma"
          },
          {
            "source": "own_handbook",
            "line": 766,
            "excerpt": "activity develops a fellow-feeling, an attitude of mutual aid, and,\nmost wonderful of all, an intelligent interest on the part of the\nolder children in the progress of their little companions. It is\ne"
          },
          {
            "source": "own_handbook",
            "line": 2780,
            "excerpt": "not _fatigued_ by the order of the work, our children must have a new\nkind of school for the acquisition of culture. My experiments in the\ncontinuation of this method for older children are already fa"
          },
          {
            "source": "pedagogical_anthropology",
            "line": 10459,
            "excerpt": "aggregate number of 2,230, and are not always sufficiently numerous\nwhen distributed according to their ages. Nevertheless, in the great\nmajority of groups, especially those including the younger chil"
          },
          {
            "source": "spontaneous_activity",
            "line": 436,
            "excerpt": "Fable in schools does not prepare for religious teaching\n\nThe education of the imagination in schools for older children.\n\n  Environment and method oppressive"
          },
          {
            "source": "spontaneous_activity",
            "line": 5109,
            "excerpt": "same form of liberty for our children as that proper to cats and dogs?\nChildren, indeed, when left to themselves to take exercise, show\nimpatience, and are prone to quarrel and cry; older children fee"
          },
          {
            "source": "spontaneous_activity",
            "line": 5607,
            "excerpt": "Turning to attention, the primitive fact of correspondence between\nnature and stimulus which is the fundamental of life should prevail,\nhowever modified, when dealing with older children, and should r"
          },
          {
            "source": "elementary_material",
            "line": 2366,
            "excerpt": "Nothing but actual experiment could possibly have revealed it to us. One\nday, in fact, our little children were invited to be present at a\ndramatic entertainment given by the older children of the Pub"
          },
          {
            "source": "elementary_material",
            "line": 12288,
            "excerpt": "single bell, sometimes reaching out for it with the greatest eagerness.\nThey beat it with the mallet for a long time, they feel of it, examining\nit carefully, making it ring more and more slowly. The "
          },
          {
            "source": "elementary_material",
            "line": 12856,
            "excerpt": "The children were invited into the large hall and left to themselves\nwhile the lady was playing on the piano our third melody, a march. The\nolder children caught the movement at once. After they had b"
          }
        ]
      }
    }
  }
}